Repository: pypi-data/pypi-mirror-404
Catalog: packages/sigima/sigima-1.0.6.tar.gz/sigima-1.0.6/doc/locale/*/LC_MESSAGES/release_notes/release_1.00.po
Languages: fr

source: This operation was previously impossible, even if the ambiguous X-Y mode feature existed and seemed related to this use case (but this feature performs resampling/interpolation, which is not desired here)
fr: Cette opération était auparavant impossible, même si la fonctionnalité ambiguë du mode X-Y existait et semblait liée à ce cas d'utilisation (mais cette fonctionnalité effectue un rééchantillonnage/interpolation, ce qui n'est pas souhaité ici)

source: The new function directly uses Y arrays from both signals without interpolation, requiring signals to have the same number of points
fr: La nouvelle fonction utilise directement les tableaux Y des deux signaux sans interpolation, nécessitant que les signaux aient le même nombre de points

source: Takes two signals: first provides Y data for output, second provides Y data to become X coordinates
fr: A partir de deux signaux en entrée : le premier fournit les données Y pour la sortie, le second fournit les données Y qui deviendront les coordonnées X

source: Automatically transfers metadata: X label/unit from second signal's Y label/unit, Y label/unit preserved from first signal
fr: Transfert automatique des métadonnées : étiquette/unité X à partir de l'étiquette/unité Y du second signal, étiquette/unité Y préservée du premier signal

source: Typical use case: spectroscopy wavelength calibration (combine absorption measurements with wavelength scale)
fr: Cas d'utilisation typique : étalonnage en longueur d'onde en spectroscopie (combiner les mesures d'absorption avec l'échelle de longueur d'onde)

source: This closes [Issue #4](https://github.com/DataLab-Platform/Sigima/issues/4) - Missing functionality: Replace X coordinates with Y values from another signal for calibration
fr: Ceci clôture [Issue #4](https://github.com/DataLab-Platform/Sigima/issues/4) - Fonctionnalité manquante : Remplacer les coordonnées X par les valeurs Y d'un autre signal pour l'étalonnage

source: Signal title formatting:
fr: Formatage des titres de signaux :

source: **Polynomial signal titles**: Fixed polynomial signal title generation to display mathematical notation (e.g., `1+2x-3x²+4x³`) instead of verbose parameter listing (e.g., `polynomial(a0=1,a1=2,a2=-3,a3=4,a4=0,a5=0)`)
fr: **Titres de signaux polynomiaux** : Correction de la génération des titres de signaux polynomiaux pour afficher une notation mathématique (par exemple, `1+2x-3x²+4x³`) au lieu d'une liste de paramètres verbeuse (par exemple, `polynomial(a0=1,a1=2,a2=-3,a3=4,a4=0,a5=0)`)

source: The `PolyParam.generate_title()` method now constructs proper mathematical expressions with correct sign handling, coefficient simplification (e.g., `x` instead of `1x`, `-x` instead of `-1x`), and exponent notation using `^` symbol
fr: La méthode `PolyParam.generate_title()` construit désormais des expressions mathématiques appropriées avec une gestion correcte des signes, une simplification des coefficients (par exemple, `x` au lieu de `1x`, `-x` au lieu de `-1x`) et une notation des exposants utilisant le symbole `^`

source: Improves readability in DataLab GUI and signal listings by presenting polynomials in standard mathematical form
fr: Améliore la lisibilité dans l'interface graphique de DataLab et les listes de signaux en présentant les polynômes sous une forme mathématique standard

source: Zero coefficients are automatically omitted from the expression (e.g., `1+x+x³` when a2=0)
fr: Les coefficients nuls sont automatiquement omis de l'expression (par exemple, `1+x+x³` lorsque a2=0)

source: Handles edge cases including all-zero polynomials (returns `"0"`), single terms, and negative coefficients
fr: Gère les cas limites, y compris les polynômes tous nuls (renvoie `"0"`), les termes uniques et les coefficients négatifs

source: This closes [Issue #3](https://github.com/DataLab-Platform/Sigima/issues/3) - Polynomial signal titles should use mathematical notation instead of parameter listing
fr: Ceci clôture [Issue #3](https://github.com/DataLab-Platform/Sigima/issues/3) - Les titres des signaux polynomiaux doivent utiliser une notation mathématique au lieu d'une liste de paramètres

source: ROI data extraction:
fr: Extraction de données ROI :

source: Fixed `ValueError: zero-size array to reduction operation minimum which has no identity` error when computing statistics on images with ROI extending beyond canvas boundaries
fr: Correction de l'erreur `ValueError: zero-size array to reduction operation minimum which has no identity` lors du calcul des statistiques sur des images avec ROI s'étendant au-delà des limites de la zone de dessin

source: The `ImageObj.get_data()` method now properly clips ROI bounding boxes to image boundaries
fr: La méthode `ImageObj.get_data()` limite désormais correctement les boîtes englobantes des ROI aux limites de l'image

source: When a ROI is completely outside the image bounds, returns a fully masked 1x1 array (containing NaN) to avoid zero-size array errors in statistics computations
fr: Lorsqu'une ROI est complètement en dehors des limites de l'image, renvoie un tableau 1x1 entièrement masqué (contenant NaN) pour éviter les erreurs de tableau de taille zéro dans les calculs statistiques

source: Partial overlap ROIs are correctly handled by clipping coordinates to valid image ranges
fr: Les ROI partiellement superposées sont correctement gérées en limitant les coordonnées aux plages valides de l'image

source: This fix ensures robust statistics computation regardless of ROI position relative to image boundaries
fr: Ce correctif garantit un calcul statistique robuste quel que soit la position de la ROI par rapport aux limites de l'image

source: This closes [Issue #1](https://github.com/DataLab-Platform/Sigima/issues/1) - `ValueError` when computing statistics on ROI extending beyond image boundaries
fr: Ceci clôture [Issue #1](https://github.com/DataLab-Platform/Sigima/issues/1) - `ValueError` lors du calcul des statistiques sur ROI s'étendant au-delà des limites de l'image

source: ✨ New features and enhancements:
fr: ✨ Nouvelles fonctionnalités et améliorations:

source: **New parametric image types**: Added five new parametric image generation types for testing and calibration
fr: **Nouveaux types d'images paramétriques** : Ajout de cinq nouveaux types de génération d'images paramétriques pour les tests et l'étalonnage

source: **Checkerboard pattern**: Alternating squares for camera calibration and spatial frequency analysis. Parameters include square size, offset, and min/max values
fr: **Motif en damier** : Carrés alternés pour l'étalonnage de la caméra et l'analyse de la fréquence spatiale. Les paramètres incluent la taille des carrés, le décalage et les valeurs min/max

source: **Sinusoidal grating**: Frequency response testing with configurable spatial frequencies (fx, fy), phase, amplitude, and DC offset
fr: **Réseau sinusoïdal** : Test de la réponse en fréquence avec des fréquences spatiales configurables (fx, fy), phase, amplitude et offset DC

source: **Ring pattern**: Concentric circular rings for radial analysis. Configurable period, width, center position, and amplitude range
fr: **Motif en anneau** : Anneaux circulaires concentriques pour l'analyse radiale. Période, largeur, position centrale et plage d'amplitude configurables

source: **Siemens star**: Resolution testing pattern with radial spokes. Parameters include number of spokes, inner/outer radius, center position, and value range
fr: **Étoile de Siemens** : Motif de test de résolution avec des rayons radiaux. Les paramètres incluent le nombre de rayons, le rayon intérieur/extérieur, la position centrale et la plage de valeurs

source: **2D sinc function**: PSF/diffraction modeling with cardinal sine function. Configurable amplitude, center, scale factor (sigma), and DC offset
fr: **Fonction sinc 2D** : Modélisation PSF/diffraction avec la fonction sinus cardinal. Amplitude, centre, facteur d'échelle (sigma) et offset DC configurables

source: **GeometryResult.value property**: New convenience property for easy script access to computed geometry values
fr: **Propriété GeometryResult.value** : Nouvelle propriété de commodité pour un accès facile aux valeurs géométriques calculées dans les scripts

source: Supports POINT, MARKER, and SEGMENT shapes
fr: Prend en charge les formes POINT, MARKER et SEGMENT

source: Returns `(x, y)` tuple for POINT and MARKER shapes (both coordinates accessible)
fr: Renvoie un tuple `(x, y)` pour les formes POINT et MARKER (les deux coordonnées accessibles)

source: Returns `float` length for SEGMENT shapes (calculated via `segments_lengths()`)
fr: Renvoie une longueur `float` pour les formes SEGMENT (calculée via `segments_lengths()`)

source: Return type annotation: `float | tuple[float, float]`
fr: Annotation de type de retour : `float | tuple[float, float]`

source: Provides intuitive API: unpack coordinates with `x, y = result.value` or get length with `length = result.value`
fr: Fournit une API intuitive : déballer les coordonnées avec `x, y = result.value` ou obtenir la longueur avec `length = result.value`

source: Comprehensive error handling for unsupported shapes and multi-row results
fr: Gestion complète des erreurs pour les formes non prises en charge et les résultats à plusieurs lignes

source: **Signal analysis functions return GeometryResult**: Changed `x_at_y()` and `y_at_x()` to return geometry results for better visualization
fr: **Les fonctions d'analyse de signal renvoient GeometryResult** : Modification de `x_at_y()` et `y_at_x()` pour renvoyer des résultats géométriques pour une meilleure visualisation

source: `x_at_y()` now returns `GeometryResult` with `MARKER` kind (previously returned `TableResult`)
fr: `x_at_y()` renvoie désormais `GeometryResult` avec le type `MARKER` (au lieu de `TableResult`)

source: `y_at_x()` now returns `GeometryResult` with `MARKER` kind (previously returned `TableResult`)
fr: `y_at_x()` renvoie désormais `GeometryResult` avec le type `MARKER` (au lieu de `TableResult`)

source: Both functions return coordinates as `[x, y]` in N×2 array format for cross marker display
fr: Les deux fonctions renvoient les coordonnées sous la forme d'un tableau N×2 pour l'affichage des marqueurs croisés

source: Enables proper marker visualization in DataLab GUI (displayed as cross markers on plots)
fr: Permet une visualisation correcte des marqueurs dans l'interface graphique de DataLab (affichés comme des marqueurs croisés sur les graphiques)

source: Script-friendly API: use `.value` property to easily extract coordinates as `(x, y)` tuple
fr: API conviviale pour les scripts : utilisez la propriété `.value` pour extraire facilement les coordonnées sous forme de tuple `(x, y)`

source: Example: `x, y = proxy.compute_x_at_y(params).value` provides direct access to both coordinates
fr: Exemple : `x, y = proxy.compute_x_at_y(params).value` fournit un accès direct aux deux coordonnées

source: Breaking change: Scripts accessing results as tables need to update to use `.value` property or `.coords` array
fr: Changement majeur : Les scripts accédant aux résultats sous forme de tableaux doivent être mis à jour pour utiliser la propriété `.value` ou le tableau `.coords`

source: Detection functions:
fr: Fonctions de détection :

source: **Contour detection**: Removed ROI creation support from `ContourShapeParam` as it doesn't make sense for contour detection use cases. The `ContourShapeParam` class no longer inherits from `DetectionROIParam`, and the `contour_shape()` function no longer calls `store_roi_creation_metadata()`. ROI creation remains available for other detection methods (blob detection, 2D peak detection) where it is appropriate.
fr: **Détection de contours** : Suppression du support de création de ROI dans `ContourShapeParam`, car cela n'a pas de sens pour les cas d'utilisation de détection de contours. La classe `ContourShapeParam` n'hérite plus de `DetectionROIParam`, et la fonction `contour_shape()` n'appelle plus `store_roi_creation_metadata()`. La création de ROI reste disponible pour d'autres méthodes de détection (détection de blobs, détection de pics 2D) où cela est approprié.

source: **ROI creation error handling**: Enhanced error handling in `create_image_roi_around_points()` function to provide clearer error messages:
fr: **Gestion des erreurs de création de ROI** : Amélioration de la gestion des erreurs dans la fonction `create_image_roi_around_points()` pour fournir des messages d'erreur plus clairs :

source: Now raises `ValueError` when calculated ROI size is too small (points too close together)
fr: Lève désormais une exception `ValueError` lorsque la taille de ROI calculée est trop petite (points trop proches les uns des autres)

source: Improved error messages to help users understand the cause of failures
fr: Messages d'erreur améliorés pour aider les utilisateurs à comprendre la cause des échecs

source: Validates ROI geometry parameter more explicitly
fr: Valide le paramètre de géométrie de ROI de manière plus explicite

source: Better handling of edge cases in automatic ROI sizing
fr: Meilleure gestion des cas limites dans le dimensionnement automatique des ROI

source: Public API:
fr: API publique :

source: Made `BaseObj.roi_has_changed` method private (by renaming to `BaseObj.__roi_has_changed`) to avoid accidental external usage. This would interfere with the internal mask refresh mechanism that relies on controlled access to this method. The method is not part of the public API and should not be called directly by applications.
fr: La méthode `BaseObj.roi_has_changed` a été rendue privée (en la renommant en `BaseObj.__roi_has_changed`) pour éviter une utilisation externe accidentelle. Cela interférerait avec le mécanisme interne de rafraîchissement des masques qui repose sur un accès contrôlé à cette méthode. La méthode ne fait pas partie de l'API publique et ne doit pas être appelée directement par les applications.

source: **Detection ROI creation**: Generic mechanism for ROI creation across all detection functions
fr: **Création de ROI de détection** : Mécanisme générique de création de ROI pour toutes les fonctions de détection

source: New `DetectionROIParam` parameter class providing standardized ROI creation fields
fr: Nouvelle classe de paramètres `DetectionROIParam` fournissant des champs de création de ROI standardisés

source: `create_rois`: Boolean flag to enable/disable ROI creation (default: False)
fr: `create_rois`: Indicateur booléen pour activer/désactiver la création de ROI (par défaut : Faux)

source: `roi_geometry`: Enum selecting ROI shape (RECTANGLE or CIRCLE, default: RECTANGLE)
fr: `roi_geometry`: Enum sélectionnant la forme de la ROI (RECTANGLE ou CIRCLE, par défaut : RECTANGLE)

source: New `DetectionROIGeometry` enum in `sigima.enums` with RECTANGLE and CIRCLE options
fr: Nouvel énuméré `DetectionROIGeometry` dans `sigima.enums` avec les options RECTANGLE et CIRCLE

source: All detection parameter classes now inherit from `DetectionROIParam`:
fr: Toutes les classes de paramètres de détection héritent désormais de `DetectionROIParam` :

source: `Peak2DDetectionParam`: 2D peak detection
fr: `Peak2DDetectionParam`: Détection de pics 2D

source: `ContourShapeParam`: Contour shape fitting
fr: `ContourShapeParam`: Ajustement de la forme du contour

source: `BlobDOGParam`, `BlobDOHParam`, `BlobLOGParam`, `BlobOpenCVParam`: Blob detection methods
fr: `BlobDOGParam`, `BlobDOHParam`, `BlobLOGParam`, `BlobOpenCVParam`: Méthodes de détection de blobs

source: `HoughCircleParam`: Hough circle detection
fr: `HoughCircleParam`: Détection de cercles de Hough

source: New `store_roi_creation_metadata()` helper function:
fr: Nouvelle fonction d'assistance `store_roi_creation_metadata()` :

source: Stores ROI creation intent in `GeometryResult.attrs` dictionary
fr: Stocke l'intention de création de ROI dans le dictionnaire `GeometryResult.attrs`

source: Called within computation functions to communicate ROI preferences
fr: Appelée dans les fonctions de calcul pour communiquer les préférences de ROI

source: Does not violate function purity (no object modification)
fr: Ne contrevient pas à la pureté de la fonction (pas de modification d'objet)

source: New `apply_detection_rois()` helper function:
fr: Nouvelle fonction d'assistance `apply_detection_rois()` :

source: Creates ROIs on image objects based on `GeometryResult.attrs` metadata
fr: Crée des ROIs sur des objets d'image en fonction des métadonnées `GeometryResult.attrs`

source: Returns `True` if ROIs were created, `False` otherwise
fr: Renvoie `True` si des ROI ont été créées, `False` sinon

source: Handles both rectangle and circle geometries
fr: Gère les géométries rectangulaires et circulaires

source: Automatically calculates optimal ROI size based on feature spacing
fr: Calcule automatiquement la taille optimale de la ROI en fonction de l'espacement des caractéristiques

source: Can be called by applications outside computation functions
fr: Peut être appelé par des applications en dehors des fonctions de calcul

source: Metadata-based architecture maintains separation of concerns:
fr: L'architecture basée sur les métadonnées maintient la séparation des concepts :

source: Computation functions remain pure (no side effects)
fr: Les fonctions de calcul restent pures (pas d'effets de bord)

source: Applications control when/how ROIs are created
fr: Les applications contrôlent quand/comment les ROI sont créées

source: Works seamlessly with multiprocessing engines (e.g., DataLab processors)
fr: Fonctionne sans problème avec les moteurs de traitement parallèle (par exemple, les processeurs DataLab)

source: Comprehensive test coverage with `validate_detection_rois()` helper in test suite
fr: Couverture de test complète avec l'assistant `validate_detection_rois()` dans la suite de tests

source: **Automatic `func_name` injection for result objects**
fr: **Injection automatique de `func_name` pour les objets de résultat**

source: The `@computation_function` decorator now automatically injects the function name into `TableResult` and `GeometryResult` objects
fr: Le décorateur `@computation_function` injecte désormais automatiquement le nom de la fonction dans les objets `TableResult` et `GeometryResult`

source: When a computation function returns a result object with `func_name=None`, the decorator sets it to the function's name using `dataclasses.replace()`
fr: Lorsqu'une fonction de calcul renvoie un objet de résultat avec `func_name=None`, le décorateur le définit au nom de la fonction en utilisant `dataclasses.replace()`

source: Ensures systematic assignment of `func_name` for proper result tracking and display
fr: Garantit l'attribution systématique de `func_name` pour un suivi et un affichage appropriés des résultats

source: Implementation uses direct `isinstance()` type checking for `TableResult` and `GeometryResult`
fr: L'implémentation utilise la vérification directe de type `isinstance()` pour `TableResult` et `GeometryResult`

source: Applies to both main decorator wrapper (with DataSet parameters) and simple passthrough wrapper
fr: S'applique à la fois au wrapper principal du décorateur (avec les paramètres DataSet) et au wrapper de passage simple

source: Eliminates need for manual `func_name` assignment in computation functions
fr: Élimine le besoin d'attribution manuelle de `func_name` dans les fonctions de calcul

source: **Image ROI creation utility**: New `create_image_roi_around_points()` function in `sigima.objects.image.roi`
fr: **Utilitaire de création de ROI d'image** : Nouvelle fonction `create_image_roi_around_points()` dans `sigima.objects.image.roi`

source: Creates rectangular or circular ROIs around a set of point coordinates
fr: Crée des ROI rectangulaires ou circulaires autour d'un ensemble de coordonnées de points

source: Automatically calculates optimal ROI size based on minimum distance between points
fr: Calcule automatiquement la taille optimale de la ROI en fonction de la distance minimale entre les points

source: Handles boundary conditions to keep ROIs within valid image coordinates
fr: Gère les conditions de bord pour maintenir les ROI dans des coordonnées d'image valides

source: Supports both "rectangle" and "circle" geometry types
fr: Prend en charge les types de géométrie "rectangle" et "cercle"

source: Designed for creating ROIs around detected features (peaks, blobs, etc.)
fr: Conçu pour créer des ROI autour des caractéristiques détectées (pics, blobs, etc.)

source: Centralizes ROI creation logic previously duplicated across applications
fr: Centralise la logique de création de ROI précédemment dupliquée dans les applications

source: **Annotations API**: New public API for managing annotations on Signal and Image objects
fr: **API d'annotations** : Nouvelle API publique pour la gestion des annotations sur les objets Signal et Image

source: Added `get_annotations()` method: Returns a list of annotations in versioned JSON format
fr: Ajout de la méthode `get_annotations()` : Renvoie une liste d'annotations au format JSON versionné

source: Added `set_annotations(annotations)` method: Sets annotations from a list (replaces existing annotations)
fr: Ajout de la méthode `set_annotations(annotations)` : Définit les annotations à partir d'une liste (remplace les annotations existantes)

source: Added `add_annotation(annotation)` method: Adds a single annotation to the object
fr: Ajout de la méthode `add_annotation(annotation)` : Ajoute une seule annotation à l'objet

source: Added `clear_annotations()` method: Removes all annotations from the object
fr: Ajout de la méthode `clear_annotations()` : Supprime toutes les annotations de l'objet

source: Added `has_annotations()` method: Returns True if the object has any annotations
fr: Ajout de la méthode `has_annotations()` : Renvoie True si l'objet a des annotations

source: Annotations are stored in object metadata with versioning support (currently version "1.0")
fr: Les annotations sont stockées dans les métadonnées de l'objet avec un support de versionnage (actuellement version "1.0")

source: Each annotation is a dictionary with keys such as `type`, `item_class`, and `item_json` (for example)
fr: Chaque annotation est un dictionnaire avec des clés telles que `type`, `item_class` et `item_json` (par exemple)

source: Provides clean separation between generic annotation storage and visualization-specific details
fr: Fournit une séparation claire entre le stockage générique des annotations et les détails spécifiques à la visualisation

source: Enables applications to manage plot annotations (shapes, labels, etc.) independently of ROIs
fr: Permet aux applications de gérer les annotations de tracé (formes, étiquettes, etc.) indépendamment des ROI

source: Fully compatible with DataLab's PlotPy adapter pattern for visualization
fr: Entièrement compatible avec le modèle d'adaptateur PlotPy de DataLab pour la visualisation

source: **2D peak detection**: Fixed architectural violation in `peak_detection()` computation function
fr: **Détection de pics 2D** : Correction d'une violation architecturale dans la fonction de calcul `peak_detection()`

source: Removed direct ROI creation from computation function (was modifying input objects)
fr: Suppression de la création directe de ROI dans la fonction de calcul (modifiait les objets d'entrée)

source: Computation functions decorated with `@computation_function()` must be pure (no side effects)
fr: Les fonctions de calcul décorées avec `@computation_function()` doivent être pures (pas d'effets de bord)
