Repository: pypi-data/pypi-mirror-404
Catalog: packages/sigima/sigima-1.0.6.tar.gz/sigima-1.0.6/doc/locale/*/LC_MESSAGES/release_notes/release_1.00.po
Languages: fr

source: 🛠️ Bug fixes:
fr: 🛠️ Correctifs :

source: **Compatibility with scikit-image 0.26.0+**: Fixed deprecation warnings and API compatibility issues
fr: **Compatibilité avec scikit-image 0.26.0+** : Correction des avertissements de dépréciation et des problèmes de compatibilité API

source: scikit-image 0.26.0 introduced breaking changes to `CircleModel` and `EllipseModel` APIs: old API used `model.estimate(contour)` + `model.params`, new API uses `model.from_estimate(contour)` + property-based access (`model.center`, `model.radius`, `model.axis_lengths`)
fr: scikit-image 0.26.0 a introduit des changements majeurs dans les API de `CircleModel` et `EllipseModel` : l'ancienne API utilisait `model.estimate(contour)` + `model.params`, la nouvelle API utilise `model.from_estimate(contour)` + un accès basé sur les propriétés (`model.center`, `model.radius`, `model.axis_lengths`)

source: Added version-aware compatibility layer in `sigima.tools.image.preprocessing` with new helper functions `fit_circle_model()` and `fit_ellipse_model()` that handle both old and new APIs
fr: Ajout d'une couche de compatibilité sensible à la version dans `sigima.tools.image.preprocessing` avec de nouvelles fonctions d'aide `fit_circle_model()` et `fit_ellipse_model()` qui gèrent les anciennes et nouvelles API

source: Updated `get_contour_shapes()` in `sigima.tools.image.detection` to use compatibility functions
fr: Mise à jour de `get_contour_shapes()` dans `sigima.tools.image.detection` pour utiliser les fonctions de compatibilité

source: Updated `get_enclosing_circle()` in `sigima.tools.image.geometry` to use compatibility functions
fr: Mise à jour de `get_enclosing_circle()` dans `sigima.tools.image.geometry` pour utiliser les fonctions de compatibilité

source: Used `packaging.version.Version` for robust version checking instead of fragile string parsing
fr: Utilisation de `packaging.version.Version` pour une vérification robuste des versions au lieu d'une analyse de chaîne fragile

source: Eliminates deprecation warnings while maintaining backward compatibility with Python 3.9 and scikit-image < 0.26
fr: Élimine les avertissements de dépréciation tout en maintenant la compatibilité ascendante avec Python 3.9 et scikit-image < 0.26

source: This closes [Issue #10](https://github.com/DataLab-Platform/Sigima/issues/10) - Sigima is not compatible with NumPy 2.4.0 and scikit-image 0.26.0
fr: Ceci clôture [Issue #10](https://github.com/DataLab-Platform/Sigima/issues/10) - Sigima n'est pas compatible avec NumPy 2.4.0 et scikit-image 0.26.0

source: **Compatibility with NumPy 2.4.0**: Fixed centroid computation failure with NumPy 2.4.0's new einsum optimization
fr: **Compatibilité avec NumPy 2.4.0** : Correction de l'échec du calcul du centroïde avec la nouvelle optimisation einsum de NumPy 2.4.0

source: NumPy 2.4.0 introduced new einsum optimization used by `scikit-image.measure.centroid()` that fails with certain ndarray types
fr: NumPy 2.4.0 a introduit une nouvelle optimisation einsum utilisée par `scikit-image.measure.centroid()` qui échoue avec certains types de ndarray

source: Fixed by explicitly converting image data to basic NumPy array before calling `measure.centroid()` in `get_centroid_auto()` function
fr: Correction en convertissant explicitement les données d'image en tableau NumPy de base avant d'appeler `measure.centroid()` dans la fonction `get_centroid_auto()`

source: Ensures compatibility with NumPy 2.4.0+ and scikit-image 0.26.0+ without changing computational results
fr: Assure la compatibilité avec NumPy 2.4.0+ et scikit-image 0.26.0+ sans modifier les résultats de calcul

source: 📦 Dependencies:
fr: 📦 Dépendances :

source: **Dependency version constraints**: Added maximum version constraints to prevent future compatibility issues
fr: **Contraintes de version des dépendances** : Ajout de contraintes de version maximale pour éviter les futurs problèmes de compatibilité

source: Updated dependency specifications: `NumPy >= 1.22, < 2.5`, `SciPy >= 1.10.1, < 1.17`, `scikit-image >= 0.19.2, < 0.27`, `pandas >= 1.4, < 3.0`, `PyWavelets >= 1.2, < 2.0`
fr: Mise à jour des spécifications des dépendances : `NumPy >= 1.22, < 2.5`, `SciPy >= 1.10.1, < 1.17`, `scikit-image >= 0.19.2, < 0.27`, `pandas >= 1.4, < 3.0`, `PyWavelets >= 1.2, < 2.0`

source: New CI job `build_latest` runs scheduled tests against latest dependency versions to detect breaking changes early
fr: Le nouveau job CI `build_latest` exécute des tests programmés contre les dernières versions des dépendances pour détecter rapidement les changements majeurs

source: Prevents automatic breakage from major dependency updates while allowing controlled upgrades after validation
fr: Permets d'éviter les régressions dues aux mises à jour majeures des dépendances tout en permettant des mises à niveau contrôlées après validation

source: 🚀 CI/CD improvements:
fr: 🚀 Améliorations CI/CD :

source: **CI workflow enhancements**: Added automated testing against latest dependency versions
fr: **Améliorations du workflow CI** : Ajout de tests automatisés contre les dernières versions des dépendances

source: New `build_latest` job in GitHub Actions runs on schedule (weekly) and manual dispatch
fr: Nouveau job `build_latest` dans GitHub Actions s'exécute selon un calendrier (hebdomadaire) et sur demande manuelle

source: Extracts dependency names from `pyproject.toml` and installs latest available versions
fr: Extrait les noms des dépendances de `pyproject.toml` et installe les dernières versions disponibles

source: Provides early warning system for upcoming dependency compatibility issues
fr: Fournit un système d'alerte précoce pour les futurs problèmes de compatibilité des dépendances

source: Enhanced workflow dispatch with configurable job selection for flexible testing scenarios
fr: Amélioration du workflow de déclenchement avec une sélection de jobs configurable pour des scénarios de test flexibles

source: ℹ️ This is a hotfix release addressing a packaging issue where French translations were missing from the previous release package. This release contains no functional changes compared to version 1.0.4 - it only ensures that the compiled translation files (.mo) are properly included in the distribution package.
fr: ℹ️ Ceci est une version corrective qui résout un problème d'emballage où les traductions françaises manquaient dans le package de la version précédente. Cette version ne contient aucun changement fonctionnel par rapport à la version 1.0.4 - elle garantit uniquement que les fichiers de traduction compilés (.mo) sont correctement inclus dans le package de distribution.

source: **Packaging**: Fixed missing French translation files in release package
fr: **Packaging** : Correction des fichiers de traduction française manquants dans le package de la version précédente

source: Previous release packages were missing compiled .mo translation files, causing the application to display only English text regardless of locale settings
fr: Les packages de la version précédente ne contenaient pas les fichiers de traduction compilés .mo, ce qui faisait que l'application affichait uniquement du texte en anglais quel que soit les paramètres régionaux

source: Updated build process to ensure all translation files are properly included in distribution packages
fr: Mise à jour du processus de construction pour garantir que tous les fichiers de traduction sont correctement inclus dans les packages de distribution

source: No functional code changes - this is purely a packaging fix to restore internationalization support
fr: Aucun changement de code fonctionnel - il s'agit purement d'une correction d'emballage pour restaurer la prise en charge de l'internationalisation

source: **Image processing: LUT range incorrectly copied to result**: Fixed processed images showing incorrect contrast because LUT range was copied from original
fr: **Traitement d'image : plage LUT copiée incorrectement dans le résultat** : Correction des images traitées affichant un contraste incorrect car la plage LUT a été copiée de l'original

source: When processing an image (e.g., subtracting offset), the result image inherited the original's LUT range (`zscalemin`/`zscalemax`), causing incorrect visualization when data values changed significantly
fr: Lors du traitement d'une image (par exemple, en soustrayant un offset), l'image résultante héritait de la plage LUT de l'original (`zscalemin`/`zscalemax`), ce qui entraînait une visualisation incorrecte lorsque les valeurs de données changeaient de manière significative

source: Example: After subtracting ~50 lsb background from an image with LUT 50-200, the result (data range ~-5 to ~175) was still displayed with the original 50-200 LUT, making parts of the image appear clipped or invisible
fr: Exemple : Après avoir soustrait un fond d'environ 50 lsb d'une image avec une LUT de 50-200, le résultat (plage de données d'environ -5 à environ 175) était toujours affiché avec la LUT originale de 50-200, rendant certaines parties de l'image coupées ou invisibles

source: Fixed by adding image-specific `dst_1_to_1`, `dst_2_to_1`, and `dst_n_to_1` wrapper functions in `sigima.proc.image.base` that reset the LUT range after copying the source image
fr: Corrigé en ajoutant des fonctions wrapper spécifiques à l'image `dst_1_to_1`, `dst_2_to_1` et `dst_n_to_1` dans `sigima.proc.image.base` qui réinitialisent la plage LUT après la copie de l'image source

source: The `ImageObj.copy()` method remains unchanged (a copy should faithfully copy all attributes) - the fix is applied at the processing layer where it belongs
fr: La méthode `ImageObj.copy()` reste inchangée (une copie doit copier fidèlement tous les attributs) - la correction est appliquée à la couche de traitement où elle appartient

source: Added regression test `test_image_offset_correction_lut_range` in `offset_correction_unit_test.py`
fr: Ajout d'un test de régression `test_image_offset_correction_lut_range` dans `offset_correction_unit_test.py`

source: This closes [Issue #9](https://github.com/DataLab-Platform/Sigima/issues/9) - LUT range incorrectly copied when processing images
fr: Ceci clôture [Issue #9](https://github.com/DataLab-Platform/Sigima/issues/9) - Plage LUT copiée incorrectement lors du traitement des images

source: **Backwards-defined rectangular ROI causes NaN statistics**: Fixed rectangular ROI coordinate normalization when defined in reverse direction
fr: **Une ROI rectangulaire définie à l'envers entraîne des statistiques NaN** : Correction de la normalisation des coordonnées de ROI rectangulaire lorsqu'elle est définie en sens inverse

source: When a rectangular ROI was drawn graphically "backwards" in DataLab (from bottom-right to top-left instead of top-left to bottom-right), statistics analysis returned NaN values
fr: Lorsqu'une ROI rectangulaire était dessinée graphiquement « à l'envers » dans DataLab (du coin inférieur droit vers le coin supérieur gauche au lieu du coin supérieur gauche vers le coin inférieur droit), l'analyse statistique retournait des valeurs NaN

source: The `RectangularROI.rect_to_coords()` method was producing negative Δx and Δy values when `x1 < x0` or `y1 < y0`
fr: La méthode `RectangularROI.rect_to_coords()` produisait des valeurs Δx et Δy négatives lorsque `x1 < x0` ou `y1 < y0`

source: Fixed by normalizing coordinates using min/max to ensure Δx and Δy are always positive
fr: Corrigé en normalisant les coordonnées avec min/max pour garantir que Δx et Δy sont toujours positifs

source: ROI mask generation now works correctly regardless of the direction in which the rectangle was drawn
fr: La génération du masque de ROI fonctionne désormais correctement quelle que soit la direction dans laquelle le rectangle a été dessiné

source: Added regression test `test_backwards_drawn_rectangle` in `roi_coords_unit_test.py`
fr: Ajout d'un test de régression `test_backwards_drawn_rectangle` dans `roi_coords_unit_test.py`

source: **Grid ROI - Missing spacing parameters for non-uniform grids**: Fixed grid ROI extraction to support non-uniform feature spacing
fr: **ROI de grille - Paramètres d'espacement manquants pour les grilles non uniformes :** Correction de l'extraction ROI de grille pour prendre en charge un espacement des caractéristiques non uniforme

source: Grid ROI extraction previously assumed evenly distributed features (spacing = width/nx), which failed for images where features don't fill the entire grid area
fr: L'extraction ROI de grille supposait auparavant des caractéristiques uniformément réparties (espacement = largeur/nx), ce qui échouait pour les images où les caractéristiques ne remplissent pas toute la zone de la grille

source: Example: `laser_spot_array_raw.png` has laser spots spaced ~300 pixels apart, but the grid was defined over 3100×3100 pixels, causing incorrect ROI placement
fr: Exemple : `laser_spot_array_raw.png` a des points laser espacés d'environ 300 pixels, mais la grille était définie sur 3100×3100 pixels, ce qui a causé un placement incorrect des ROI

source: Added `xstep` and `ystep` percentage parameters (1-200%, default 100%) to `ROIGridParam` to specify spacing between ROI centers
fr: Ajout des paramètres de pourcentage `xstep` et `ystep` (1-200 %, par défaut 100 %) à `ROIGridParam` pour spécifier l'espacement entre les centres des ROI

source: Updated `generate_image_grid_roi()` function to use separate step calculation: `dx_step = dx_cell * p.xstep / 100.0`
fr: Mise à jour de la fonction `generate_image_grid_roi()` pour utiliser un calcul d'étape séparé : `dx_step = dx_cell * p.xstep / 100.0`

source: Position calculation now uses: `x0 = src.x0 + (ic + 0.5) * dx_step + xtrans - 0.5 * dx` (preserving backward compatibility)
fr: Le calcul de la position utilise désormais : `x0 = src.x0 + (ic + 0.5) * dx_step + xtrans - 0.5 * dx` (préservant la compatibilité ascendante)

source: Default values (100%) maintain exact original behavior for existing workflows
fr: Les valeurs par défaut (100 %) maintiennent le comportement original exact pour les flux de travail existants

source: This allows precise ROI placement for gapped grids (e.g., laser spot arrays, sample arrays) by adjusting spacing independently of ROI size
fr: Cela permet un placement précis des ROI pour les grilles avec des espaces (par exemple, les tableaux de points laser, les tableaux d'échantillons) en ajustant l'espacement indépendamment de la taille des ROI

source: **Signal result title formatting**: Fixed duplicate suffix in result titles for image-to-signal functions
fr: **Formatage du titre du résultat du signal** : Correction du suffixe en double dans les titres des résultats pour les fonctions image-vers-signal

source: When computing radial profile or other operations using `new_signal_result`, the suffix (e.g., center coordinates) was appearing twice in the title
fr: Lors du calcul du profil radial ou d'autres opérations utilisant `new_signal_result`, le suffixe (par exemple, les coordonnées du centre) apparaissait deux fois dans le titre

source: Example: `radial_profile(i019)|center=(192.500, 192.500)|center=(192.500, 192.500)` instead of `radial_profile(i019)|center=(192.500, 192.500)`
fr: Exemple : `radial_profile(i019)|center=(192.500, 192.500)|center=(192.500, 192.500)` au lieu de `radial_profile(i019)|center=(192.500, 192.500)`

source: The `new_signal_result` function in `sigima/proc/base.py` was adding the suffix twice: once via the formatter and once explicitly
fr: La fonction `new_signal_result` dans `sigima/proc/base.py` ajoutait le suffixe deux fois : une fois via le formateur et une fois explicitement

source: Removed the redundant suffix addition - the formatter's `format_1_to_1_title` method already handles suffix formatting correctly
fr: Suppression de l'ajout redondant du suffixe - la méthode `format_1_to_1_title` du formateur gère déjà correctement le formatage du suffixe

source: Affects functions like `radial_profile`, `histogram`, and other image-to-signal conversions
fr: Affecte des fonctions telles que `radial_profile`, `histogram` et d'autres conversions image-vers-signal

source: This closes [Issue #8](https://github.com/DataLab-Platform/Sigima/issues/8) - Duplicate suffix in result title when using `new_signal_result`
fr: Ceci clôture [Issue #8](https://github.com/DataLab-Platform/Sigima/issues/8) - Suffixe dupliqué dans le titre du résultat lors de l'utilisation de `new_signal_result`

source: **HDF5 serialization with detection ROIs**: Fixed workspace save failure when images contain ROIs generated by blob detection
fr: **Sérialisation HDF5 avec ROI de détection** : Correction de l'échec de sauvegarde de l'espace de travail lorsque les images contiennent des ROI générées par la détection de blobs

source: Saving DataLab workspace to HDF5 format failed with `NotImplementedError: cannot serialize 'rectangle' of type <enum 'DetectionROIGeometry'>`
fr: La sauvegarde de l'espace de travail DataLab au format HDF5 échouait avec `NotImplementedError: cannot serialize 'rectangle' of type <enum 'DetectionROIGeometry'>`

source: The `store_roi_creation_metadata()` function was storing the `DetectionROIGeometry` enum directly in geometry attributes
fr: La fonction `store_roi_creation_metadata()` stockait l'énumération `DetectionROIGeometry` directement dans les attributs de géométrie

source: Fixed by storing the enum's string value instead of the enum object itself
fr: Corrigé en stockant la valeur chaîne de caractères de l'énumération au lieu de l'objet énumération lui-même

source: This allows proper HDF5 serialization while preserving the information needed for `apply_detection_rois()` to recreate ROIs
fr: Cela permet une sérialisation HDF5 correcte tout en préservant les informations nécessaires pour que `apply_detection_rois()` recrée les ROI

source: This closes [Issue #7](https://github.com/DataLab-Platform/Sigima/issues/7) - HDF5 Serialization Fails for Detection ROI Geometry Enum
fr: Ceci clôture [Issue #7](https://github.com/DataLab-Platform/Sigima/issues/7) - La sérialisation HDF5 échoue pour l'énumération de la géométrie ROI de détection

source: **CSV numeric data import**: Fixed numeric columns being incorrectly interpreted as datetime values ([Issue #6](https://github.com/DataLab-Platform/Sigima/issues/6))
fr: **Importation de données numériques CSV** : Correction des colonnes numériques interprétées incorrectement comme des valeurs datetime ([Issue #6](https://github.com/DataLab-Platform/Sigima/issues/6))

source: When importing CSV files with large numeric values (e.g., frequencies in Hz like `4.884e+06`), the data was incorrectly converted to datetime timestamps
fr: Lors de l'importation de fichiers CSV avec de grandes valeurs numériques (par exemple, des fréquences en Hz comme `4.884e+06`), les données étaient incorrectement converties en horodatages datetime

source: The `pd.to_datetime()` function was interpreting numeric values as nanoseconds since Unix epoch, corrupting the original data
fr: La fonction `pd.to_datetime()` interprétait les valeurs numériques comme des nanosecondes depuis l'époque Unix, corrompant les données originales

source: Added check to skip columns with numeric dtypes in datetime detection - real datetime columns are loaded as string (`object`) dtype
fr: Ajout d'une vérification pour ignorer les colonnes avec des types numériques dans la détection de datetime - les vraies colonnes datetime sont chargées comme type chaîne de caractères (`object`)

source: Numeric data (frequencies, voltages, etc.) is now correctly preserved during CSV import
fr: Les données numériques (fréquences, tensions, etc.) sont désormais correctement préservées lors de l'importation CSV

source: **Parameter usage documentation**: Improved documentation for parameters requiring signal/image context ([Issue #5](https://github.com/DataLab-Platform/Sigima/issues/5))
fr: **Documentation de l'utilisation des paramètres** : Amélioration de la documentation pour les paramètres nécessitant un contexte de signal/image ([Issue #5](https://github.com/DataLab-Platform/Sigima/issues/5))

source: Added comprehensive documentation explaining the `update_from_obj()` pattern for parameters like `ZeroPadding1DParam`
fr: Ajout d'une documentation complète expliquant le modèle `update_from_obj()` pour les paramètres tels que `ZeroPadding1DParam`

source: Clarified that `sigima.params` is the recommended import location for all parameter classes
fr: Clarification que `sigima.params` est l'emplacement d'importation recommandé pour toutes les classes de paramètres

source: Enhanced `ZeroPadding1DParam` class docstring with usage example and "Important" admonition
fr: Amélioration de la docstring de la classe `ZeroPadding1DParam` avec un exemple d'utilisation et une admonition "Important"

source: Added new section in `sigima.params` module listing all parameters requiring `update_from_obj()`
fr: Ajout d'une nouvelle section dans le module `sigima.params` répertoriant tous les paramètres nécessitant `update_from_obj()`

source: Created new example `doc/examples/features/zero_padding.py` demonstrating proper parameter initialization
fr: Création d'un nouvel exemple `doc/examples/features/zero_padding.py` démontrant l'initialisation correcte des paramètres

source: Created new example `doc/examples/features/roi_grid.py` showcasing the `generate_image_grid_roi()` function
fr: Création d'un nouvel exemple `doc/examples/features/roi_grid.py` démontrant la fonction `generate_image_grid_roi()`

source: **Signal data type validation**: Fixed integer arrays not being automatically converted to float64
fr: **Validation du type de données du signal** : Correction des tableaux entiers qui n'étaient pas automatiquement convertis en float64

source: Integer input arrays are now automatically converted to float64 instead of raising errors
fr: Les tableaux d'entrée entiers sont désormais automatiquement convertis en float64 au lieu de générer des erreurs

source: Validation applied consistently across all signal data setters: `set_xydata()`, `x`, `y`, `dx`, `dy`
fr: La validation est appliquée de manière cohérente à tous les accesseurs de données de signal : `set_xydata()`, `x`, `y`, `dx`, `dy`

source: Improves usability by accepting integer inputs (common in test data and calibration values) while maintaining computational precision
fr: Améliore l'utilisabilité en acceptant les entrées entières (courantes dans les données de test et les valeurs d'étalonnage) tout en maintenant la précision de calcul

source: Raises clear `ValueError` for truly invalid dtypes with helpful error message listing valid types
fr: Lève une exception `ValueError` claire pour les types de données vraiment invalides avec un message d'erreur utile répertoriant les types valides

source: **Signal axis calibration**: Added `replace_x_by_other_y()` function to replace signal X coordinates with Y values from another signal
fr: **Étalonnage de l'axe des signaux** : Ajout de la fonction `replace_x_by_other_y()` pour remplacer les coordonnées X d'un signal par les valeurs Y d'un autre signal

source: Addresses missing functionality for wavelength calibration and similar use cases where calibration data is stored in a separate signal's Y values
fr: Répond à un manque de fonctionnalité pour l'étalonnage en longueur d'onde et des cas d'utilisation similaires où les données d'étalonnage sont stockées dans les valeurs Y d'un signal séparé
