Repository: pypi-data/pypi-mirror-404
Catalog: packages/sigima/sigima-1.0.6.tar.gz/sigima-1.0.6/doc/locale/*/LC_MESSAGES/release_notes/release_1.00.po
Languages: fr

source: New I/O features:
fr: Nouvelles fonctionnalités d'E/S:

source: Added HDF5 format for signal and image objects (extensions `.h5sig` and `.h5ima`) that may be opened with any HDF5 viewer.
fr: Ajout du format HDF5 pour les objets de signal et d'image (extensions `.h5sig` et `.h5ima`) qui peuvent être ouverts avec n'importe quel visualiseur HDF5.

source: Added support for MCA (Multi-Channel Analyzer) spectrum file format:
fr: Ajout de la prise en charge du format de fichier de spectre MCA (Analyseur Multi-Canaux) :

source: Reading MCA files (`.mca` extension) commonly used in spectroscopy and radiation detection
fr: Lecture des fichiers MCA (extension `.mca`) couramment utilisés en spectroscopie et en détection de radiation

source: Automatically extracts spectrum data and calibration information
fr: Extraction automatique des données de spectre et des informations de calibration

source: Supports energy calibration with interpolation for accurate X-axis values
fr: Prise en charge de la calibration d'énergie avec interpolation pour des valeurs précises de l'axe X

source: Parses metadata from multiple sections (PMCA SPECTRUM, DPP STATUS, CALIBRATION)
fr: Analyse des métadonnées à partir de plusieurs sections (PMCA SPECTRUM, DPP STATUS, CALIBRATION)

source: Handles various encoding formats (UTF-8, Latin-1, CP1252) for maximum compatibility
fr: Prise en charge de divers formats d'encodage (UTF-8, Latin-1, CP1252) pour une compatibilité maximale

source: Added support for FT-Lab signal and image format.
fr: Ajout de la prise en charge du format de signal et d'image FT-Lab.

source: Added functions to read and write metadata and ROIs in JSON format:
fr: Ajout de fonctions pour lire et écrire des métadonnées et des ROIs au format JSON:

source: `sigima.io.read_metadata` and `sigima.io.write_metadata` for metadata.
fr: `sigima.io.read_metadata` et `sigima.io.write_metadata` pour les métadonnées.

source: `sigima.io.read_roi` and `sigima.io.write_roi` for ROIs.
fr: `sigima.io.read_roi` et `sigima.io.write_roi` pour les ROIs.

source: Added convenience I/O functions `write_signals` and `write_images` with `SaveToDirectoryParam` support:
fr: Ajout de fonctions d'E/S de commodité `write_signals` et `write_images` avec prise en charge de `SaveToDirectoryParam`:

source: These functions enable batch saving of multiple signal or image objects to a directory with configurable naming patterns.
fr: Ces fonctions permettent d'enregistrer par lots plusieurs objets de signal ou d'image dans un répertoire avec des modèles de nommage configurables.

source: `SaveToDirectoryParam` provides control over file basenames (with Python format string support), extensions, directory paths, and overwrite behavior.
fr: `SaveToDirectoryParam` fournit un contrôle sur les noms de fichiers de base (avec prise en charge des chaînes de format Python), des extensions, des chemins de répertoire et du comportement d'écrasement.

source: Automatic filename conflict resolution ensures unique filenames when duplicates would occur.
fr: La résolution automatique des conflits de noms de fichiers garantit des noms de fichiers uniques en cas de doublons.

source: Enhanced workflow efficiency for processing and saving multiple objects in batch operations.
fr: Efficacité améliorée du flux de travail pour le traitement et l'enregistrement de plusieurs objets dans des opérations par lots.

source: ✨ Core architecture update: scalar result types
fr: ✨ Mise à jour de l'architecture de base: types de résultats scalaires

source: Introduced two new immutable result types: `TableResult` and `GeometryResult`, replacing the legacy `ResultProperties` and `ResultShape` objects.
fr: Introduction de deux nouveaux types de résultats immuables: `TableResult` et `GeometryResult`, remplaçant les anciens objets `ResultProperties` et `ResultShape`.

source: These new result types are computation-oriented and free of application-specific logic (e.g., Qt, metadata), enabling better separation of concerns and future reuse.
fr: Ces nouveaux types de résultats sont orientés vers le calcul et dépourvus de logique spécifique à l'application (par exemple, Qt, métadonnées), permettant une meilleure séparation des préoccupations et une réutilisation future.

source: Added a `TableResultBuilder` utility to incrementally define tabular computations (e.g., statistics on signals or images) and generate a `TableResult` object.
fr: Ajout d'un utilitaire `TableResultBuilder` pour définir progressivement des calculs tabulaires (par exemple, des statistiques sur les signaux ou les images) et générer un objet `TableResult`.

source: All metadata-related behaviors of former result types have been migrated to the DataLab application layer.
fr: Tous les comportements liés aux métadonnées des anciens types de résultats ont été migrés vers la couche d'application DataLab.

source: Removed obsolete or tightly coupled features such as `from_metadata_entry()` and `transform_shapes()` from the Sigima core.
fr: Suppression de fonctionnalités obsolètes ou étroitement couplées telles que `from_metadata_entry()` et `transform_shapes()` du cœur de Sigima.

source: This refactoring greatly improves modularity, testability, and the clarity of the scalar computation API.
fr: Cette refonte améliore considérablement la modularité, la testabilité et la clarté de l'API de calcul scalaire.

source: Fix how data is managed in signal objects (`SignalObj`):
fr: Correction de la gestion des données dans les objets de signal (`SignalObj`):

source: Signal data is stored internally as a 2D array with shape `(2, n)`, where the first row is the x data and the second row is the y data: that is the `xydata` attribute.
fr: Les données du signal sont stockées en interne sous la forme d'un tableau 2D de forme `(2, n)`, où la première ligne est les données x et la deuxième ligne est les données y : c'est l'attribut `xydata`.

source: Because of this, when storing complex Y data, the data type is propagated to the x data, which is not always desired.
fr: En raison de cela, lors du stockage de données Y complexes, le type de données est propagé aux données x, ce qui n'est pas toujours souhaité.

source: As a workaround, the `x` property now returns the real part of the x data.
fr: En guise de solution de contournement, la propriété `x` renvoie désormais la partie réelle des données x.

source: Furthermore, the `get_data` method now returns a tuple of numpy arrays instead of a single array, allowing to access both x and y data separately, keeping the original data type.
fr: De plus, la méthode `get_data` renvoie désormais un tuple de tableaux numpy au lieu d'un seul tableau, permettant d'accéder séparément aux données x et y, tout en conservant le type de données d'origine.

source: Fix ROI conversion between physical and indices coordinates:
fr: Correction de la conversion des coordonnées physiques et des indices de ROI:

source: The conversion between physical coordinates and indices has been corrected (half pixel error was removed).
fr: La conversion entre les coordonnées physiques et les indices a été corrigée (l'erreur de demi-pixel a été supprimée).

source: The `indices_to_physical` and `physical_to_indices` methods now raise a `ValueError` if the input does not contain an even number of elements (x, y pairs).
fr: La méthode `indices_to_physical` et `physical_to_indices` lèvent désormais une `ValueError` si l'entrée ne contient pas un nombre pair d'éléments (paires x, y).

source: 🔒 Security fixes:
fr: 🔒 Corrections de sécurité:

source: **Dependency vulnerability fix**: Fixed CVE-2023-4863 vulnerability in opencv-python-headless
fr: **Correction de vulnérabilité de dépendance**: Correction de la vulnérabilité CVE-2023-4863 dans opencv-python-headless

source: Updated minimum requirement from 4.5.4.60 to 4.8.1.78
fr: Mise à jour de l'exigence minimale de 4.5.4.60 à 4.8.1.78

source: Addresses libwebp binaries vulnerability in bundled OpenCV wheels
fr: Correction de la vulnérabilité des binaires libwebp dans les paquets Wheel OpenCV

source: See [DataLab security advisory](https://github.com/DataLab-Platform/DataLab/security/dependabot/1) for details
fr: Voir l'[avis de sécurité DataLab](https://github.com/DataLab-Platform/DataLab/security/dependabot/1) pour plus de détails.
