Repository: pypi-data/pypi-mirror-404
Catalog: packages/sigima/sigima-1.0.6.tar.gz/sigima-1.0.6/doc/locale/*/LC_MESSAGES/release_notes/release_1.00.po
Languages: fr

source: Compute the horizontal projection profile by summing values along the y-axis (`sigima.proc.image.measurement.horizontal_projection`).
fr: Calcule le profil de projection horizontale en sommant les valeurs le long de l'axe y (`sigima.proc.image.measurement.horizontal_projection`).

source: Compute the vertical projection profile by summing values along the x-axis (`sigima.proc.image.measurement.vertical_projection`).
fr: Calcule le profil de projection verticale en sommant les valeurs le long de l'axe x (`sigima.proc.image.measurement.vertical_projection`).

source: **New curve fitting algorithms**: Complete curve fitting framework with `sigima.tools.signal.fitting` module:
fr: **Nouveaux algorithmes de courbe d'ajustement**: Cadre complet d'ajustement de courbe avec le module `sigima.tools.signal.fitting` :

source: **Core fitting functions**: Comprehensive set of curve fitting algorithms for scientific data analysis:
fr: **Fonctions d'ajustement de base**: Ensemble complet d'algorithmes d'ajustement de courbe pour l'analyse de données scientifiques :

source: `linear_fit`: Linear regression fitting
fr: `linear_fit`: Ajustement de régression linéaire

source: `polynomial_fit`: Polynomial fitting with configurable degree
fr: `polynomial_fit`: Ajustement polynomial avec degré configurable

source: `gaussian_fit`: Gaussian profile fitting for peak analysis
fr: `gaussian_fit`: Ajustement de profil gaussien pour l'analyse de pics

source: `lorentzian_fit`: Lorentzian profile fitting for spectroscopy
fr: `lorentzian_fit`: Ajustement de profil lorentzien pour la spectroscopie

source: `voigt_fit`: Voigt profile fitting (convolution of Gaussian and Lorentzian profiles)
fr: `voigt_fit`: Ajustement de profil Voigt (convolution des profils gaussien et lorentzien)

source: `exponential_fit`: Single exponential fitting with overflow protection
fr: `exponential_fit`: Ajustement exponentiel simple avec protection contre les débordements

source: `piecewiseexponential_fit`: Piecewise exponential (raise-decay) fitting with advanced parameter estimation
fr: `piecewiseexponential_fit`: Ajustement exponentiel par morceaux (croissante-décroissante) avec estimation avancée des paramètres

source: `planckian_fit`: Planckian (blackbody radiation) fitting with correct physics implementation
fr: `planckian_fit`: Ajustement planckien (radiation du corps noir) avec mise en œuvre physique correcte

source: `twohalfgaussian_fit`: Asymmetric peak fitting with separate left/right parameters
fr: `twohalfgaussian_fit`: Ajustement de pic asymétrique avec des paramètres gauche/droite séparés

source: `multilorentzian_fit`: Multi-peak Lorentzian fitting for complex spectra
fr: `multilorentzian_fit`: Ajustement Lorentzien multi-pic pour des spectres complexes

source: `sinusoidal_fit`: Sinusoidal fitting with FFT-based frequency estimation
fr: `sinusoidal_fit`: Ajustement sinusoïdal avec estimation de fréquence basée sur FFT

source: `cdf_fit`: Cumulative Distribution Function fitting using error function
fr: `cdf_fit`: Ajustement de la fonction de distribution cumulative utilisant la fonction d'erreur

source: `sigmoid_fit`: Sigmoid (logistic) function fitting for S-shaped curves
fr: `sigmoid_fit`: Ajustement de la fonction sigmoïde (logistique) pour les courbes en S

source: **Advanced piecewise exponential (raise-decay) fitting**: Enhanced algorithm with:
fr: **Ajustement exponentiel par morceaux (croissante-décroissante) avancé**: Algorithme amélioré avec :

source: Standard piecewise exponential model: `y = a_left*exp(b_left*x) + a_right*exp(b_right*x) + y0`
fr: Modèle standard exponentiel par morceaux : `y = a_left*exp(b_left*x) + a_right*exp(b_right*x) + y0`

source: Multi-start optimization strategy for robust convergence to global minimum
fr: Stratégie d'optimisation multi-démarrage pour une convergence robuste vers le minimum global

source: Support for both positive and negative exponential rates (growth and decay components)
fr: Prise en charge des taux exponentiels positifs et négatifs (composantes de croissance et de décroissance)

source: Comprehensive parameter bounds validation to prevent optimization errors
fr: Validation complète des limites des paramètres pour éviter les erreurs d'optimisation

source: **Enhanced asymmetric peak fitting**: Advanced `twohalfgaussian_fit` with:
fr: **Ajustement de pic asymétrique amélioré**: `twohalfgaussian_fit` avancé avec :

source: Separate baseline offsets for left and right sides (`y0_left`, `y0_right`)
fr: Offsets de base séparés pour les côtés gauche et droit (`y0_left`, `y0_right`)

source: Independent amplitude parameters (`amp_left`, `amp_right`) for better asymmetric modeling
fr: Paramètres d'amplitude indépendants (`amp_left`, `amp_right`) pour un meilleur modélisation asymétrique

source: Robust baseline estimation using percentile-based methods
fr: Estimation robuste de la ligne de base utilisant des méthodes basées sur les percentiles

source: **Technical features**: All fitting functions include:
fr: **Fonctionnalités techniques**: Toutes les fonctions d'ajustement incluent :

source: Automatic initial parameter estimation from data characteristics
fr: Estimation automatique des paramètres initiaux à partir des caractéristiques des données

source: Proper bounds enforcement ensuring optimization stability
fr: Application correcte des limites garantissant la stabilité de l'optimisation

source: Comprehensive error handling and parameter validation
fr: Gestion complète des erreurs et validation des paramètres

source: Consistent dataclass-based parameter structures
fr: Structures de paramètres basées sur des classes de données cohérentes

source: Full test coverage with synthetic and experimental data validation
fr: Couverture de test complète avec validation des données synthétiques et expérimentales

source: New common signal/image feature:
fr: Nouvelles fonctionnalités communes signal/image :

source: Added `phase` (argument) feature to extract the phase information from complex signals or images.
fr: Ajout de la fonctionnalité `phase` (argument) pour extraire les informations de phase des signaux ou des images complexes.

source: Added operation to create complex-valued signal/image from real and imaginary parts.
fr: Ajout de l'opération pour créer un signal/image à valeurs complexes à partir des parties réelle et imaginaire.

source: Added operation to create complex-valued signal/image from magnitude and phase.
fr: Ajout de l'opération pour créer un signal/image à valeurs complexes à partir de l'amplitude et de la phase.

source: Standard deviation of the selected signals or images (this complements the "Average" feature).
fr: Écart-type des signaux ou images de la sélection (ceci complète la fonctionnalité "Moyenne").

source: Generate new signal or image: Poisson noise.
fr: Générer un nouveau signal ou une nouvelle image : bruit de Poisson.

source: Add noise to the selected signals or images.
fr: Ajouter du bruit aux signaux ou images sélectionnés.

source: Gaussian, Poisson or uniform noise can be added.
fr: Du bruit gaussien, de Poisson ou uniforme peut être ajouté.

source: New utility functions to generate file basenames.
fr: Nouvelles fonctions utilitaires pour générer des noms de fichiers.

source: Deconvolution in the frequency domain.
fr: Déconvolution dans le domaine fréquentiel.

source: New ROI features:
fr: Nouvelles fonctionnalités de ROI:

source: Improved single ROI title handling, using default title based on the index of the ROI when no title is provided.
fr: Amélioration de la gestion du titre de la ROI unique, en utilisant un titre par défaut basé sur l'index de la ROI lorsque aucun titre n'est fourni.

source: Added `combine_with` method to ROI objects (`SignalROI` and `ImageROI`) to return a new ROI that combines the current ROI with another one (union) and handling duplicate ROIs.
fr: Ajout de la méthode `combine_with` aux objets ROI (`SignalROI` et `ImageROI`) pour renvoyer un nouvel ROI qui combine le ROI actuel avec un autre (union) et gère les ROIs en double.

source: Image ROI transformations:
fr: Transformations de ROI d'image:

source: Before this change, image ROI were removed after applying each single computation function.
fr: Avant ce changement, les ROI d'image étaient supprimées après l'application de chaque fonction de calcul unique.

source: Now, the geometry computation functions preserve the ROI information across transformations: the transformed ROIs are automatically updated in the image object.
fr: Maintenant, les fonctions de calcul géométrique préservent les informations de ROI à travers les transformations: les ROIs transformées sont automatiquement mises à jour dans l'objet image.

source: Image ROI coordinates:
fr: Coordonnées de ROI d'image:

source: Before this change, image ROI coordinates were defined using indices by default.
fr: Avant ce changement, les coordonnées de ROI d'image étaient définies par défaut à l'aide d'indices.

source: Now, `ROI2DParam` uses physical coordinates by default.
fr: Maintenant, `ROI2DParam` utilise des coordonnées physiques par défaut.

source: Note that ROI may still be defined using indices instead (using `create_image_roi` function).
fr: Les ROI peuvent toujours être définies à l'aide d'indices (en utilisant la fonction `create_image_roi`).

source: Image ROI grid:
fr: Grille de ROI d'image:

source: New `generate_image_grid_roi` function: create a grid of ROIs from an image, with customizable parameters for grid size, spacing, and naming.
fr: Nouvelle fonction `generate_image_grid_roi`: crée une grille de ROIs à partir d'une image, avec des paramètres personnalisables pour la taille de la grille, l'espacement et la nomination.

source: This function allows for easy extraction of multiple ROIs from an image in a structured manner.
fr: Cette fonction permet d'extraire facilement plusieurs ROIs d'une image de manière structurée.

source: Parameters are handled via the `ROIGridParam` class, which provides a convenient way to specify grid properties:
fr: Les paramètres sont gérés via la classe `ROIGridParam`, qui fournit un moyen pratique de spécifier les propriétés de la grille:

source: `nx` / `ny`: Number of grid cells in the X/Y direction.
fr: `nx` / `ny`: Nombre de cellules de grille dans la direction X/Y.

source: `xsize` / `ysize`: Size of each grid cell in pixels.
fr: `xsize` / `ysize`: Taille de chaque cellule de grille en pixels.

source: `xtranslation` / `ytranslation`: Translation of the grid in pixels.
fr: `xtranslation` / `ytranslation`: Translation de la grille en pixels.

source: `xdirection` / `ydirection`: Direction of the grid (increasing/decreasing).
fr: `xdirection` / `ydirection`: Direction de la grille (croissante/décroissante).

source: New image processing features:
fr: Nouvelles fonctionnalités de traitement d'image:

source: New "2D resampling" feature:
fr: Nouvelle fonctionnalité de "Rééchantillonnage 2D" :

source: This feature allows to resample 2D images to a new coordinate grid using interpolation.
fr: Cette fonctionnalité permet de rééchantillonner des images 2D vers une nouvelle grille de coordonnées à l'aide d'une interpolation.

source: It supports two resampling modes: pixel size and output shape.
fr: Elle prend en charge deux modes de rééchantillonnage : la taille des pixels et la forme de sortie.

source: Multiple interpolation methods are available: linear, cubic, and nearest neighbor.
fr: Plusieurs méthodes d'interpolation sont disponibles : linéaire, cubique et plus proche voisin.

source: The `fill_value` parameter controls how out-of-bounds pixels are handled, with support for numeric values or NaN.
fr: Le paramètre `fill_value` contrôle la manière dont les pixels hors limites sont gérés, avec prise en charge des valeurs numériques ou de NaN.

source: Automatic data type conversion ensures proper NaN handling for integer images.
fr: La conversion automatique du type de données garantit une gestion appropriée des NaN pour les images entières.

source: It is implemented in the `sigima.proc.image.resampling` function with parameters defined in `Resampling2DParam`.
fr: Elle est implémentée dans la fonction `sigima.proc.image.resampling` avec des paramètres définis dans `Resampling2DParam`.

source: New "Frequency domain Gaussian filter" feature:
fr: Nouvelle fonctionnalité de "Filtre fréquentiel gaussien" :

source: This feature allows to filter an image in the frequency domain using a Gaussian filter.
fr: Cette fonctionnalité permet de filtrer une image dans le domaine fréquentiel à l'aide d'un filtre gaussien.

source: It is implemented in the `sigima.proc.image.frequency_domain_gaussian_filter` function.
fr: Elle est implémentée dans la fonction `sigima.proc.image.frequency_domain_gaussian_filter`.

source: New "Erase" feature:
fr: Nouvelle fonctionnalité "Gommage":

source: This feature allows to erase an area of the image using the mean value of the image.
fr: Cette fonctionnalité permet de gommer une zone de l'image en utilisant la valeur moyenne de l'image.

source: It is implemented in the `sigima.proc.image.erase` function.
fr: Elle est implémentée dans la fonction `sigima.proc.image.erase`.

source: The erased area is defined by a region of interest (ROI) parameter set.
fr: La zone gommée est définie par un paramètre de région d'intérêt (ROI).

source: Example usage:
fr: Exemple d'utilisation:

source: By default, pixel binning changes the pixel size.
fr: Par défaut, le regroupement de pixels modifie la taille des pixels.

source: Improved centroid estimation:
fr: Amélioration de l'estimation du centroïde:

source: New `get_centroid_auto` method implements an adaptive strategy that chooses between the Fourier-based centroid and a more robust fallback (scikit-image), based on agreement with a projected profile-based reference.
fr: La nouvelle méthode `get_centroid_auto` implémente une stratégie adaptative qui choisit entre le centroïde basé sur Fourier et un repli plus robuste (scikit-image), en fonction de l'accord avec une référence basée sur le profil projeté.

source: Introduced `get_projected_profile_centroid` function for robust estimation via 1D projections (median or barycentric), offering high accuracy even with truncated or noisy images.
fr: Introduction de la fonction `get_projected_profile_centroid` pour une estimation robuste via des projections 1D (médiane ou barycentrique), offrant une grande précision même avec des images tronquées ou bruyantes.

source: These changes improve centroid accuracy and stability in edge cases (e.g. truncated disks or off-center spots), while preserving noise robustness.
fr: Ces changements améliorent la précision et la stabilité du centroïde dans les cas extrêmes (par exemple, disques tronqués ou taches décentrées), tout en préservant la robustesse au bruit.

source: See [DataLab issue #251](https://github.com/DataLab-Platform/DataLab/issues/251) for more details.
fr: Voir l'[issue DataLab #251](https://github.com/DataLab-Platform/DataLab/issues/251) pour plus de détails.

source: New signal processing features:
fr: Nouvelles fonctionnalités de traitement du signal:

source: New "Brick wall filter" feature:
fr: Nouvelle fonctionnalité de "Filtre fréquentiel idéal" :

source: This feature allows to filter a signal in the frequency domain using an ideal ("brick wall") filter.
fr: Cette fonctionnalité permet de filtrer un signal dans le domaine fréquentiel à l'aide d'un filtre idéal.

source: It is implemented in `sigima.proc.signal.frequency_filter`, along the other frequency domain filtering features (`Bessel`, `Butterworth`, etc.).
fr: Elle est implémentée dans la fonction `sigima.proc.signal.frequency_filter`, parmi les autres fonctionnalités de filtrage dans le domaine fréquentiel (`Bessel`, `Butterworth`, etc.).

source: Enhanced zero padding to support prepend and append. Change default strategy to next power of 2.
fr: Amélioration du remplissage de zéros pour prendre en charge l'ajout au début et à la fin. Changement de la stratégie par défaut vers la prochaine puissance de 2.

source: **Pulse analysis algorithms**: Comprehensive pulse feature extraction framework in `sigima.tools.signal.pulse` module:
fr: **Algorithmes d'analyse des impulsions**: Cadre complet d'extraction des caractéristiques des impulsions dans le module `sigima.tools.signal.pulse` :

source: **Core pulse analysis functions**: Complete set of algorithms for step and square pulse characterization:
fr: **Fonctions d'analyse des impulsions de base**: Ensemble complet d'algorithmes pour la caractérisation des impulsions en escalier et carrées :

source: `extract_pulse_features`: Main function for automated pulse feature extraction
fr: `extract_pulse_features`: Fonction principale pour l'extraction automatisée des caractéristiques des impulsions

source: `heuristically_recognize_shape`: Intelligent signal type detection (step, square, or other)
fr: `heuristically_recognize_shape`: Détection intelligente du type de signal (escalier, carré ou autre)

source: `detect_polarity`: Robust polarity detection using baseline analysis
fr: `detect_polarity`: Détection robuste de la polarité utilisant l'analyse de la ligne de base

source: **Advanced timing parameter extraction**: Precise measurement algorithms for:
fr: **Extraction avancée des paramètres temporels**: Algorithmes de mesure précis pour :

source: Rise and fall time calculations with configurable start/stop ratios (e.g., 10%-90%)
fr: Calculs du temps de montée et de descente avec des rapports de début/fin configurables (par exemple, 10%-90%)

source: Timing parameters at specific fractions (x10, x50, x90, x100) of signal amplitude
fr: Paramètres temporels à des fractions spécifiques (x10, x50, x90, x100) de l'amplitude du signal

source: Full width at half maximum (FWHM) computation for square pulses
fr: Calcul de la largeur à mi-hauteur (FWHM) pour les impulsions carrées

source: Foot duration measurement for pulse characterization
fr: Mesure de la durée de l'impulsion pour la caractérisation des impulsions

source: **Baseline analysis capabilities**: Statistical methods for:
fr: **Capacités d'analyse de la ligne de base**: Méthodes statistiques pour :

source: Automatic baseline range detection from signal extremes
fr: Détection automatique de la plage de ligne de base à partir des extrêmes du signal

source: Robust baseline level estimation using mean values within ranges
fr: Estimation robuste du niveau de la ligne de base en utilisant les valeurs moyennes dans les plages

source: Start and end baseline characterization for differential analysis
fr: Caractérisation de la ligne de base de début et de fin pour l'analyse différentielle

source: **Signal validation and error handling**: Comprehensive input validation with:
fr: **Validation des signaux et gestion des erreurs**: Validation des entrées complète avec :

source: Data array consistency checks and NaN/infinity detection
fr: Vérifications de la cohérence des tableaux de données et détection des NaN/infinis

source: Signal length validation and range boundary verification
fr: Validation de la longueur du signal et vérification des limites de plage

source: Graceful error handling with descriptive exception messages
fr: Gestion des erreurs élégante avec des messages d'exception descriptifs

source: **PulseFeatures dataclass**: Structured result container with all extracted parameters:
fr: **Dataclass PulseFeatures**: Conteneur de résultats structuré avec tous les paramètres extraits :

source: Amplitude, polarity, and offset measurements
fr: Mesures d'amplitude, de polarité et de décalage

source: Timing parameters (rise_time, fall_time, fwhm, x10, x50, x90, x100)
fr: Paramètres temporels (rise_time, fall_time, fwhm, x10, x50, x90, x100)

source: Baseline ranges (xstartmin, xstartmax, xendmin, xendmax)
fr: Plages de ligne de base (xstartmin, xstartmax, xendmin, xendmax)

source: Signal shape classification and foot duration
fr: Classification de la forme du signal et durée de l'impulsion

source: Implementation leverages robust statistical methods and provides both high-level convenience functions and low-level building blocks for custom pulse analysis workflows.
fr: L'implémentation s'appuie sur des méthodes statistiques robustes et fournit à la fois des fonctions de commodité de haut niveau et des blocs de construction de bas niveau pour des flux de travail d'analyse d'impulsions personnalisés.

source: Comprehensive uncertainty propagation implementation:
fr: Mise en œuvre complète de la propagation des incertitudes :

source: Added mathematically correct uncertainty propagation to ~15 core signal processing functions.
fr: Ajout de la propagation des incertitudes mathématiquement correcte à ~15 fonctions de traitement du signal de base.

source: Enhanced `Wrap1to1Func` class to handle uncertainty propagation for mathematical functions (`sqrt`, `log10`, `exp`, `clip`, `absolute`, `real`, `imag`).
fr: Amélioration de la classe `Wrap1to1Func` pour gérer la propagation des incertitudes pour les fonctions mathématiques (`sqrt`, `log10`, `exp`, `clip`, `absolute`, `real`, `imag`).

source: Implemented uncertainty propagation for arithmetic operations (`product_constant`, `division_constant`).
fr: Mise en œuvre de la propagation des incertitudes pour les opérations arithmétiques (`product_constant`, `division_constant`).

source: Added uncertainty propagation for advanced processing functions (`power`, `normalize`, `derivative`, `integral`, `calibration`).
fr: Ajout de la propagation des incertitudes pour les fonctions de traitement avancées (`power`, `normalize`, `derivative`, `integral`, `calibration`).

source: All implementations use proper error propagation formulas with numerical stability handling (NaN/infinity protection).
fr: Toutes les implémentations utilisent des formules de propagation des erreurs appropriées avec une gestion de la stabilité numérique (protection contre les NaN/l'infini).

source: Optimized for memory efficiency by leveraging `dst_1_to_1` automatic uncertainty copying and in-place modifications.
fr: Optimisé pour l'efficacité mémoire en tirant parti de la copie automatique des incertitudes `dst_1_to_1` et des modifications sur place.

source: Maintains backward compatibility with existing signal processing workflows.
fr: Maintient la compatibilité avec les flux de travail de traitement du signal existants.

source: New 2D ramp image generator:
fr: Nouveau générateur d'image de rampe 2D:

source: This feature allows to generate a 2D ramp image: z = a(x − x₀) + b(y − y₀) + c
fr: Cette fonctionnalité permet de générer une image de rampe 2D: z = a(x − x₀) + b(y − y₀) + c

source: It is implemented in the `sigima.objects.Ramp2DParam` parameter class.
fr: Elle est implémentée dans la classe de paramètres `sigima.objects.Ramp2DParam`.

source: New signal generators: linear chirp, logistic function, Planck function.
fr: Nouveaux générateurs de signaux: chirp linéaire, fonction logistique, fonction de Planck.

source: New image "Extent" computed parameters:
fr: Nouveaux paramètres calculés d'"Étendue" de l'image :

source: Added computed parameters for image extent: `xmin`, `xmax`, `ymin`, and `ymax`.
fr: Ajout de paramètres calculés pour l'étendue de l'image : `xmin`, `xmax`, `ymin` et `ymax`.

source: These parameters are automatically calculated based on the image origin, pixel spacing, and dimensions.
fr: Ces paramètres sont automatiquement calculés en fonction de l'origine de l'image, de l'espacement des pixels et des dimensions.

source: They provide the physical coordinate boundaries of the image for enhanced spatial analysis.
fr: Ils fournissent les limites des coordonnées physiques de l'image pour une analyse spatiale améliorée.
