Repository: pypi-data/pypi-mirror-404
Catalog: packages/sigima/sigima-1.0.6.tar.gz/sigima-1.0.6/doc/locale/*/LC_MESSAGES/release_notes/release_1.00.po
Languages: fr

source: Removed line 128: `obj.roi = create_image_roi(...)` which violated this principle
fr: Suppression de la ligne 128 : `obj.roi = create_image_roi(...)` qui contrevenait à ce principe

source: ROI creation now handled by applications in their presentation layer
fr: La création de ROI est désormais gérée par les applications dans leur couche de présentation

source: DataLab uses new `create_image_roi_around_points()` utility for this purpose
fr: DataLab utilise la nouvelle utilité `create_image_roi_around_points()` à cet effet

source: Maintains separation of concerns: Sigima computes results, applications create visual representations
fr: Maintient la séparation des concepts : Sigima calcule les résultats, les applications créent des représentations visuelles

source: Fixes regression where ROIs were not appearing in DataLab's processor-based workflow
fr: Corrige la régression où les ROI n'apparaissaient pas dans le flux de travail basé sur les processeurs de DataLab

source: **Parameter classes**: Removed default titles from generic `OrdinateParam` and `AbscissaParam` classes
fr: **Classes de paramètres** : Suppression des titres par défaut des classes génériques `OrdinateParam` et `AbscissaParam`

source: These parameter classes are reused across multiple computation functions (e.g., `full_width_at_y`, `x_at_y`)
fr: Ces classes de paramètres sont réutilisées dans plusieurs fonctions de calcul (par exemple, `full_width_at_y`, `x_at_y`)

source: Default titles like "Ordinate" created redundancy when displayed with function names in analysis results
fr: Des titres par défaut comme "Ordinate" créaient une redondance lorsqu'ils étaient affichés avec les noms de fonction dans les résultats d'analyse.

source: Titles are now empty by default, allowing applications to provide context-specific titles when needed
fr: Les titres sont désormais vides par défaut, permettant aux applications de fournir des titres spécifiques au contexte si nécessaire.

source: Improves clarity when the same parameter class is used by different functions
fr: Améliore la clarté lorsque la même classe de paramètres est utilisée par différentes fonctions.

source: **Result HTML representation**: Improved color contrast for dark mode
fr: Représentation HTML des résultats : amélioration du contraste des couleurs pour le mode sombre

source: Changed result title color in `to_html()` methods from standard blue (#0000FF) to a lighter shade (#5294e2)
fr: Changement de la couleur du titre des résultats dans les méthodes `to_html()` de bleu standard (#0000FF) à une teinte plus claire (#5294e2)

source: Affects TableResult and GeometryResult HTML output
fr: Affecte la sortie HTML de TableResult et GeometryResult

source: Provides better visibility in dark mode while maintaining good appearance in light mode
fr: Offre une meilleure visibilité en mode sombre tout en maintenant une bonne apparence en mode clair

source: Improves readability when results are displayed in applications with dark themes
fr: Améliore la lisibilité lorsque les résultats sont affichés dans des applications avec des thèmes sombres

source: Fixed pulse features extraction with ROI signals. When extracting pulse features from signals with ROIs, the start/end range parameters (which apply to the full signal) were being used on ROI-extracted data, causing incorrect results. Now `extract_pulse_features()` detects when the parameter ranges are outside the ROI's x-range and automatically switches to auto-detection mode. Additionally, `extract_pulse_features()` in `sigima.tools.signal.pulse` now properly initializes `None` ranges using `get_start_range()` and `get_end_range()` with the `fraction` parameter. This ensures pulse features extracted from a signal with ROIs match the features extracted from individually extracted ROI signals.
fr: Correction de l'extraction des caractéristiques des impulsions avec des signaux ROI. Lors de l'extraction des caractéristiques des impulsions à partir de signaux avec des ROI, les paramètres de plage de début/fin (qui s'appliquent au signal complet) étaient utilisés sur les données extraites des ROI, ce qui entraînait des résultats incorrects. Désormais, `extract_pulse_features()` détecte lorsque les plages de paramètres sont en dehors de la plage x de la ROI et passe automatiquement en mode de détection automatique. De plus, `extract_pulse_features()` dans `sigima.tools.signal.pulse` initialise désormais correctement les plages `None` en utilisant `get_start_range()` et `get_end_range()` avec le paramètre `fraction`. Cela garantit que les caractéristiques des impulsions extraites d'un signal avec des ROI correspondent aux caractéristiques extraites des signaux ROI extraits individuellement.

source: Fixed ROI extraction for signals: ROIs are no longer incorrectly copied to destination signals when extracting ROIs. When using `extract_roi()` or `extract_rois()`, the extracted signals now have no ROI defined, which is the expected behavior since the extracted data already represents the ROI itself. This fixes the issue where extracted signals would inherit the source signal's ROI definitions.
fr: Correction de l'extraction des ROI pour les signaux : les ROI ne sont plus copiées vers les signaux de destination lors de l'extraction des ROI. Lors de l'utilisation de `extract_roi()` ou `extract_rois()`, les signaux extraits n'ont désormais aucune ROI définie, ce qui est le comportement attendu puisque les données extraites représentent déjà la ROI elle-même. Cela corrige le problème où les signaux extraits hériterait des définitions de ROI du signal source.

source: Fixed pulse features computation to be ROI-exclusive when ROIs are defined. Previously, `TableKind.PULSE_FEATURES` incorrectly computed results for both the whole object and each ROI. This made no sense for pulse analysis, where defining ROIs indicates the presence of multiple pulses, making whole-object features irrelevant. Now `PULSE_FEATURES` correctly computes only on ROIs when they exist, otherwise on the whole object. `TableKind.STATISTICS` and `TableKind.CUSTOM` maintain the expected behavior (whole object + ROIs).
fr: Correction de l'extraction des caractéristiques des impulsions pour qu'elle soit exclusive aux ROI lorsque des ROI sont définies. Auparavant, `TableKind.PULSE_FEATURES` calculait incorrectement les résultats à la fois pour l'objet entier et pour chaque ROI. Cela n'avait pas de sens pour l'analyse des impulsions, où la définition des ROI indique la présence de plusieurs impulsions, rendant les caractéristiques de l'objet entier non pertinentes. Désormais, `PULSE_FEATURES` calcule correctement uniquement sur les ROI lorsqu'elles existent, sinon sur l'objet entier. `TableKind.STATISTICS` et `TableKind.CUSTOM` conservent le comportement attendu (objet entier + ROI).

source: Fixed `ValueError` in `choose_savgol_window_auto()` when processing small data arrays (e.g., ROI segments). The function now properly constrains the Savitzky-Golay window length to be strictly less than the array size, as required by scipy's `mode='interp'` option. This fixes the issue when extracting pulse features from small ROI segments in signals.
fr: Correction de `ValueError` dans `choose_savgol_window_auto()` lors du traitement de petits tableaux de données (par exemple, des segments ROI). La fonction contraint désormais correctement la longueur de la fenêtre Savitzky-Golay à être strictement inférieure à la taille du tableau, comme l'exige l'option `mode='interp'` de scipy. Cela corrige le problème lors de l'extraction des caractéristiques des impulsions à partir de petits segments ROI dans les signaux.

source: Modified `RadialProfileParam` to allow initialization of the dataset even when the associated image object is not yet set (call to `update_from_obj`). This is useful when creating the parameter object before assigning the image, enabling more flexible workflows.
fr: Modification de `RadialProfileParam` pour permettre l'initialisation de l'ensemble de données même lorsque l'objet image associé n'est pas encore défini (appel à `update_from_obj`). Cela est utile lors de la création de l'objet paramètre avant d'assigner l'image, permettant des flux de travail plus flexibles.

source: Removed unused `signals_to_array()` function from `sigima.proc.signal.arithmetic` module. This function was not used anywhere in the codebase and has been replaced by direct NumPy array construction in `__signals_y_to_array()` and `__signals_dy_to_array()` functions, for internal use only.
fr: Suppression de la fonction inutilisée `signals_to_array()` du module `sigima.proc.signal.arithmetic`. Cette fonction n'était utilisée nulle part dans la base de code et a été remplacée par une construction directe de tableau NumPy dans les fonctions `__signals_y_to_array()` et `__signals_dy_to_array()`, pour un usage interne uniquement.

source: **ROI coordinate setters**: Fixed bugs in `set_physical_coords()` and `set_indices_coords()` methods
fr: **Méthodes de définition des coordonnées ROI** : Correction des bogues dans les méthodes `set_physical_coords()` et `set_indices_coords()`

source: Fixed `RectangularROI.set_physical_coords()`: Now correctly stores coordinates in delta format `[x0, y0, dx, dy]` instead of corner format `[x0, y0, x1, y1]` when `indices=True`
fr: Correction de `RectangularROI.set_physical_coords()` : Maintenant, les coordonnées sont correctement stockées au format delta `[x0, y0, dx, dy]` au lieu du format coin `[x0, y0, x1, y1]` lorsque `indices=True`

source: Fixed `BaseSingleROI.set_indices_coords()`: Now correctly converts the input `coords` parameter instead of `self.coords` when `indices=False`
fr: Correction de `BaseSingleROI.set_indices_coords()` : Maintenant, le paramètre d'entrée `coords` est correctement converti au lieu de `self.coords` lorsque `indices=False`

source: These methods were implemented for API completeness but were not used in the Sigima/DataLab codebase
fr: Ces méthodes ont été implémentées pour compléter l'API mais n'ont pas été utilisées dans la base de code Sigima/DataLab

source: Added comprehensive unit tests covering all ROI types (rectangular, circular, polygonal) and edge cases
fr: Ajout de tests unitaires complets couvrant tous les types de ROI (rectangulaire, circulaire, polygonal) et les cas limites

source: **Signals to image conversion**: New feature to combine multiple signals into a 2D image
fr: **Conversion de signaux en image** : Nouvelle fonctionnalité pour combiner plusieurs signaux en une image 2D

source: New computation function `signals_to_image()` in `sigima.proc.signal.arithmetic`
fr: Nouvelle fonction de calcul `signals_to_image()` dans `sigima.proc.signal.arithmetic`

source: Takes a list of signals and combines them into an image by stacking Y-arrays
fr: Prend une liste de signaux et les combine en une image en empilant des tableaux Y

source: Two orientation modes:
fr: Deux modes d'orientation :

source: **Rows**: Each signal becomes a row in the image (default)
fr: **Lignes** : Chaque signal devient une ligne dans l'image (par défaut)

source: **Columns**: Each signal becomes a column in the image
fr: **Colonnes** : Chaque signal devient une colonne dans l'image

source: Optional normalization:
fr: Normalisation facultative :

source: Supports multiple normalization methods (Z-score, Min-Max, Maximum)
fr: Prend en charge plusieurs méthodes de normalisation (Z-score, Min-Max, Maximum)

source: Normalizes each signal independently before stacking
fr: Normalise chaque signal indépendamment avant l'empilement

source: Useful for visualizing signals with different amplitude ranges
fr: Utile pour visualiser des signaux avec différentes plages d'amplitude

source: Validates that all signals have the same size before combining
fr: Valide que tous les signaux ont la même taille avant de les combiner

source: New parameter class `SignalsToImageParam` with orientation and normalization settings
fr: Nouvelle classe de paramètres `SignalsToImageParam` avec des paramètres d'orientation et de normalisation

source: New enum `SignalsToImageOrientation` for specifying row/column orientation
fr: Nouvel énuméré `SignalsToImageOrientation` pour spécifier l'orientation des lignes/colonnes

source: Comprehensive validation tests for all combinations of parameters
fr: Tests de validation complets pour toutes les combinaisons de paramètres

source: Ideal for creating spectrograms, heatmaps, or waterfall displays from signal collections
fr: Idéal pour créer des spectrogrammes, des cartes thermiques ou des affichages en cascade à partir de collections de signaux

source: **Non-uniform coordinate support for images**: Added comprehensive support for non-uniform pixel coordinates
fr: **Prise en charge des coordonnées non uniformes pour les images** : Ajout d'une prise en charge complète des coordonnées de pixels non uniformes

source: `ImageObj` now supports both uniform and non-uniform coordinate systems:
fr: `ImageObj` prend désormais en charge les systèmes de coordonnées uniformes et non uniformes :

source: Uniform coordinates: defined by origin (`x0`, `y0`) and pixel spacing (`dx`, `dy`)
fr: Coordonnées uniformes : définies par l'origine (`x0`, `y0`) et l'espacement des pixels (`dx`, `dy`)

source: Non-uniform coordinates: defined by coordinate arrays (`xcoords`, `ycoords`)
fr: Coordonnées non uniformes : définies par des tableaux de coordonnées (`xcoords`, `ycoords`)

source: New methods for coordinate manipulation:
fr: Nouvelles méthodes pour la manipulation des coordonnées :

source: `set_coords()`: Set non-uniform X and Y coordinate arrays
fr: `set_coords()`: Définir les tableaux de coordonnées X et Y non uniformes

source: `is_uniform_coords`: Property to check if coordinates are uniform
fr: `is_uniform_coords`: Propriété pour vérifier si les coordonnées sont uniformes

source: New computation function `set_uniform_coords()`: Convert non-uniform to uniform coordinates
fr: `set_uniform_coords()`: Nouvelle fonction de calcul pour convertir les coordonnées non uniformes en coordonnées uniformes

source: Automatically extracts uniform spacing from non-uniform arrays
fr: Extrait automatiquement l'espacement uniforme des tableaux non uniformes

source: Handles numerical precision issues from linspace-generated arrays
fr: Gère les problèmes de précision numérique des tableaux générés par linspace

source: Preserves image data while transforming coordinate system
fr: Préserve les données d'image lors de la transformation du système de coordonnées

source: Enhanced `calibration()` function with polynomial support:
fr: Amélioration de la fonction `calibration()` avec prise en charge des polynômes :

source: Now supports polynomial calibration up to cubic order: `dst = a0 + a1*src + a2*src² + a3*src³`
fr: Prend désormais en charge l'étalonnage polynomial jusqu'à l'ordre cubique : `dst = a0 + a1*src + a2*src² + a3*src³`

source: Parameter class changed from `a, b` (linear) to `a0, a1, a2, a3` (polynomial)
fr: La classe de paramètres est passée de `a, b` (linéaire) à `a0, a1, a2, a3` (polynomiale)

source: Works on X-axis, Y-axis (creating non-uniform coordinates), and Z-axis (data values)
fr: Fonctionne sur l'axe X, l'axe Y (création de coordonnées non uniformes) et l'axe Z (valeurs de données)

source: Linear calibration is a special case with `a2=0, a3=0`
fr: L'étalonnage linéaire est un cas particulier avec `a2=0, a3=0`

source: Automatically handles conversion between uniform and non-uniform coordinate systems
fr: Gère automatiquement la conversion entre les systèmes de coordonnées uniformes et non uniformes

source: Enhanced I/O support:
fr: Support I/O amélioré :

source: HDF5 format now serializes/deserializes non-uniform coordinates
fr: Le format HDF5 prend désormais en charge la sérialisation/désérialisation des coordonnées non uniformes

source: Coordinated text files support non-uniform coordinate arrays
fr: Les fichiers texte coordonnés prennent en charge les tableaux de coordonnées non uniformes

source: All geometric operations updated to handle both coordinate types:
fr: Toutes les opérations géométriques ont été mises à jour pour gérer les deux types de coordonnées :

source: Coordinate transformations preserve or create appropriate coordinate system
fr: Les transformations de coordonnées préservent ou créent un système de coordonnées approprié

source: ROI operations work seamlessly with both uniform and non-uniform coordinates
fr: Les opérations ROI fonctionnent sans problème avec des coordonnées uniformes et non uniformes

source: **DateTime support for signal data**: Added comprehensive datetime handling for signal X-axis data
fr: **Prise en charge des DateTime pour les données de signal** : Ajout d'une gestion complète des DateTime pour les données de l'axe X du signal

source: Automatic detection and conversion of datetime columns when reading CSV files
fr: Détection et conversion automatiques des colonnes datetime lors de la lecture des fichiers CSV

source: Detects datetime values in the first or second column (handling index columns)
fr: Détecte les valeurs datetime dans la première ou la deuxième colonne (gestion des colonnes d'index)

source: Validates datetime format and ensures reasonable date ranges (post-1900)
fr: Valide le format datetime et garantit des plages de dates raisonnables (post-1900)

source: Converts datetime strings to float timestamps for efficient computation
fr: Convertit les chaînes datetime en timestamps flottants pour un calcul efficace

source: Preserves datetime metadata for proper display and export
fr: Préserve les métadonnées datetime pour un affichage et une exportation appropriés

source: New `SignalObj` methods for datetime manipulation:
fr: Nouvelles méthodes `SignalObj` pour la manipulation des datetime :

source: `set_x_from_datetime()`: Convert datetime objects/strings to signal X data with configurable time units (s, ms, μs, ns, min, h)
fr: `set_x_from_datetime()`: Convertit les objets/chaînes datetime en données X de signal avec des unités de temps configurables (s, ms, μs, ns, min, h)

source: `get_x_as_datetime()`: Retrieve X values as datetime objects for display or export
fr: `get_x_as_datetime()`: Récupère les valeurs X sous forme d'objets datetime pour l'affichage ou l'exportation

source: `is_x_datetime()`: Check if signal contains datetime data
fr: `is_x_datetime()`: Vérifie si le signal contient des données datetime

source: Enhanced CSV export to preserve datetime format when writing signals with datetime X-axis
fr: Export CSV amélioré pour préserver le format datetime lors de l'écriture de signaux avec un axe X datetime

source: New constants module (`sigima.objects.signal.constants`) defining datetime metadata keys and time unit conversion factors
fr: Nouveau module de constantes (`sigima.objects.signal.constants`) définissant les clés de métadonnées datetime et les facteurs de conversion des unités de temps

source: Comprehensive unit tests covering datetime conversion, I/O roundtrip, and edge cases
fr: Tests unitaires complets couvrant la conversion datetime, le roundtrip I/O et les cas limites

source: Example test data file with real-world temperature/humidity logger data (`datetime.txt`)
fr: Fichier de données de test exemple avec des données de logger de température/humidité du monde réel (`datetime.txt`)

source: **New client subpackage**: Migrated DataLab client functionality to `sigima.client`
fr: **Nouveau sous-paquet client** : Fonctionnalité client DataLab migrée vers `sigima.client`

source: Added `sigima.client.remote.SimpleRemoteProxy` for XML-RPC communication with DataLab
fr: Ajout de `sigima.client.remote.SimpleRemoteProxy` pour la communication XML-RPC avec DataLab

source: Added `sigima.client.base.SimpleBaseProxy` as abstract base class for DataLab proxies
fr: Ajout de `sigima.client.base.SimpleBaseProxy` en tant que classe de base abstraite pour les proxys DataLab

source: Included comprehensive unit tests and API documentation
fr: Ajout de tests unitaires complets et de documentation API

source: Maintains headless design principle (GUI components excluded)
fr: Maintient le principe de conception sans interface graphique (composants GUI exclus)

source: Enables remote control of DataLab application from Python scripts and Jupyter notebooks
fr: Permet le contrôle à distance de l'application DataLab depuis des scripts Python et des notebooks Jupyter

source: Client functionality is now directly accessible: `from sigima import SimpleRemoteProxy`
fr: La fonctionnalité client est désormais directement accessible : `from sigima import SimpleRemoteProxy`

source: **New image ROI feature**: Added inverse ROI functionality for image ROIs
fr: **Nouvelle fonctionnalité de ROI d'image** : Ajout de la fonctionnalité ROI inverse pour les ROIs d'image

source: Added `inside` parameter to `BaseSingleImageROI` base class, inherited by all image ROI types (`PolygonalROI`, `RectangularROI`, `CircularROI`)
fr: Ajout du paramètre `inside` à la classe de base `BaseSingleImageROI`, héritée par tous les types de ROI d'image (`PolygonalROI`, `RectangularROI`, `CircularROI`)

source: When `inside=True`, ROI represents the region inside the shape (inverted behavior)
fr: Lorsque `inside=True`, le ROI représente la région à l'intérieur de la forme (comportement inversé)

source: When `inside=False` (default), ROI represents the region outside the shape (original behavior)
fr: Lorsque `inside=False` (par défaut), le ROI représente la région à l'extérieur de la forme (comportement original)

source: Fully integrated with serialization (`to_dict`/`from_dict`) and parameter conversion (`to_param`/`from_param`)
fr: Entièrement intégré à la sérialisation (`to_dict`/`from_dict`) et à la conversion de paramètres (`to_param`/`from_param`)

source: Signal ROIs (`SegmentROI`) are unaffected as the concept doesn't apply to 1D intervals
fr: Les ROIs de signal (`SegmentROI`) ne sont pas affectées car le concept ne s'applique pas aux intervalles 1D.

source: Optimal architecture with zero code duplication - all `inside` functionality implemented once in the base class
fr: Architecture optimale sans duplication de code - toute la fonctionnalité `inside` est implémentée une seule fois dans la classe de base.

source: Individual ROI classes no longer need custom constructors, inheriting directly from base class
fr: Les classes ROI individuelles n'ont plus besoin de constructeurs personnalisés, héritant directement de la classe de base.

source: New image operation:
fr: Nouvelle opération d'image :

source: New image format support:
fr: Nouveau support de format d'image :

source: **Coordinated text image files**: Added support for reading coordinated text files (`.txt` extension), similar to the Matris image format.
fr: **Fichiers image texte avec coordonnées** : Ajout de la prise en charge de la lecture des fichiers texte coordonnés (extension `.txt`), similaires au format d'image Matris.

source: Supports both real and complex-valued image data with optional error images.
fr: Prend en charge à la fois les données d'image réelles et à valeurs complexes avec des images d'erreur facultatives.

source: Automatically handles NaN values in the data.
fr: Gère automatiquement les valeurs NaN dans les données.

source: Reads metadata including units (X, Y, Z) and labels from file headers.
fr: Lit les métadonnées, y compris les unités (X, Y, Z) et les étiquettes, à partir des en-têtes de fichiers.

source: New image analysis features:
fr: Nouvelles fonctionnalités d'analyse de l'image :

source: Horizontal and vertical projections
fr: Projections horizontale et verticale
