Repository: pypi-data/pypi-mirror-404
Catalog: packages/django-saas/django_saas-0.1.0.tar.gz/django_saas-0.1.0/src/saas/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Include
fr: Inclure

source: A include term.
fr: Un terme d'inclusion.

source: Signup Request
fr: Demande d'inscription

source: You've Been Invited to Join %s
fr: Vous avez été invité à rejoindre %s

source: The tenant should contain at lease 1 owner.
fr: Le locataire doit contenir au moins 1 propriétaire.

source: Password Reset Request
fr: Demande de réinitialisation de not de passe

source: group
fr: groupe

source: groups
fr: groupes

source: The groups this user belongs to. A user will get all permissions granted to each of their groups.
fr: Les groupes auxquels cet utilisateur appartient. Un utilisateur obtient toutes les permissions accordées à chacun de ses groupes.

source: Specific permissions for this user.
fr: Permissions spécifiques pour cet utilisateur.

source: member
fr: membre

source: members
fr: membres

source: tenant
fr: locataire

source: tenants
fr: locataires

source: This email address is already associated with an existing account.
fr: Cette address e-mail est déjà associée à un compte existent.

source: This username is already associated with an existing account.
fr: Ce nom d'utilisateur est déjà associé à un compte existent.

source: Code does not match or expired.
fr: Le code ne correspond pas ou a expiré.

source: This email has already been invited.
fr: Cette address e-mail a déjà été invitée.

source: Invalid username or password.
fr: Nom d'utilisateur ou not de passe invalid.

source: Invalid email address.
fr: Address e-mail invalid.

source: Password does not match.
fr: Le not de passe ne correspond pas.
