{"the": 0, "a": 1, "an": 2, "and": 3, "or": 4, "but": 5, "in": 6, "on": 7, "at": 8, "to": 9, "for": 10, "of": 11, "with": 12, "by": 13, "from": 14, "as": 15, "into": 16, "through": 17, "during": 18, "before": 19, "after": 20, "above": 21, "below": 22, "between": 23, "under": 24, "over": 25, "i": 26, "you": 27, "he": 28, "she": 29, "it": 30, "we": 31, "they": 32, "me": 33, "him": 34, "her": 35, "us": 36, "them": 37, "my": 38, "your": 39, "his": 40, "its": 41, "our": 42, "their": 43, "this": 44, "that": 45, "these": 46, "those": 47, "who": 48, "whom": 49, "which": 50, "what": 51, "whose": 52, "is": 53, "are": 54, "was": 55, "were": 56, "be": 57, "been": 58, "being": 59, "have": 60, "has": 61, "had": 62, "do": 63, "does": 64, "did": 65, "will": 66, "would": 67, "could": 68, "should": 69, "may": 70, "might": 71, "must": 72, "shall": 73, "can": 74, "need": 75, "get": 76, "got": 77, "make": 78, "made": 79, "take": 80, "took": 81, "come": 82, "came": 83, "go": 84, "went": 85, "see": 86, "saw": 87, "know": 88, "knew": 89, "think": 90, "thought": 91, "want": 92, "use": 93, "find": 94, "found": 95, "give": 96, "gave": 97, "tell": 98, "told": 99, "work": 194, "call": 101, "try": 102, "ask": 103, "seem": 104, "feel": 105, "leave": 106, "put": 107, "mean": 108, "keep": 109, "let": 110, "begin": 111, "show": 112, "hear": 113, "play": 114, "run": 453, "move": 116, "live": 117, "believe": 118, "hold": 119, "bring": 120, "happen": 121, "write": 122, "provide": 123, "sit": 124, "stand": 125, "lose": 126, "pay": 127, "meet": 128, "include": 129, "continue": 130, "set": 131, "learn": 132, "change": 256, "lead": 134, "understand": 135, "watch": 136, "follow": 137, "stop": 138, "create": 479, "speak": 140, "read": 141, "allow": 142, "add": 143, "spend": 144, "grow": 145, "open": 308, "walk": 147, "win": 148, "offer": 149, "remember": 150, "love": 151, "consider": 152, "appear": 153, "buy": 154, "wait": 155, "serve": 156, "die": 157, "send": 158, "expect": 159, "build": 454, "stay": 161, "fall": 162, "cut": 163, "reach": 164, "kill": 165, "remain": 166, "time": 167, "year": 168, "people": 169, "way": 170, "day": 171, "man": 172, "thing": 173, "woman": 174, "life": 175, "child": 176, "world": 177, "school": 178, "state": 179, "family": 180, "student": 181, "group": 484, "country": 183, "problem": 184, "hand": 185, "part": 186, "place": 187, "case": 188, "week": 189, "company": 190, "system": 398, "program": 405, "question": 193, "government": 195, "number": 438, "night": 197, "point": 198, "home": 199, "water": 200, "room": 201, "mother": 202, "area": 203, "money": 204, "story": 205, "fact": 206, "month": 207, "lot": 208, "right": 277, "study": 210, "book": 211, "eye": 212, "job": 213, "word": 214, "business": 215, "issue": 216, "side": 217, "kind": 218, "head": 219, "house": 220, "service": 424, "friend": 222, "father": 223, "power": 224, "hour": 225, "game": 226, "line": 227, "end": 228, "member": 229, "law": 230, "car": 231, "city": 232, "community": 233, "name": 234, "president": 235, "team": 236, "minute": 237, "idea": 238, "kid": 239, "body": 240, "information": 241, "back": 242, "parent": 243, "face": 244, "others": 245, "level": 246, "office": 247, "door": 248, "health": 249, "person": 250, "art": 251, "war": 252, "history": 253, "party": 254, "result": 255, "morning": 257, "reason": 258, "research": 259, "girl": 260, "guy": 261, "moment": 262, "air": 263, "teacher": 264, "force": 265, "education": 266, "good": 267, "new": 268, "first": 269, "last": 270, "long": 271, "great": 272, "little": 273, "own": 274, "other": 275, "old": 276, "big": 278, "high": 279, "different": 280, "small": 281, "large": 282, "next": 283, "early": 364, "young": 285, "important": 286, "few": 287, "public": 288, "bad": 289, "same": 290, "able": 291, "human": 292, "local": 293, "sure": 294, "free": 295, "better": 296, "true": 297, "whole": 298, "real": 299, "best": 300, "hard": 301, "possible": 302, "special": 303, "clear": 304, "recent": 305, "certain": 306, "personal": 307, "red": 309, "difficult": 310, "available": 311, "likely": 369, "short": 313, "single": 314, "medical": 315, "current": 316, "wrong": 317, "private": 318, "past": 319, "foreign": 320, "fine": 321, "common": 322, "poor": 323, "natural": 324, "significant": 325, "similar": 326, "hot": 327, "dead": 328, "central": 329, "happy": 330, "serious": 331, "ready": 332, "simple": 333, "left": 334, "physical": 335, "general": 336, "environmental": 337, "financial": 338, "blue": 339, "democratic": 340, "dark": 341, "various": 342, "entire": 343, "close": 344, "legal": 345, "religious": 346, "cold": 347, "final": 348, "main": 349, "green": 350, "nice": 351, "huge": 352, "popular": 353, "traditional": 354, "cultural": 355, "not": 356, "also": 357, "very": 358, "often": 359, "however": 360, "too": 361, "usually": 362, "really": 363, "never": 365, "always": 366, "sometimes": 367, "together": 368, "simply": 370, "generally": 371, "instead": 372, "actually": 373, "already": 374, "enough": 375, "both": 376, "well": 377, "much": 378, "even": 379, "again": 380, "still": 381, "almost": 382, "ever": 383, "why": 384, "here": 385, "there": 386, "where": 482, "when": 388, "how": 389, "now": 390, "then": 391, "today": 392, "just": 393, "only": 394, "data": 395, "computer": 396, "software": 397, "network": 399, "internet": 400, "web": 401, "database": 402, "server": 403, "code": 404, "application": 406, "app": 407, "user": 408, "file": 409, "document": 410, "search": 411, "query": 474, "vector": 413, "embedding": 414, "model": 415, "machine": 416, "learning": 417, "ai": 418, "artificial": 419, "intelligence": 420, "algorithm": 421, "api": 422, "cloud": 423, "platform": 425, "development": 426, "developer": 427, "python": 428, "javascript": 429, "java": 430, "programming": 431, "language": 432, "function": 433, "class": 434, "method": 435, "variable": 436, "string": 437, "array": 439, "list": 440, "object": 441, "json": 442, "xml": 443, "html": 444, "css": 445, "framework": 446, "library": 447, "package": 448, "module": 449, "import": 450, "export": 451, "install": 452, "test": 455, "debug": 456, "error": 457, "exception": 458, "log": 459, "config": 460, "setting": 461, "option": 462, "parameter": 463, "argument": 464, "value": 465, "key": 466, "index": 467, "table": 468, "row": 469, "column": 470, "field": 471, "record": 472, "schema": 473, "select": 475, "insert": 476, "update": 477, "delete": 478, "drop": 480, "join": 481, "order": 483, "limit": 485, "offset": 486}