class Folders(object):

    DATA01 = "STORED"
    DATA02 = "STORAGE"
    DATA03 = "MONISHA"
    DATA04 = "CLINTON"
    DATA05 = "ABRAHAM"
    DATA06 = "DOWNLOAD"
    DATA07 = "DOWNLOADS"
    DATA08 = "TEMPORARY"

#=======================================================================================

class Numeo(object):

    DATA01 = ["", "K", "M", "B", "T", "Qa", "Qu", "S", "Oc", "No"]

#=======================================================================================

class Humon(object):

    DATA01 = {0:'B', 1:'KB', 2:'MB', 3:'GB', 4:'TB', 5:'PB', 6:'EB', 7:'ZB', 8:'YB'}
    DATA03 = {0:'ʙ', 1:'ᴋʙ', 2:'ᴍʙ', 3:'ɢʙ', 4:'ᴛʙ', 5:'ᴘʙ', 6:'ᴇʙ', 7:'ᴢʙ', 8:'ʏʙ'}
    DATA02 = {0:'𝙱', 1:'𝙺𝙱', 2:'𝙼𝙱', 3:'𝙶𝙱', 4:'𝚃𝙱', 5:'𝙿𝙱', 6:'𝙴𝙱', 7:'𝚉𝙱', 8:'𝚈𝙱'}

#=======================================================================================
