Repository: pypi-data/pypi-mirror-404
Catalog: packages/sigima/sigima-1.0.6.tar.gz/sigima-1.0.6/doc/locale/*/LC_MESSAGES/auto_examples/getting_started/signal_creation.po
Languages: fr

source: :ref:`Go to the end <sphx_glr_download_auto_examples_getting_started_signal_creation.py>` to download the full example code.
fr: :ref:`Aller à la fin <sphx_glr_download_auto_examples_getting_started_signal_creation.py>` pour télécharger l'exemple de code complet.

source: Creating Signals
fr: Création de signaux

source: This example focuses on creating 1D signal objects in Sigima.
fr: Cet exemple se concentre sur la création d'objets signaux 1D dans Sigima.

source: There are three primary methods to create signals in Sigima:
fr: Il existe trois méthodes principales pour créer des signaux dans Sigima :

source: **Synthetic data generation**: Using built-in parameter classes to create standard
fr: **Génération de données synthétiques** : utilisation de classes de paramètres intégrées pour créer des

source: signal types (Gaussian, sine waves, random distributions, etc.)
fr: types de signaux standards (gaussienne, ondes sinusoïdales, distributions aléatoires, etc.)

source: **Loading from files**: Importing data from various file formats
fr: **Chargement depuis des fichiers** : importation de données depuis divers formats de fichiers

source: **From NumPy arrays**: Creating objects directly from existing arrays
fr: **Depuis des tableaux NumPy** : création d'objets directement depuis des tableaux existants

source: Each method has its use cases, and Sigima provides a consistent interface for working with data regardless of its origin.
fr: Chaque méthode a ses cas d'usage, et Sigima fournit une interface cohérente pour travailler avec les données quelle que soit leur origine.

source: For visualization, we use helper functions from the ``sigima.tests.vistools`` module. This allows us to focus on Sigima's functionality rather than visualization details.
fr: Pour la visualisation, nous utilisons des fonctions auxiliaires du module ``sigima.tests.vistools``. Cela nous permet de nous concentrer sur les fonctionnalités de Sigima plutôt que sur les détails de visualisation.

source: Importing necessary modules
fr: Import des modules nécessaires

source: First of all, we need to import the required modules.
fr: Tout d'abord, nous devons importer les modules requis.

source: Method 1: Creating signals from synthetic parameters
fr: Méthode 1 : Création de signaux à partir de paramètres synthétiques

source: Sigima provides built-in generators for common signal types. This is the most convenient method when you need standard mathematical functions or random distributions.
fr: Sigima fournit des générateurs intégrés pour les types de signaux courants. C'est la méthode la plus pratique lorsque vous avez besoin de fonctions mathématiques standards ou de distributions aléatoires.

source: Available signal types include:
fr: Les types de signaux disponibles incluent :

source: Mathematical functions: Gaussian, Lorentzian, Sinc, Sine, Cosine, etc.
fr: Fonctions mathématiques : gaussienne, lorentzienne, sinc, sinus, cosinus, etc.

source: Random distributions: Normal, Uniform, Poisson
fr: Distributions aléatoires : normale, uniforme, Poisson

source: Standard waveforms: Square, Sawtooth, Triangle
fr: Formes d'ondes standards : carrée, en dents de scie, triangulaire

source: Special functions: Planck (blackbody), Linear chirp, Step, Exponential
fr: Fonctions spéciales : Planck (corps noir), chirp linéaire, échelon, exponentielle

source: Method 2: Loading signals from files
fr: Méthode 2 : Chargement de signaux depuis des fichiers

source: Sigima can read signals from various file formats, automatically detecting the format and extracting metadata when available.
fr: Sigima peut lire des signaux depuis divers formats de fichiers, en détectant automatiquement le format et en extrayant les métadonnées lorsqu'elles sont disponibles.

source: Supported formats include:
fr: Les formats pris en charge incluent :

source: Text files: CSV, TXT (with automatic delimiter detection)
fr: Fichiers texte : CSV, TXT (avec détection automatique du délimiteur)

source: Scientific formats: HDF5 (.h5sig), MAT-Files (.mat), NumPy (.npy)
fr: Formats scientifiques : HDF5 (.h5sig), MAT-Files (.mat), NumPy (.npy)

source: Specialized: MCA spectrum files (.mca), FT-Lab (.sig)
fr: Spécialisés : fichiers de spectre MCA (.mca), FT-Lab (.sig)

source: It is interesting to remark here that when importing data from files, Sigima automatically extracts and preserves metadata when possible. This includes:
fr: Il est intéressant de noter ici que lors de l'importation de données depuis des fichiers, Sigima extrait et préserve automatiquement les métadonnées lorsque c'est possible. Cela inclut :

source: **Axis labels and units**: Column headers from CSV files, variable names from MAT-Files, etc.
fr: **Étiquettes et unités des axes** : en-têtes de colonnes des fichiers CSV, noms de variables des MAT-Files, etc.

source: **Acquisition parameters**: DICOM headers, instrument settings, timestamps
fr: **Paramètres d'acquisition** : en-têtes DICOM, paramètres d'instruments, horodatages

source: **Physical coordinates**: Pixel spacing, origin coordinates when stored in the file
fr: **Coordonnées physiques** : espacement des pixels, coordonnées d'origine lorsqu'elles sont stockées dans le fichier

source: The extracted metadata is seamlessly integrated into the signal or image object, making it available for processing, analysis, and visualization without manual configuration.
fr: Les métadonnées extraites sont intégrées de manière transparente dans l'objet signal ou image, les rendant disponibles pour le traitement, l'analyse et la visualisation sans configuration manuelle.

source: Method 3: Creating signals from NumPy arrays
fr: Méthode 3 : Création de signaux à partir de tableaux NumPy

source: When you already have data in NumPy arrays (from calculations, other libraries, or custom data sources), you can wrap them in Sigima signal objects to benefit from metadata handling and processing functions.
fr: Lorsque vous avez déjà des données dans des tableaux NumPy (provenant de calculs, d'autres bibliothèques ou de sources de données personnalisées), vous pouvez les encapsuler dans des objets signaux Sigima pour bénéficier de la gestion des métadonnées et des fonctions de traitement.

source: Summary
fr: Résumé

source: This example demonstrated the three main ways to create signals in Sigima:
fr: Cet exemple a démontré les trois principales façons de créer des signaux dans Sigima :

source: **Synthetic generation**: Fast creation of standard mathematical functions and distributions using parameter classes. Perfect for testing and simulation.
fr: **Génération synthétique** : création rapide de fonctions mathématiques standards et de distributions à l'aide de classes de paramètres. Parfait pour les tests et la simulation.

source: **File loading**: Read data from various scientific and common file formats, with automatic format detection and metadata extraction. Essential for working with experimental data.
fr: **Chargement de fichiers** : lecture de données depuis divers formats de fichiers scientifiques et courants, avec détection automatique du format et extraction des métadonnées. Essentiel pour travailler avec des données expérimentales.

source: **NumPy array conversion**: Wrap existing array data with Sigima's rich metadata and processing capabilities. Ideal for custom workflows and integration with other Python libraries.
fr: **Conversion de tableaux NumPy** : encapsulation de données de tableaux existants avec les riches métadonnées et capacités de traitement de Sigima. Idéal pour les flux de travail personnalisés et l'intégration avec d'autres bibliothèques Python.

source: All three methods produce equivalent Sigima objects that can be processed, analyzed, and visualized using the same set of tools and functions. Choose the method that best fits your workflow and data source.
fr: Les trois méthodes produisent des objets Sigima équivalents qui peuvent être traités, analysés et visualisés en utilisant le même ensemble d'outils et de fonctions. Choisissez la méthode qui correspond le mieux à votre flux de travail et à votre source de données.

source: :download:`Download Jupyter notebook: signal_creation.ipynb <signal_creation.ipynb>`
fr: :download:`Télécharger le notebook Jupyter : signal_creation.ipynb <signal_creation.ipynb>`

source: :download:`Download Python source code: signal_creation.py <signal_creation.py>`
fr: :download:`Télécharger le code source Python : signal_creation.py <signal_creation.py>`

source: :download:`Download zipped: signal_creation.zip <signal_creation.zip>`
fr: :download:`Télécharger compressé : signal_creation.zip <signal_creation.zip>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
fr: `Galerie générée par Sphinx-Gallery <https://sphinx-gallery.github.io>`_
