Repository: pypi-data/pypi-mirror-404
Catalog: packages/finanzonline-databox/finanzonline_databox-1.2.12.tar.gz/finanzonline_databox-1.2.12/src/finanzonline_databox/locales/*/LC_MESSAGES/messages.po
Languages: de, es, fr, ru

source: Use --output to specify a different directory, or check file permissions.
de: Verwenden Sie --output, um ein anderes Verzeichnis anzugeben, oder überprüfen Sie die Dateiberechtigungen.
es: Use --output para especificar un directorio diferente, o verifique los permisos de archivo.
fr: Utilisez --output pour spécifier un répertoire différent, ou vérifiez les permissions de fichier.
ru: Используйте --output для указания другого каталога или проверьте права доступа к файлам.

source: Free up disk space or use --output to specify a different disk.
de: Geben Sie Speicherplatz frei oder verwenden Sie --output, um eine andere Festplatte anzugeben.
es: Libere espacio en disco o use --output para especificar un disco diferente.
fr: Libérez de l'espace disque ou utilisez --output pour spécifier un autre disque.
ru: Освободите место на диске или используйте --output для указания другого диска.

source: Use --output to specify a writable directory.
de: Verwenden Sie --output, um ein beschreibbares Verzeichnis anzugeben.
es: Use --output para especificar un directorio con permisos de escritura.
fr: Utilisez --output pour spécifier un répertoire accessible en écriture.
ru: Используйте --output для указания каталога с правами записи.

source: Use --filename to specify a shorter filename.
de: Verwenden Sie --filename, um einen kürzeren Dateinamen anzugeben.
es: Use --filename para especificar un nombre de archivo más corto.
fr: Utilisez --filename pour spécifier un nom de fichier plus court.
ru: Используйте --filename для указания более короткого имени файла.

source: Hint:
de: Hinweis:
es: Sugerencia:
fr: Conseil:
ru: Подсказка:

source: DataBox in maintenance mode
de: DataBox in Wartung
es: DataBox en modo de mantenimiento
fr: DataBox en mode maintenance
ru: DataBox в режиме обслуживания

source: Invalid XML Response
de: Ungültige XML-Antwort
es: Respuesta XML no válida
fr: Réponse XML invalide
ru: Недопустимый XML-ответ

source: Server Message
de: Server-Nachricht
es: Mensaje del servidor
fr: Message du serveur
ru: Сообщение сервера

source: HTML Source Code
de: HTML-Quellcode
es: Código fuente HTML
fr: Code source HTML
ru: Исходный код HTML

source: Click to expand
de: Klicken zum Ausklappen
es: Haga clic para expandir
fr: Cliquez pour développer
ru: Нажмите для раскрытия

source: Chunk %d (days %d-%d): %d from API, %d after filter - %d unread
de: Chunk %d (Tage %d-%d): %d von API, %d nach Filter - %d ungelesen
es: Bloque %d (días %d-%d): %d de API, %d después de filtrar - %d no leídas
fr: Bloc %d (jours %d-%d): %d de l'API, %d après filtre - %d non lues
ru: Часть %d (дни %d-%d): %d от API, %d после фильтра - %d непрочитанных

source: Status
es: Estado
fr: Statut
ru: Статус

source: Output Dir
de: Ausgabeverz.
es: Dir. Salida
fr: Rép. Sortie
ru: Каталог

source: Retrieved
de: Abgerufen
es: Recuperados
fr: Récupérés
ru: Получено

source: After Filter
de: Nach Filter
es: Después de filtrar
fr: Après filtre
ru: После фильтра

source: Skipped (exists)
de: Übersprungen (vorhanden)
es: Omitidos (existentes)
fr: Ignorés (existants)
ru: Пропущено (существует)

source: Failed
de: Fehlgeschlagen
es: Fallidos
fr: Échoués
ru: Не удалось

source: Total Size
de: Gesamtgröße
es: Tamaño Total
fr: Taille Totale
ru: Общий размер

source: Downloaded
de: Heruntergeladen
es: Descargado
fr: Téléchargé

source: All configuration files are already up to date (content unchanged).
de: Alle Konfigurationsdateien sind bereits aktuell (Inhalt unverändert).
