Repository: pypi-data/pypi-mirror-404
Catalog: packages/finanzonline-databox/finanzonline_databox-1.2.12.tar.gz/finanzonline_databox-1.2.12/src/finanzonline_databox/locales/*/LC_MESSAGES/messages.po
Languages: de, es, fr, ru

source: Bescheid
es: Resolución
fr: Décision
ru: Решение

source: Mitteilung
es: Notificación
fr: Notification
ru: Уведомление

source: Information
es: Información
ru: Информация

source: Protokoll
es: Protocolo
fr: Protocole
ru: Протокол

source: EU-Erledigung
es: Trámite UE
fr: Traitement UE
ru: ЕС-обработка

source: Show full Python traceback on errors
de: Vollständige Python-Fehlerrückverfolgung bei Fehlern anzeigen
es: Mostrar traza completa de Python en errores
fr: Afficher la trace Python complète en cas d'erreur
ru: Показывать полную трассировку Python при ошибках

source: Load configuration from a named profile (e.g., 'production', 'test')
de: Konfiguration aus einem benannten Profil laden (z.B. 'production', 'test')
es: Cargar configuración desde un perfil nombrado (ej. 'production', 'test')
fr: Charger la configuration depuis un profil nommé (ex. 'production', 'test')
ru: Загрузить конфигурацию из именованного профиля (например, 'production', 'test')

source: Output format (human-readable or JSON)
de: Ausgabeformat (menschenlesbar oder JSON)
es: Formato de salida (legible o JSON)
fr: Format de sortie (lisible ou JSON)
ru: Формат вывода (читаемый или JSON)

source: Show only a specific configuration section (e.g., 'lib_log_rich')
de: Nur einen bestimmten Konfigurationsabschnitt anzeigen (z.B. 'lib_log_rich')
es: Mostrar solo una sección de configuración específica (ej. 'lib_log_rich')
fr: Afficher uniquement une section de configuration spécifique (ex. 'lib_log_rich')
ru: Показать только определённый раздел конфигурации (например, 'lib_log_rich')

source: Override profile from root command (e.g., 'production', 'test')
de: Profil vom Hauptbefehl überschreiben (z.B. 'production', 'test')
es: Sobrescribir perfil del comando raíz (ej. 'production', 'test')
fr: Remplacer le profil de la commande racine (ex. 'production', 'test')
ru: Переопределить профиль из корневой команды (например, 'production', 'test')

source: profile
de: Profil
es: perfil
fr: profil
ru: профиль

source: Configuration deployed successfully
de: Konfiguration erfolgreich bereitgestellt
es: Configuración desplegada exitosamente
fr: Configuration déployée avec succès
ru: Конфигурация успешно развёрнута

source: No files were created (all target files already exist).
de: Keine Dateien erstellt (alle Zieldateien existieren bereits).
es: No se crearon archivos (todos los archivos destino ya existen).
fr: Aucun fichier créé (tous les fichiers cibles existent déjà).
ru: Файлы не созданы (все целевые файлы уже существуют).

source: Use --force to overwrite existing configuration files.
de: Verwenden Sie --force um vorhandene Konfigurationsdateien zu überschreiben.
es: Use --force para sobrescribir archivos de configuración existentes.
fr: Utilisez --force pour écraser les fichiers de configuration existants.
ru: Используйте --force для перезаписи существующих файлов конфигурации.

source: Error
de: Fehler
fr: Erreur
ru: Ошибка

source: Permission denied.
de: Zugriff verweigert.
es: Permiso denegado.
fr: Permission refusée.
ru: Доступ запрещён.

source: Hint: System-wide deployment (--target app/host) may require sudo.
de: Hinweis: Systemweite Bereitstellung (--target app/host) erfordert möglicherweise sudo.
es: Sugerencia: El despliegue a nivel de sistema (--target app/host) puede requerir sudo.
fr: Conseil : Le déploiement système (--target app/host) peut nécessiter sudo.
ru: Подсказка: Системное развёртывание (--target app/host) может потребовать sudo.

source: Failed to deploy configuration:
de: Konfigurationsbereitstellung fehlgeschlagen:
es: Error al desplegar configuración:
fr: Échec du déploiement de la configuration :
ru: Не удалось развернуть конфигурацию:

source: Target configuration layer(s) to deploy to (can specify multiple)
de: Ziel-Konfigurationsebene(n) für Bereitstellung (mehrfach möglich)
es: Capa(s) de configuración destino para desplegar (puede especificar múltiples)
fr: Couche(s) de configuration cible pour le déploiement (peut en spécifier plusieurs)
ru: Целевой уровень(и) конфигурации для развёртывания (можно указать несколько)

source: Overwrite existing configuration files
de: Vorhandene Konfigurationsdateien überschreiben
es: Sobrescribir archivos de configuración existentes
fr: Écraser les fichiers de configuration existants
ru: Перезаписать существующие файлы конфигурации

source: Configure FinanzOnline credentials in your config file or via environment variables:
de: Konfigurieren Sie FinanzOnline-Zugangsdaten in Ihrer Konfigurationsdatei oder über Umgebungsvariablen:
es: Configure las credenciales de FinanzOnline en su archivo de configuración o mediante variables de entorno:
fr: Configurez les identifiants FinanzOnline dans votre fichier de configuration ou via les variables d'environnement :
ru: Настройте учётные данные FinanzOnline в файле конфигурации или через переменные окружения:

source: 8-12 alphanumeric
de: 8-12 alphanumerisch
es: 8-12 alfanumérico
fr: 8-12 alphanumérique
ru: 8-12 буквенно-цифровых

source: 5-12 chars
de: 5-12 Zeichen
es: 5-12 caracteres
fr: 5-12 caractères
ru: 5-12 символов

source: 5-128 chars
de: 5-128 Zeichen
es: 5-128 caracteres
fr: 5-128 caractères
ru: 5-128 символов

source: 10-24 alphanumeric
de: 10-24 alphanumerisch
es: 10-24 alfanumérico
fr: 10-24 alphanumérique
ru: 10-24 буквенно-цифровых

source: Return code:
de: Rückgabecode:
es: Código de retorno:
fr: Code de retour :
ru: Код возврата:

source: This error may be temporary. Try again later.
de: Dieser Fehler ist möglicherweise vorübergehend. Versuchen Sie es später erneut.
es: Este error puede ser temporal. Intente de nuevo más tarde.
fr: Cette erreur peut être temporaire. Réessayez plus tard.
ru: Эта ошибка может быть временной. Повторите попытку позже.

source: Document type filter (B=Bescheide, M=Mitteilungen, I=Info, P=Protokolle, empty=all unread)
de: Dokumenttyp-Filter (B=Bescheide, M=Mitteilungen, I=Info, P=Protokolle, leer=alle ungelesenen)
es: Filtro de tipo de documento (B=Resoluciones, M=Notificaciones, I=Info, P=Protocolos, vacío=todos no leídos)
fr: Filtre de type de document (B=Décisions, M=Notifications, I=Info, P=Protocoles, vide=tous non lus)
ru: Фильтр типа документа (B=Решения, M=Уведомления, I=Инфо, P=Протоколы, пусто=все непрочитанные)

source: Start date filter (YYYY-MM-DD, max 31 days ago)
de: Startdatum-Filter (JJJJ-MM-TT, max. 31 Tage zurück)
es: Filtro de fecha inicio (AAAA-MM-DD, máx. 31 días atrás)
fr: Filtre date de début (AAAA-MM-JJ, max. 31 jours)
ru: Фильтр начальной даты (YYYY-MM-DD, макс. 31 день назад)

source: End date filter (YYYY-MM-DD, max 7 days after start)
de: Enddatum-Filter (JJJJ-MM-TT, max. 7 Tage nach Start)
es: Filtro de fecha fin (AAAA-MM-DD, máx. 7 días después del inicio)
fr: Filtre date de fin (AAAA-MM-JJ, max. 7 jours après le début)
ru: Фильтр конечной даты (YYYY-MM-DD, макс. 7 дней после начала)

source: List documents from last N days (overrides --from/--to, max 7)
de: Dokumente der letzten N Tage auflisten (überschreibt --from/--to, max. 7)
es: Listar documentos de los últimos N días (sobrescribe --from/--to, máx. 7)
fr: Lister les documents des N derniers jours (remplace --from/--to, max. 7)
ru: Список документов за последние N дней (переопределяет --from/--to, макс. 7)

source: Show only unread documents (default)
de: Nur ungelesene Dokumente anzeigen (Standard)
es: Mostrar solo documentos no leídos (por defecto)
fr: Afficher uniquement les documents non lus (par défaut)
ru: Показать только непрочитанные документы (по умолчанию)

source: Show only read documents
de: Nur gelesene Dokumente anzeigen
es: Mostrar solo documentos leídos
fr: Afficher uniquement les documents lus
ru: Показать только прочитанные документы

source: Show all documents
de: Alle Dokumente anzeigen
es: Mostrar todos los documentos
fr: Afficher tous les documents
ru: Показать все документы

source: Reference filter (anbringen, e.g., UID, E1)
de: Referenz-Filter (Anbringen, z.B. UID, E1)
es: Filtro de referencia (anbringen, ej. UID, E1)
fr: Filtre de référence (anbringen, ex. UID, E1)
ru: Фильтр по ссылке (anbringen, например, UID, E1)

source: Output format (default: human)
de: Ausgabeformat (Standard: menschenlesbar)
es: Formato de salida (por defecto: legible)
fr: Format de sortie (par défaut : lisible)
ru: Формат вывода (по умолчанию: читаемый)

source: Output directory for downloaded file (default: config or current directory)
de: Ausgabeverzeichnis für heruntergeladene Datei (Standard: Konfiguration oder aktuelles Verzeichnis)
es: Directorio de salida para archivo descargado (por defecto: configuración o directorio actual)
fr: Répertoire de sortie pour le fichier téléchargé (par défaut : configuration ou répertoire courant)
ru: Каталог для скачанного файла (по умолчанию: из конфигурации или текущий каталог)

source: Override output filename (default: auto-generated from entry metadata)
de: Ausgabedateiname überschreiben (Standard: automatisch aus Metadaten generiert)
es: Sobrescribir nombre de archivo (por defecto: auto-generado desde metadatos)
fr: Remplacer le nom de fichier (par défaut : auto-généré depuis les métadonnées)
ru: Переопределить имя файла (по умолчанию: автоматически из метаданных)

source: Size
de: Größe
es: Tamaño
fr: Taille
ru: Размер

source: Output directory for downloaded files (default: config or ./databox)
de: Ausgabeverzeichnis für heruntergeladene Dateien (Standard: Konfiguration oder ./databox)
es: Directorio de salida para archivos descargados (por defecto: configuración o ./databox)
fr: Répertoire de sortie pour les fichiers téléchargés (par défaut : configuration ou ./databox)
ru: Каталог для скачанных файлов (по умолчанию: из конфигурации или ./databox)

source: Document type filter (B=Bescheide, M=Mitteilungen, I=Info, P=Protokolle, empty=all)
de: Dokumenttyp-Filter (B=Bescheide, M=Mitteilungen, I=Info, P=Protokolle, leer=alle)
es: Filtro de tipo de documento (B=Resoluciones, M=Notificaciones, I=Info, P=Protocolos, vacío=todos)
fr: Filtre de type de document (B=Décisions, M=Notifications, I=Info, P=Protocoles, vide=tous)
ru: Фильтр типа документа (B=Решения, M=Уведомления, I=Инфо, P=Протоколы, пусто=все)

source: Number of days to look back (default: 31, max: 31)
de: Anzahl der Tage zurückschauen (Standard: 31, max: 31)
es: Número de días hacia atrás (por defecto: 31, máx: 31)
fr: Nombre de jours en arrière (par défaut : 31, max : 31)
ru: Количество дней назад (по умолчанию: 31, макс: 31)

source: Sync only unread documents (default)
de: Nur ungelesene Dokumente synchronisieren (Standard)
es: Sincronizar solo documentos no leídos (por defecto)
fr: Synchroniser uniquement les documents non lus (par défaut)
ru: Синхронизировать только непрочитанные документы (по умолчанию)

source: Sync only read documents
de: Nur gelesene Dokumente synchronisieren
es: Sincronizar solo documentos leídos
fr: Synchroniser uniquement les documents lus
ru: Синхронизировать только прочитанные документы

source: Sync all documents
de: Alle Dokumente synchronisieren
es: Sincronizar todos los documentos
fr: Synchroniser tous les documents
ru: Синхронизировать все документы

source: Skip files that already exist (default: skip)
de: Vorhandene Dateien überspringen (Standard: überspringen)
es: Omitir archivos que ya existen (por defecto: omitir)
fr: Ignorer les fichiers existants (par défaut : ignorer)
ru: Пропустить существующие файлы (по умолчанию: пропустить)

source: Disable email notification (default: email enabled)
de: E-Mail-Benachrichtigung deaktivieren (Standard: aktiviert)
es: Desactivar notificación por email (por defecto: activado)
fr: Désactiver la notification par email (par défaut : activé)
ru: Отключить уведомление по электронной почте (по умолчанию: включено)

source: Email recipient for sync summary (can specify multiple, uses config default if not specified)
de: E-Mail-Empfänger für Sync-Zusammenfassung (mehrfach möglich, Standard aus Konfiguration)
es: Destinatario de email para resumen de sincronización (puede especificar múltiples, usa configuración por defecto si no se especifica)
fr: Destinataire email pour le résumé de synchronisation (peut en spécifier plusieurs, utilise la configuration par défaut si non spécifié)
ru: Получатель email для сводки синхронизации (можно указать несколько, использует значение из конфигурации по умолчанию)

source: Email recipient for per-document notifications with attachments (can specify multiple)
de: E-Mail-Empfänger für Dokument-Benachrichtigungen mit Anhängen (mehrfach möglich)
es: Destinatario de email para notificaciones por documento con adjuntos (puede especificar múltiples)
fr: Destinataire email pour les notifications par document avec pièces jointes (peut en spécifier plusieurs)
ru: Получатель email для уведомлений по документам с вложениями (можно указать несколько)

source: This is an automated message from finanzonline-databox.
de: Dies ist eine automatische Nachricht von finanzonline-databox.
es: Este es un mensaje automático de finanzonline-databox.
fr: Ceci est un message automatique de finanzonline-databox.
ru: Это автоматическое сообщение от finanzonline-databox.

source: Diagnostic Information
de: Diagnoseinformationen
es: Información de Diagnóstico
fr: Informations de Diagnostic
ru: Диагностическая информация

source: SUCCESS
de: ERFOLG
es: ÉXITO
fr: SUCCÈS
ru: УСПЕХ

source: COMPLETED WITH ERRORS
de: MIT FEHLERN ABGESCHLOSSEN
es: COMPLETADO CON ERRORES
fr: TERMINÉ AVEC ERREURS
ru: ЗАВЕРШЕНО С ОШИБКАМИ

source: DataBox Sync Result
de: DataBox-Synchronisierungsergebnis
es: Resultado de Sincronización DataBox
fr: Résultat de Synchronisation DataBox
ru: Результат синхронизации DataBox

source: Status:
es: Estado:
fr: Statut :
ru: Статус:

source: Output Dir:
de: Ausgabeverz.:
es: Dir. Salida:
fr: Rép. Sortie :
ru: Каталог:

source: Timestamp:
de: Zeitstempel:
es: Fecha/Hora:
fr: Horodatage :
ru: Временная метка:

source: Statistics
de: Statistik
es: Estadísticas
fr: Statistiques
ru: Статистика

source: Retrieved:
fr: Récupérés :
ru: Получено:

source: After Filter:
fr: Après filtre :
ru: После фильтра:

source: Total Listed:
de: Gesamt gelistet:
es: Total Listados:
fr: Total Listés :
ru: Всего в списке:

source: Downloaded:
de: Heruntergeladen:
es: Descargados:
fr: Téléchargés :
ru: Скачано:

source: Skipped (exists):
fr: Ignorés (existants) :
ru: Пропущено (существует):

source: Skipped:
de: Übersprungen:
es: Omitidos:
fr: Ignorés :
ru: Пропущено:

source: Failed:
de: Fehlgeschlagen:
es: Fallidos:
fr: Échoués :
ru: Не удалось:

source: Total Size:
de: Gesamtgröße:
es: Tamaño Total:
fr: Taille Totale :
ru: Общий размер:

source: New documents have been downloaded to your DataBox folder.
de: Neue Dokumente wurden in Ihren DataBox-Ordner heruntergeladen.
es: Se han descargado nuevos documentos a su carpeta DataBox.
fr: De nouveaux documents ont été téléchargés dans votre dossier DataBox.
ru: Новые документы были скачаны в вашу папку DataBox.

source: WARNING: Some downloads failed. Please check the logs for details.
de: WARNUNG: Einige Downloads sind fehlgeschlagen. Bitte prüfen Sie die Logs für Details.
es: ADVERTENCIA: Algunas descargas fallaron. Por favor revise los logs para más detalles.
fr: ATTENTION : Certains téléchargements ont échoué. Veuillez consulter les logs pour plus de détails.
ru: ПРЕДУПРЕЖДЕНИЕ: Некоторые загрузки не удались. Пожалуйста, проверьте логи для подробностей.

source: DataBox ERROR Notification
de: DataBox-FEHLER-Benachrichtigung
es: Notificación de ERROR DataBox
fr: Notification d'ERREUR DataBox
ru: Уведомление об ОШИБКЕ DataBox

source: Operation:
es: Operación:
fr: Opération :
ru: Операция:

source: ERROR
de: FEHLER
fr: ERREUR
ru: ОШИБКА

source: Error Type:
de: Fehlertyp:
es: Tipo de Error:
fr: Type d'Erreur :
ru: Тип ошибки:

source: Message:
de: Meldung:
es: Mensaje:
ru: Сообщение:

source: Return Code:
de: Rückgabecode:
es: Código de Retorno:
fr: Code de Retour :
ru: Код возврата:

source: Retryable:
de: Wiederholbar:
es: Reintentable:
fr: Réessayable :
ru: Повторяемый:

source: Yes
de: Ja
es: Sí
fr: Oui
ru: Да

source: No
de: Nein
fr: Non
ru: Нет

source: This is an automated error notification from finanzonline-databox.
de: Dies ist eine automatische Fehlerbenachrichtigung von finanzonline-databox.
es: Esta es una notificación de error automática de finanzonline-databox.
fr: Ceci est une notification d'erreur automatique de finanzonline-databox.
ru: Это автоматическое уведомление об ошибке от finanzonline-databox.

source: Yes - try again later
de: Ja - später erneut versuchen
es: Sí - intente de nuevo más tarde
fr: Oui - réessayez plus tard
ru: Да - повторите попытку позже

source: DataBox Error
de: DataBox-Fehler
es: Error DataBox
fr: Erreur DataBox
ru: Ошибка DataBox

source: DataBox ERROR
de: DataBox-FEHLER
es: ERROR DataBox
fr: ERREUR DataBox
ru: ОШИБКА DataBox

source: FinanzOnline DataBox - Document Notification
de: FinanzOnline DataBox - Dokumentbenachrichtigung
es: FinanzOnline DataBox - Notificación de Documento
fr: FinanzOnline DataBox - Notification de Document
ru: FinanzOnline DataBox - Уведомление о документе

source: Document Details
de: Dokumentdetails
es: Detalles del Documento
fr: Détails du Document
ru: Детали документа

source: Type:
de: Typ:
es: Tipo:
ru: Тип:

source: Description:
de: Beschreibung:
es: Descripción:
ru: Описание:

source: Tax Number:
de: Steuernummer:
es: Número Fiscal:
fr: Numéro Fiscal :
ru: Налоговый номер:

source: Reference:
de: Referenz:
es: Referencia:
fr: Référence :
ru: Ссылка:

source: Period:
de: Zeitraum:
es: Período:
fr: Période :
ru: Период:

source: Document Date:
de: Dokumentdatum:
es: Fecha del Documento:
fr: Date du Document :
ru: Дата документа:

source: Delivered:
de: Zugestellt:
es: Entregado:
fr: Livré :
ru: Доставлено:

source: File Type:
de: Dateityp:
es: Tipo de Archivo:
fr: Type de Fichier :
ru: Тип файла:

source: The document is attached to this email.
de: Das Dokument ist dieser E-Mail angehängt.
es: El documento está adjunto a este correo.
fr: Le document est joint à cet email.
ru: Документ прикреплён к этому письму.

source: NEW
de: NEU
es: NUEVO
fr: NOUVEAU
ru: НОВЫЙ

source: read
de: gelesen
es: leído
fr: lu
ru: прочитан

source: No entries found
de: Keine Einträge gefunden
es: No se encontraron entradas
fr: Aucune entrée trouvée
ru: Записи не найдены

source: DataBox Entries
de: DataBox-Einträge
es: Entradas DataBox
fr: Entrées DataBox
ru: Записи DataBox

source: Total:
de: Gesamt:
ru: Всего:

source: unread
de: ungelesen
es: no leído
fr: non lu
ru: непрочитанных

source: New documents have been downloaded.
de: Neue Dokumente wurden heruntergeladen.
es: Se han descargado nuevos documentos.
fr: De nouveaux documents ont été téléchargés.
ru: Новые документы были скачаны.

source: WARNING: Some downloads failed. Check logs for details.
de: WARNUNG: Einige Downloads sind fehlgeschlagen. Prüfen Sie die Logs für Details.
es: ADVERTENCIA: Algunas descargas fallaron. Revise los logs para más detalles.
fr: ATTENTION : Certains téléchargements ont échoué. Consultez les logs pour plus de détails.
ru: ПРЕДУПРЕЖДЕНИЕ: Некоторые загрузки не удались. Проверьте логи для подробностей.

source: COMPLETED WITH WARNINGS
de: MIT WARNUNGEN ABGESCHLOSSEN
es: COMPLETADO CON ADVERTENCIAS
fr: TERMINÉ AVEC AVERTISSEMENTS
ru: ЗАВЕРШЕНО С ПРЕДУПРЕЖДЕНИЯМИ

source: Operation successful
de: Operation erfolgreich
es: Operación exitosa
fr: Opération réussie
ru: Операция успешна

source: Session invalid or expired
de: Sitzung ungültig oder abgelaufen
es: Sesión inválida o expirada
fr: Session invalide ou expirée
ru: Сессия недействительна или истекла

source: System maintenance
de: Systemwartung
es: Mantenimiento del sistema
fr: Maintenance système
ru: Техническое обслуживание системы

source: Technical error
de: Technischer Fehler
es: Error técnico
fr: Erreur technique
ru: Техническая ошибка

source: ts_zust_von and ts_zust_bis must both be specified
de: ts_zust_von und ts_zust_bis müssen beide angegeben werden
es: ts_zust_von y ts_zust_bis deben especificarse ambos
fr: ts_zust_von et ts_zust_bis doivent tous deux être spécifiés
ru: ts_zust_von и ts_zust_bis должны быть указаны оба

source: ts_zust_von must not be more than 31 days in the past
de: ts_zust_von darf nicht mehr als 31 Tage in der Vergangenheit liegen
es: ts_zust_von no puede ser más de 31 días en el pasado
fr: ts_zust_von ne doit pas être à plus de 31 jours dans le passé
ru: ts_zust_von не может быть более 31 дня в прошлом

source: ts_zust_bis must not be more than 7 days after ts_zust_von
de: ts_zust_bis darf nicht mehr als 7 Tage nach ts_zust_von liegen
es: ts_zust_bis no puede ser más de 7 días después de ts_zust_von
fr: ts_zust_bis ne doit pas être à plus de 7 jours après ts_zust_von
ru: ts_zust_bis не может быть более 7 дней после ts_zust_von

source: Unknown return code
de: Unbekannter Rückgabecode
es: Código de retorno desconocido
fr: Code de retour inconnu
ru: Неизвестный код возврата

source: Permission denied: Cannot {operation} '{path}'
de: Zugriff verweigert: Kann {operation} '{path}' nicht ausführen
es: Permiso denegado: No se puede {operation} '{path}'
fr: Permission refusée: Impossible de {operation} '{path}'
ru: Доступ запрещён: Невозможно {operation} '{path}'

source: Disk full: Cannot {operation} '{path}'
de: Festplatte voll: Kann {operation} '{path}' nicht ausführen
es: Disco lleno: No se puede {operation} '{path}'
fr: Disque plein: Impossible de {operation} '{path}'
ru: Диск переполнен: Невозможно {operation} '{path}'

source: Read-only filesystem: Cannot {operation} '{path}'
de: Schreibgeschütztes Dateisystem: Kann {operation} '{path}' nicht ausführen
es: Sistema de archivos de solo lectura: No se puede {operation} '{path}'
fr: Système de fichiers en lecture seule: Impossible de {operation} '{path}'
ru: Файловая система только для чтения: Невозможно {operation} '{path}'

source: Path too long: '{path}'
de: Pfad zu lang: '{path}'
es: Ruta demasiado larga: '{path}'
fr: Chemin trop long: '{path}'
ru: Путь слишком длинный: '{path}'

source: Directory does not exist: '{path}'
de: Verzeichnis existiert nicht: '{path}'
es: El directorio no existe: '{path}'
fr: Le répertoire n'existe pas: '{path}'
ru: Каталог не существует: '{path}'

source: Not a directory: '{path}'
de: Kein Verzeichnis: '{path}'
es: No es un directorio: '{path}'
fr: Ce n'est pas un répertoire: '{path}'
ru: Не является каталогом: '{path}'

source: Filesystem error ({operation}): {error}
de: Dateisystemfehler ({operation}): {error}
es: Error del sistema de archivos ({operation}): {error}
fr: Erreur système de fichiers ({operation}): {error}
ru: Ошибка файловой системы ({operation}): {error}

source: unknown
de: unbekannt
es: desconocido
fr: inconnu
ru: неизвестно

source: Configuration Error
de: Konfigurationsfehler
es: Error de configuración
fr: Erreur de configuration
ru: Ошибка конфигурации

source: Authentication Error
de: Authentifizierungsfehler
es: Error de autenticación
fr: Erreur d'authentification
ru: Ошибка аутентификации

source: Session Error
de: Sitzungsfehler
es: Error de sesión
fr: Erreur de session
ru: Ошибка сессии

source: DataBox Operation Error
de: DataBox-Betriebsfehler
es: Error de operación de DataBox
fr: Erreur d'opération DataBox
ru: Ошибка операции DataBox

source: Filesystem Error
de: Dateisystemfehler
es: Error del sistema de archivos
fr: Erreur système de fichiers
ru: Ошибка файловой системы
