Repository: pypi-data/pypi-mirror-404
Catalog: packages/finanzonline-uid/finanzonline_uid-2.5.6-py3-none-any.whl/finanzonline_uid/locales/*/LC_MESSAGES/messages.po
Languages: de, ru

source: UID is valid
de: UID ist gültig
ru: UID действителен

source: UID is invalid
de: UID ist ungültig
ru: UID недействителен

source: Session invalid or expired
de: Sitzung ungültig oder abgelaufen
ru: Сессия недействительна или истекла

source: System maintenance
de: Systemwartung
ru: Техническое обслуживание системы

source: Technical error
de: Technischer Fehler
ru: Техническая ошибка

source: The access codes are not valid
de: Die Zugangscodes sind nicht gültig
ru: Коды доступа недействительны

source: User locked due to incorrect login attempts
de: Benutzer wegen falscher Anmeldeversuche gesperrt
ru: Пользователь заблокирован из-за неправильных попыток входа

source: User is locked
de: Benutzer ist gesperrt
ru: Пользователь заблокирован

source: User is not a web service user
de: Benutzer ist kein Webservice-Benutzer
ru: Пользователь не является пользователем веб-сервиса

source: Participant locked or not authorized for web service
de: Teilnehmer gesperrt oder nicht für Webservice autorisiert
ru: Участник заблокирован или не авторизован для веб-сервиса

source: Wrong UID format
de: Falsches UID-Format
ru: Неправильный формат UID

source: Invalid requester UID
de: Ungültige Anfragesteller-UID
ru: Недействительный UID запрашивающего

source: Member state forbids query
de: Mitgliedstaat verbietet Abfrage
ru: Государство-член запрещает запрос

source: Not authorized for requester UID
de: Nicht autorisiert für Anfragesteller-UID
ru: Не авторизован для UID запрашивающего

source: UID not yet queryable
de: UID noch nicht abfragbar
ru: UID ещё не доступен для запроса

source: UID doesn't start with ATU
de: UID beginnt nicht mit ATU
ru: UID не начинается с ATU

source: VAT group (CZ) - special handling required
de: Umsatzsteuergruppe (CZ) - Sonderbehandlung erforderlich
ru: Группа НДС (CZ) - требуется специальная обработка

source: VAT group (SK) - special handling required
de: Umsatzsteuergruppe (SK) - Sonderbehandlung erforderlich
ru: Группа НДС (SK) - требуется специальная обработка

source: Must query via FinanzOnline portal directly
de: Muss direkt über FinanzOnline-Portal abgefragt werden
ru: Необходимо запрашивать напрямую через портал FinanzOnline

source: Service unavailable
de: Dienst nicht verfügbar
ru: Сервис недоступен

source: Too many queries (server load)
de: Zu viele Anfragen (Serverauslastung)
ru: Слишком много запросов (нагрузка сервера)

source: Rate limit: 2 queries per UID per day exceeded
de: Ratenlimit: 2 Abfragen pro UID pro Tag überschritten
ru: Лимит: превышено 2 запроса на UID в день

source: Rate limit: requester limit exceeded
de: Ratenlimit: Anfragesteller-Limit überschritten
ru: Лимит: превышен лимит запрашивающего

source: Unknown return code
de: Unbekannter Rückgabecode
ru: Неизвестный код возврата

source: VALID
de: GÜLTIG
ru: ДЕЙСТВИТЕЛЕН

source: INVALID
de: UNGÜLTIG
ru: НЕДЕЙСТВИТЕЛЕН

source: UNAVAILABLE
de: NICHT VERFÜGBAR
ru: НЕДОСТУПЕН

source: RATE LIMITED
de: RATENLIMIT
ru: ЛИМИТ ЗАПРОСОВ

source: ERROR
de: FEHLER
ru: ОШИБКА

source: Valid
de: Gültig
ru: Действителен

source: Invalid
de: Ungültig
ru: Недействителен

source: Service Unavailable
de: Dienst nicht verfügbar
ru: Сервис недоступен

source: Rate Limited
de: Ratenlimit erreicht
ru: Лимит запросов достигнут

source: UID Check Result
de: UID-Prüfungsergebnis
ru: Результат проверки UID

source: Company Information
de: Firmeninformationen
ru: Информация о компании

source: Name:
ru: Название:

source: Address:
de: Adresse:
ru: Адрес:

source: Status:
ru: Статус:

source: Return Code:
de: Rückgabecode:
ru: Код возврата:

source: Message:
de: Meldung:
ru: Сообщение:

source: Severity:
de: Schweregrad:
ru: Серьёзность:

source: Retryable:
de: Wiederholbar:
ru: Повторяемый:

source: Timestamp:
de: Zeitstempel:
ru: Временная метка:

source: Yes
de: Ja
ru: Да

source: No
de: Nein
ru: Нет

source: This is an automated message from finanzonline-uid.
de: Dies ist eine automatische Nachricht von finanzonline-uid.
ru: Это автоматическое сообщение от finanzonline-uid.

source: UID Verification Result (Stufe 2)
de: UID-Verifizierungsergebnis (Stufe 2)
ru: Результат проверки UID (Уровень 2)

source: Query Level: Stufe 2 (with name/address verification)
de: Abfragestufe: Stufe 2 (mit Name/Adresse-Verifizierung)
ru: Уровень запроса: Уровень 2 (с проверкой имени/адреса)

source: Stufe 2 (with name/address verification)
de: Stufe 2 (mit Name/Adresse-Verifizierung)
ru: Уровень 2 (с проверкой имени/адреса)

source: Query Level:
de: Abfragestufe:
ru: Уровень запроса:

source: Cached Result
de: Zwischengespeichertes Ergebnis
ru: Кэшированный результат

source: This result was retrieved from cache.
de: Dieses Ergebnis wurde aus dem Cache abgerufen.
ru: Этот результат был получен из кэша.

source: Originally queried:
de: Ursprünglich abgefragt:
ru: Первоначально запрошено:

source: NOTE: This is a CACHED result
de: HINWEIS: Dies ist ein ZWISCHENGESPEICHERTES Ergebnis
ru: ПРИМЕЧАНИЕ: Это КЭШИРОВАННЫЙ результат

source: UID Check ERROR Notification
de: UID-Prüfung FEHLER-Benachrichtigung
ru: Уведомление об ОШИБКЕ проверки UID

source: Error Type:
de: Fehlertyp:
ru: Тип ошибки:

source: Meaning:
de: Bedeutung:
ru: Значение:

source: Diagnostic Information
de: Diagnoseinformationen
ru: Диагностическая информация

source: This is an automated error notification from finanzonline-uid.
de: Dies ist eine automatische Fehlerbenachrichtigung von finanzonline-uid.
ru: Это автоматическое уведомление об ошибке от finanzonline-uid.

source: UID Check Error
de: UID-Prüfungsfehler
ru: Ошибка проверки UID

source: UID Check ERROR
de: UID-Prüfung FEHLER
ru: ОШИБКА проверки UID

source: Yes - try again later
de: Ja - später erneut versuchen
ru: Да - повторите попытку позже

source: UID Check Austria - Rate Limit Warning
de: UID Check Austria - Ratenlimit-Warnung
ru: UID Check Austria - Предупреждение о лимите запросов

source: WARNING: Your query rate has exceeded the configured limit.
de: WARNUNG: Ihre Abfragerate hat das konfigurierte Limit überschritten.
ru: ПРЕДУПРЕЖДЕНИЕ: Ваша частота запросов превысила настроенный лимит.

source: Current Status
de: Aktueller Status
ru: Текущий статус

source: Queries in window:
de: Abfragen im Zeitfenster:
ru: Запросов в окне:

source: Maximum allowed:
de: Maximal erlaubt:
ru: Максимум разрешено:

source: Window duration:
de: Zeitfensterdauer:
ru: Длительность окна:

source: hours
de: Stunden
ru: часов

source: Fair Use Policy Notice
de: Hinweis zur Fair-Use-Richtlinie
ru: Уведомление о политике добросовестного использования

source: "UID verifications should only be requested at the time when intra-Community tax-exempt supplies or other services are provided to customers in other EU member states - not in advance or in bulk."
de: "UID-Verifizierungen sollten nur zum Zeitpunkt der innergemeinschaftlichen steuerfreien Lieferungen oder sonstigen Leistungen an Kunden in anderen EU-Mitgliedstaaten angefordert werden - nicht im Voraus oder in großen Mengen."
ru: "Проверки UID следует запрашивать только в момент, когда внутриобщинные освобождённые от налогов поставки или другие услуги предоставляются клиентам в других государствах-членах ЕС - не заранее и не массово."

source: Important
de: Wichtig
ru: Важно

source: You are probably not using this program in the right way.
de: Sie verwenden dieses Programm wahrscheinlich nicht richtig.
ru: Вероятно, вы используете эту программу неправильно.

source: UID queries should be made at the time of transaction, not:
de: UID-Abfragen sollten zum Zeitpunkt der Transaktion erfolgen, nicht:
ru: Запросы UID должны выполняться в момент транзакции, а не:

source: In advance for potential future transactions
de: Im Voraus für mögliche zukünftige Transaktionen
ru: Заранее для возможных будущих транзакций

source: In bulk for database validation
de: In großen Mengen zur Datenbankvalidierung
ru: Массово для проверки базы данных

source: For speculative or exploratory purposes
de: Für spekulative oder explorative Zwecke
ru: Для спекулятивных или исследовательских целей

source: This warning is logged locally. The actual BMF service may enforce its own rate limits independently.
de: Diese Warnung wird lokal protokolliert. Der eigentliche BMF-Dienst kann seine eigenen Ratenlimits unabhängig durchsetzen.
ru: Это предупреждение регистрируется локально. Фактический сервис BMF может применять свои собственные лимиты независимо.

source: This is an automated warning from finanzonline-uid.
de: Dies ist eine automatische Warnung von finanzonline-uid.
ru: Это автоматическое предупреждение от finanzonline-uid.

source: Rate Limit Exceeded
de: Ratenlimit überschritten
ru: Лимит запросов превышен

source: Your query rate has exceeded the configured limit.
de: Ihre Abfragerate hat das konfigurierte Limit überschritten.
ru: Ваша частота запросов превысила настроенный лимит.

source: UID Check Rate Limit Warning
de: UID-Prüfung Ratenlimit-Warnung
ru: Предупреждение о лимите запросов UID Check

source: Rate Limit Warning
de: Ratenlimit-Warnung
ru: Предупреждение о лимите запросов

source: Show full Python traceback on errors
de: Vollständige Python-Fehlerrückverfolgung bei Fehlern anzeigen
ru: Показывать полную трассировку Python при ошибках

source: Load configuration from a named profile (e.g., 'production', 'test')
de: Konfiguration aus einem benannten Profil laden (z.B. 'production', 'test')
ru: Загрузить конфигурацию из именованного профиля (напр., 'production', 'test')

source: Output format (human-readable or JSON)
de: Ausgabeformat (menschenlesbar oder JSON)
ru: Формат вывода (читаемый или JSON)

source: Show only a specific configuration section (e.g., 'lib_log_rich')
de: Nur einen bestimmten Konfigurationsabschnitt anzeigen (z.B. 'lib_log_rich')
ru: Показать только определённый раздел конфигурации (напр., 'lib_log_rich')

source: Override profile from root command (e.g., 'production', 'test')
de: Profil vom Hauptbefehl überschreiben (z.B. 'production', 'test')
ru: Переопределить профиль из корневой команды (напр., 'production', 'test')

source: Target configuration layer(s) to deploy to (can specify multiple)
de: Ziel-Konfigurationsebene(n) für Bereitstellung (mehrfach möglich)
ru: Целевой уровень(и) конфигурации для развёртывания (можно указать несколько)

source: Overwrite existing configuration files
de: Vorhandene Konfigurationsdateien überschreiben
ru: Перезаписать существующие файлы конфигурации

source: Interactive mode: prompt for UID to check
de: Interaktiver Modus: UID zur Prüfung eingeben
ru: Интерактивный режим: запросить UID для проверки

source: Disable email notification (default: email enabled)
de: E-Mail-Benachrichtigung deaktivieren (Standard: aktiviert)
ru: Отключить уведомление по электронной почте (по умолчанию: включено)

source: Output format (default: human)
de: Ausgabeformat (Standard: menschenlesbar)
ru: Формат вывода (по умолчанию: читаемый)

source: Email recipient (can specify multiple, uses config default if not specified)
de: E-Mail-Empfänger (mehrfach möglich, Standard aus Konfiguration)
ru: Получатель электронной почты (можно указать несколько, использует значение по умолчанию)

source: profile
de: Profil
ru: профиль

source: Configuration deployed successfully
de: Konfiguration erfolgreich bereitgestellt
ru: Конфигурация успешно развёрнута

source: No files were created (all target files already exist).
de: Keine Dateien erstellt (alle Zieldateien existieren bereits).
ru: Файлы не созданы (все целевые файлы уже существуют).

source: All configuration files are already up to date (content unchanged).
de: Alle Konfigurationsdateien sind bereits aktuell (Inhalt unverändert).
ru: Все конфигурационные файлы уже актуальны (содержимое не изменилось).

source: Use --force to overwrite existing configuration files.
de: Verwenden Sie --force um vorhandene Konfigurationsdateien zu überschreiben.
ru: Используйте --force для перезаписи существующих файлов конфигурации.

source: Error
de: Fehler
ru: Ошибка

source: Permission denied.
de: Zugriff verweigert.
ru: Доступ запрещён.

source: Hint: System-wide deployment (--target app/host) may require sudo.
de: Hinweis: Systemweite Bereitstellung (--target app/host) erfordert möglicherweise sudo.
ru: Подсказка: Системное развёртывание (--target app/host) может потребовать sudo.

source: Failed to deploy configuration:
de: Konfigurationsbereitstellung fehlgeschlagen:
ru: Не удалось развернуть конфигурацию:

source: Enter EU VAT ID to verify
de: EU-Umsatzsteuer-ID zur Prüfung eingeben
ru: Введите ID НДС ЕС для проверки

source: Error: UID argument is required (or use --interactive)
de: Fehler: UID-Argument erforderlich (oder --interactive verwenden)
ru: Ошибка: Требуется аргумент UID (или используйте --interactive)

source: Return code:
de: Rückgabecode:
ru: Код возврата:

source: This error may be temporary. Try again later.
de: Dieser Fehler ist möglicherweise vorübergehend. Versuchen Sie es später erneut.
ru: Эта ошибка может быть временной. Повторите попытку позже.

source: Configure FinanzOnline credentials in your config file or via environment variables:
de: Konfigurieren Sie FinanzOnline-Zugangsdaten in Ihrer Konfigurationsdatei oder über Umgebungsvariablen:
ru: Настройте учётные данные FinanzOnline в файле конфигурации или через переменные окружения:

source: 8-12 alphanumeric
de: 8-12 alphanumerisch
ru: 8-12 буквенно-цифровых

source: 5-12 chars
de: 5-12 Zeichen
ru: 5-12 символов

source: 5-128 chars
de: 5-128 Zeichen
ru: 5-128 символов

source: 10-24 alphanumeric
de: 10-24 alphanumerisch
ru: 10-24 буквенно-цифровых

source: Retry interval in minutes until check succeeds or canceled (interactive mode only)
de: Wiederholungsintervall in Minuten bis Prüfung erfolgreich oder abgebrochen (nur interaktiver Modus)
ru: Интервал повтора в минутах до успешной проверки или отмены (только интерактивный режим)

source: Error: --retryminutes requires --interactive mode
de: Fehler: --retryminutes erfordert --interactive Modus
ru: Ошибка: --retryminutes требует режим --interactive

source: Checking
de: Prüfe
ru: Проверка

source: Next attempt in
de: Nächster Versuch in
ru: Следующая попытка через

source: Attempts so far
de: Bisherige Versuche
ru: Попыток выполнено

source: Retry Mode
de: Wiederholungsmodus
ru: Режим повтора

source: Attempt
de: Versuch
ru: Попытка

source: Cancelled by user after
de: Abgebrochen durch Benutzer nach
ru: Отменено пользователем после

source: attempt(s)
de: Versuch(en)
ru: попыток

source: Check cancelled by user
de: Prüfung durch Benutzer abgebrochen
ru: Проверка отменена пользователем

source: Warning: Email notification failed: {error}
de: Warnung: E-Mail-Benachrichtigung fehlgeschlagen: {error}
ru: Предупреждение: Ошибка отправки email-уведомления: {error}

source: Warning: Error notification failed: {error}
de: Warnung: Fehlerbenachrichtigung fehlgeschlagen: {error}
ru: Предупреждение: Ошибка отправки уведомления об ошибке: {error}

source: Directory to save valid UID results as files (overrides config)
de: Verzeichnis zum Speichern gültiger UID-Ergebnisse als Dateien (überschreibt Konfiguration)
ru: Каталог для сохранения валидных результатов UID в файлы (переопределяет конфигурацию)

source: Output file format: json, txt, or html (default: html)
de: Ausgabedateiformat: json, txt oder html (Standard: html)
ru: Формат файла вывода: json, txt или html (по умолчанию: html)

source: Result saved to: {filepath}
de: Ergebnis gespeichert in: {filepath}
ru: Результат сохранён в: {filepath}

source: Warning: Could not save result to {filepath}: {error}
de: Warnung: Ergebnis konnte nicht in {filepath} gespeichert werden: {error}
ru: Предупреждение: Не удалось сохранить результат в {filepath}: {error}
