Repository: pypi-data/pypi-mirror-404
Catalog: packages/sigima/sigima-1.0.6.tar.gz/sigima-1.0.6/doc/locale/*/LC_MESSAGES/auto_examples/use_cases/blob_detection.po
Languages: fr

source: :ref:`Go to the end <sphx_glr_download_auto_examples_use_cases_blob_detection.py>` to download the full example code.
fr: :ref:`Aller à la fin <sphx_glr_download_auto_examples_use_cases_blob_detection.py>` pour télécharger le code complet de l'exemple.

source: Blob Detection
fr: Détection de taches

source: This example demonstrates blob detection techniques available in Sigima for analyzing circular or blob-like features in images. It shows how to generate apply preprocessing filters and detect blobs using OpenCV-based algorithms with fine-tuned parameters for optimal results.
fr: Cet exemple illustre les techniques de détection de taches disponibles dans Sigima pour analyser des structures circulaires ou en amas dans des images. Il montre comment générer des filtres de prétraitement et détecter des taches à l'aide d'algorithmes basés sur OpenCV, avec des paramètres ajustés pour obtenir des résultats optimaux.

source: The script demonstrates image processing workflows commonly used in microscopy, particle analysis, and feature detection applications.
fr: Le script présente des chaînes de traitement d'image couramment utilisées en microscopie, en analyse de particules et dans les applications de détection de caractéristiques.

source: Importing necessary modules
fr: On importe les modules nécessaires

source: We start by importing all the required modules for image processing and visualization. To run this example, ensure you have all the required dependencies installed.
fr: On commence par importer tous les modules nécessaires au traitement d'image et à la visualisation. Pour exécuter cet exemple, on vérifie que l'ensemble des dépendances requises est installé.

source: Generate synthetic test image with known blobs
fr: Générer une image de test synthétique avec des taches connues

source: We create a synthetic image with a noisy background and several circular blobs of varying sizes and intensities. This allows us to validate the blob detection algorithms effectively. To perform this task, we use a function: the detailes of this is out of the scope of this tutorial: once you have learned how to use Sigima, you will be able to use the library on your own data.
fr: On crée une image synthétique avec un bruit de fond et plusieurs taches circulaires de tailles et d'intensités variées. Cette configuration permet de valider efficacement les algorithmes de détection de taches. Pour réaliser cette tâche, on utilise une fonction dédiée dont les détails dépassent le cadre de ce tutoriel ; une fois que vous maîtriserez Sigima, vous pourrez appliquer la bibliothèque à vos propres données.

source: Visualize the original image
fr: Visualiser l'image originale

source: We visualize the original synthetic image to understand its characteristics before applying any processing or blob detection. This can be done with your preferred image viewer (i.e. plotpy, matplotlib, ...). The preference of Sigima developers is on plotpy, a library developed with performance in mind.
fr: On visualise l'image synthétique originale pour en apprécier les caractéristiques avant tout traitement ou détection de blobs. On peut utiliser la visionneuse d'images de son choix (par exemple plotpy, matplotlib, ...). Les développeurs de Sigima privilégient plotpy, une bibliothèque conçue pour la performance.

source: We wrapped a simple function to do perform visualizations tasks required for this and other tutorials, to help reducing the impact of GUI code in documentation and let you concentrate in the analysis
fr: On a encapsulé une fonction simple pour réaliser les visualisations nécessaires à ce tutoriel et aux autres, afin de limiter l'impact du code lié à l'interface graphique dans la documentation et de vous laisser vous concentrer sur l'analyse.

source: Image preprocessing - Binning
fr: Prétraitement d'image - binning

source: Looking to our image, we can see that the blobs we look for are large respect to the pixel size. A binning process can help to reduce the importance of the noise.
fr: Observez l'image : les taches recherchées sont grandes par rapport à la taille des pixels. Un binning aide à réduire l'importance du bruit.

source: Additional preprocessing - Moving median filter
fr: Prétraitement supplémentaire - filtre médian glissant

source: The result of the binning is good, but we can imagine to not be happy with that. A different approach we can take is to apply a moving median filter, to reduce the importance of the spikes. We do it with a window of 5, of curse in practice different window sizes can be tested to find the good compromise between noise reduction and resolution. Lets see how to do that.
fr: Le résultat du binning est satisfaisant, mais il est possible de vouloir aller plus loin. On applique alors un filtre médian glissant pour atténuer les pics. On utilise ici une fenêtre de 5 ; en pratique, on teste différentes tailles de fenêtre pour trouver le bon compromis entre réduction du bruit et résolution. Voyons comment procéder.

source: Configure blob detection parameters
fr: Configurer les paramètres de détection de taches

source: We are happy with the filtered image, we can now proceed to the blob detection. First of all we need to configure the parameters of the detection algorithm: this is very important to get good results. In this example, you find an overview of the parameters that can be tuned.
fr: On valide l'image filtrée et on passe à la détection de taches. On commence par configurer les paramètres de l'algorithme de détection, étape essentielle pour obtenir de bons résultats. Cet exemple offre une vue d'ensemble des paramètres ajustables.

source: Create blob detection parameter object:
fr: Créer l'objet de paramètres de détection de taches :

source: Threshold parameters for blob detection:
fr: Paramètres de seuil pour la détection de taches :

source: Minimum repeatability (how many times a blob center is detected):
fr: Répétabilité minimale (nombre de fois où le centre d'une tache est détecté) :

source: Color filtering (not used for grayscale):
fr: Filtrage sur la couleur (non utilisé en niveaux de gris) :

source: Area filtering to select appropriate blob sizes:
fr: Filtrage sur la surface pour sélectionner les tailles de taches adaptées :

source: Circularity filtering to prefer round objects:
fr: Filtrage sur la circularité pour privilégier les objets ronds :

source: Disable inertia and convexity filtering for this example:
fr: Désactiver le filtrage sur l'inertie et la convexité pour cet exemple :

source: We finally print configured parameters:
fr: On affiche enfin les paramètres configurés :

source: Perform blob detection
fr: Exécuter la détection de taches

source: We can now perform the blob detection on the preprocessed image using the configured parameters.
fr: On peut maintenant lancer la détection de taches sur l'image prétraitée avec les paramètres configurés.

source: We print the detected blobs and their properties:
fr: On affiche les taches détectées et leurs propriétés :

source: :download:`Download Jupyter notebook: blob_detection.ipynb <blob_detection.ipynb>`
fr: :download:`Télécharger le notebook Jupyter : blob_detection.ipynb <blob_detection.ipynb>`

source: :download:`Download Python source code: blob_detection.py <blob_detection.py>`
fr: :download:`Télécharger le code source Python : blob_detection.py <blob_detection.py>`

source: :download:`Download zipped: blob_detection.zip <blob_detection.zip>`
fr: :download:`Télécharger l'archive : blob_detection.zip <blob_detection.zip>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
fr: `Galerie générée par Sphinx-Gallery <https://sphinx-gallery.github.io>`_
