Repository: pypi-data/pypi-mirror-404
Catalog: packages/sigima/sigima-1.0.6.tar.gz/sigima-1.0.6/doc/locale/*/LC_MESSAGES/auto_examples/use_cases/fabry_perot.po
Languages: fr

source: :ref:`Go to the end <sphx_glr_download_auto_examples_use_cases_fabry_perot.py>` to download the full example code.
fr: :ref:`Aller à la fin <sphx_glr_download_auto_examples_use_cases_fabry_perot.py>` pour télécharger le code complet de l'exemple.

source: Fabry-Perot Interference Pattern
fr: Franges d'interférence de Fabry-Perot

source: This example demonstrates image processing techniques for analyzing Fabry-Perot interference patterns. It shows how to load experimental images, define regions of interest, detect circular contours, and extract intensity profiles for quantitative analysis of interference fringes.
fr: Ce tutoriel présente des techniques de traitement d'image pour analyser les franges d'interférence de Fabry-Perot. On y montre comment charger des images expérimentales, définir des régions d'intérêt, détecter des contours circulaires et extraire des profils d'intensité pour analyser quantitativement les franges.

source: Usage:
fr: Utilisation :

source: The script demonstrates optical analysis workflows commonly used in interferometry, optical metrology, and precision measurements.
fr: Ce script illustre des flux d'analyse optique couramment utilisés en interférométrie, en métrologie optique et en mesures de précision.

source: Importing necessary modules
fr: Importer les modules nécessaires

source: We start by importing all the required modules for image processing and visualization. To run this example, ensure you have all the required dependencies installed.
fr: On commence par importer tous les modules nécessaires au traitement d'image et à la visualisation. Pour exécuter cet exemple, assurez-vous que toutes les dépendances requises sont installées.

source: Load Fabry-Perot test images
fr: Charger les images d'essai Fabry-Perot

source: We load two sample image of Fabry-Perot interference patterns. These imags is included in the Sigima test data. We will analyze the interference fringes present in these images.
fr: On charge deux images d'exemple de franges d'interférence de Fabry-Perot. Elles sont fournies avec les données de test de Sigima. On analysera les franges d'interférence présentes dans ces images.

source: Define circular ROI for fringe analysis
fr: Définir une ROI circulaire pour l'analyse des franges

source: We define a circular region of interest (ROI) centered on the image to focus our analysis on the central interference fringes.
fr: On définit une région d'intérêt (ROI) circulaire centrée sur l'image pour concentrer l'analyse sur les franges d'interférence centrales.

source: Configure contour detection for circular fringes
fr: Configurer la détection de contours circulaires

source: We can now detect circular contours in the defined ROI. This will help us identify the interference rings. To perform this, the first step is to set up the contour detection parameter.
fr: On peut maintenant détecter des contours circulaires dans la ROI définie. Cela permet d'identifier les anneaux d'interférence. Pour ce faire, la première étape consiste à paramétrer la détection de contours.

source: We can now perform the contour detection on the image using the configured parameters.
fr: On peut ensuite exécuter la détection de contours sur l'image à l'aide des paramètres définis.

source: We can now print the detected circular contours and their properties
fr: On peut afficher les contours circulaires détectés ainsi que leurs propriétés

source: Extract horizontal intensity profile
fr: Extraire le profil d'intensité horizontal

source: We can extract an intensity profile along a horizontal line through the center of the image. This profile will show the intensity variations across the interference fringes. As before, we need to set up the line profile extraction parameter.
fr: On peut extraire un profil d'intensité le long d'une ligne horizontale passant par le centre de l'image. Ce profil met en évidence les variations d'intensité au travers des franges d'interférence. Comme précédemment, il faut paramétrer l'extraction du profil linéaire.

source: Load the second Fabry-Perot image
fr: Charger la deuxième image Fabry-Perot

source: We want now to load the Analyze second Fabry-Perot image
fr: On souhaite maintenant charger et analyser la deuxième image Fabry-Perot

source: Contour detection on second image
fr: Détecter les contours sur la deuxième image

source: To perform the contour detection on the second image, we can reuse the same contour detection parameters defined earlier. This technique, applied to multiple images, allow to perform the same analysis on each of them and make comparisons easier.
fr: Pour effectuer la détection des contours sur la deuxième image, on peut réutiliser les mêmes paramètres de détection définis précédemment. Cette technique, appliquée à plusieurs images, permet de répéter la même analyse et de faciliter les comparaisons.

source: Extract profile from second image and compare both profiles
fr: Extraire le profil de la deuxième image et comparer les deux profils

source: We can extract the horizontal intensity profile from the second image using the same profile extraction parameters defined earlier.
fr: On peut extraire le profil d'intensité horizontal de la deuxième image en réutilisant les paramètres d'extraction définis précédemment.

source: :download:`Download Jupyter notebook: fabry_perot.ipynb <fabry_perot.ipynb>`
fr: :download:`Télécharger le notebook Jupyter : fabry_perot.ipynb <fabry_perot.ipynb>`

source: :download:`Download Python source code: fabry_perot.py <fabry_perot.py>`
fr: :download:`Télécharger le code source Python : fabry_perot.py <fabry_perot.py>`

source: :download:`Download zipped: fabry_perot.zip <fabry_perot.zip>`
fr: :download:`Télécharger l'archive zip : fabry_perot.zip <fabry_perot.zip>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
fr: `Galerie générée par Sphinx-Gallery <https://sphinx-gallery.github.io>`_
