Repository: pypi-data/pypi-mirror-404
Catalog: packages/papersize/papersize-1.7.0-py3-none-any.whl/papersize/translations/*/LC_MESSAGES/papersize.po
Languages: fr

source: point (desktop publishing point: 1/72 inch, or about 0.353mm)
fr: point (anglo-saxon : 1/72ᵉ de pouce, soit 0,351mm environ)

source: millimeter
fr: millimètre

source: centimeter
fr: centimètre

source: inch (exactly 25.4 mm)
fr: pouce (exactement 25,4mm)

source: big point (25.4/72 mm)
fr: gros point (25,4/72 mm)

source: pica (12 points, or 1/6 inch)
fr: pica (12 points, ou 1/6ᵉ de pouce)

source: Didot point (1238 pt = 1157 dd)
fr: Point Didot (1238 pt = 1157 dd)

source: cicero (12 Didot points)
fr: cicéro (12 points Didot)

source: new Didot (3/8 mm)
fr: point Didot (selon l'ISO, appelé nouveau point Didot dans le code source de LateX ; 0,375 mm)

source: new cicero (12 new Didot points)
fr: nouveau cicéro (12 nouveaux points Didot selon le code source de LaTeX)

source: scaled point (1/2^16 pt)
fr: scaled point (1/2^16 pt selon LaTeX)

source: 168.2cm x 237.8cm (ISO 216, four times an A0)
fr: 168,2cm x 237,8cm (ISO 216, quatre fois A0)

source: 118.9cm x 168.2cm (ISO 216, twice an A0)
fr: 118,9cm x 168,2cm (ISO 216, deux A0)

source: 84.1cm x 1189cm (ISO 216, has an aspect ratio of √2, and an area of 1 m²)
fr: 84,1cm x 1189cm (ISO 216, format avec une aire d'un mètre carré, et une proportion de √2

source: 59.4cm x 84.1cm (ISO 216, half an A0)
fr: 59,4 x 84,1 cm (ISO 216, moitié d'un A0)

source: 42cm x 59.4cm (ISO 216, half an A1)
fr: 42cm x 59,4cm (ISO 216, moitié d'un A1)

source: 29.7cm x 42cm (ISO 216, half an A2)
fr: 29,7cm x 42cm (ISO 216, moitié d'un A2)

source: 21cm x 29.1cm (ISO 216, half an A3)
fr: 21cm x 29,1cm (ISO 216, moitié d'un A3)

source: 14.8cm x 21cm (ISO 216, half an A4)
fr: 14,8cm x 21cm (ISO 216, moitié d'un A4)

source: 10.5cm x 14.8cm (ISO 216, half an A5)
fr: 10,5cm x 14,8cm (ISO 216, moitié d'un A5)

source: 7.4cm x 10.5cm (ISO 216, half an A6)
fr: 7,4cm x 10,5cm (ISO 216, moitié d'un A6)

source: 5.2cm x 7.4cm (ISO 216, half an A7)
fr: 5,2cm x 7,4cm (ISO 216, moitié d'un A7)

source: 3.7cm x 5.2cm (ISO 216, half an A8)
fr: 3,7cm x 5,2cm (ISO 216, moitié d'un A8)

source: 2.6cm x 3.7cm (ISO 216, half an A9)
fr: 2,6cm x 3,7cm (ISO 216, moitié d'un A9)

source: 70.7cm x 100cm (ISO 216, half a B0)
fr: 70,7cm x 100cm (ISO 216, moitié d'un B0)

source: 50cm x 70.7cm (ISO 216, half a B1)
fr: 50cm x 70,7cm (ISO 216, moitié d'un B1)

source: 35.3cm x 50cm (ISO 216, half a B2)
fr: 35,3cm x 50cm (ISO 216, moitié d'un B2)

source: 25cm x 35.2cm (ISO 216, half a B3)
fr: 25cm x 35,2cm (ISO 216, moitié d'un B3)

source: 17.6cm x 25cm (ISO 216, half a B4)
fr: 17,6cm x 25cm (ISO 216, moitié d'un B4)

source: 12.5cm x 17.6cm (ISO 216, half a B5)
fr: 12,5cm x 17,6cm (ISO 216, moitié d'un B5)

source: 8.8cm x 12.5cm (ISO 216, half a B6)
fr: 8,8cm x 12,5cm (ISO 216, moitié d'un B6)

source: 6.2cm x 8.8cm (ISO 216, half a B7)
fr: 6,2cm x 8,8cm (ISO 216, moitié d'un B7)

source: 4.4cm x 6.2cm (ISO 216, half a B8)
fr: 4,4cm x 6,2cm (ISO 216, moitié d'un B8)

source: 3.1cm x 4.4cm (ISO 216, half a B9)
fr: 3,1cm x 4,4cm (ISO 216, moitié d'un B9)

source: 8.5in x 11in
fr: 8,5" x 11"

source: 8.5in x 14in
fr: 8,5" x 14"

source: 7in x 10in
fr: 7" x 10"

source: 11in x 17in
fr: 11" x 17"

source: 5.5in x 8.5in
fr: 5,5" x 8,5"

source: 8in x 13in
fr: 8" x 13"

source: 8.5in x 13in
fr: 8,5" x 13"

source: 10in x 14in
fr: 10" x 14"

source: 64.8cm × 91.7cm (ISO 269, half a C0)
fr: 64,8cm × 91,7cm (ISO 269, moitié d'un C0)

source: 45.8cm × 64.8cm (ISO 269, half a C1)
fr: 45,8cm × 64,8cm (ISO 269, moitié d'un C1)

source: 32.4cm × 45.8cm (ISO 269, half a C2)
fr: 32,4cm × 45,8cm (ISO 269, moitié d'un C2)

source: 22.9cm × 32.4cm (ISO 269, half a C3)
fr: 22,9cm × 32,4cm (ISO 269, moitié d'un C3)

source: 16.2cm × 22.9cm (ISO 269, half a C4)
fr: 16,2cm × 22,9cm (ISO 269, moitié d'un C4)

source: 11.4cm × 16.2cm (ISO 269, half a C5)
fr: 11,4cm × 16,2cm (ISO 269, moitié d'un C5)

source: 8.1cm × 11.4cm (ISO 269, half a C6)
fr: 8,1cm × 11,4cm (ISO 269, moitié d'un C6)

source: 5.7cm × 8.1cm (ISO 269, half a C7)
fr: 5,7cm × 8,1cm (ISO 269, moitié d'un C7)

source: 4cm × 5.7cm (ISO 269, half a C8)
fr: 4cm × 5,7cm (ISO 269, moitié d'un C8)

source: 2.8cm × 4cm (ISO 269, half a C9)
fr: 2,8cm × 4cm (ISO 269, moitié d'un C9)

source: synonym for halfletter
fr: synonyme de "halfletter"

source: 17in x 11in
fr: 17" x 11"

source: 9in x 12in (architectural size)
fr: 9" x 12" (format architectural)

source: 12in x 18in (architectural size)
fr: 12" x 18" (format architectural)

source: 18in x 24in (architectural size)
fr: 18" x 24" (format architectural)

source: 24in x 36in (architectural size)
fr: 24" x 36" (format architectural)

source: 30in x 42in (architectural size)
fr: 30" x 42" (format architectural)

source: 36in x 48in (architectural size)
fr: 36" x 48" (format architectural)

source: other name for Arch1 (architectural size)
fr: synomyme d'Arch1 (format architectural)

source: other name for Arch2 (architectural size)
fr: synomyme d'Arch2 (format architectural)

source: other name for Arch3 (architectural size)
fr: synomyme d'Arch3 (format architectural)

source: other name for Arch4 (architectural size)
fr: synomyme d'Arch4 (format architectural)

source: other name for Arch5 (architectural size)
fr: synomyme d'Arch5 (format architectural)

source: other name for Arch6 (architectural size)
fr: synomyme d'Arch6 (format architectural)

source: 26in x 38in (architectural size)
fr: 26" x 38" (format architectural)

source: 27in x 39in (architectural size)
fr: 27" x 39" (format architectural)
