Repository: pypi-data/pypi-mirror-404
Catalog: packages/sigima/sigima-1.0.6.tar.gz/sigima-1.0.6/doc/locale/*/LC_MESSAGES/user_guide/overview.po
Languages: fr

source: Overview
fr: Vue d'ensemble

source: What is Sigima?
fr: Qu'est-ce que Sigima ?

source: **Sigima** is an open-source Python library for scientific signal and image processing. It provides a unified, object-oriented approach to working with 1D signals and 2D images, combining the power of NumPy arrays with rich metadata and processing capabilities.
fr: **Sigima** est une bibliothèque Python open-source pour le traitement scientifique de signaux et d'images. Elle fournit une approche unifiée et orientée objet pour travailler avec des signaux 1D et des images 2D, combinant la puissance des tableaux NumPy avec des métadonnées riches et des capacités de traitement.

source: Sigima was created from the externalization of `DataLab <https://datalab-platform.com/>`_'s computing engine and is now an essential building block of the DataLab ecosystem, but is designed to be GUI-independent (and independent of DataLab itself) and can be used in a variety of scientific computing contexts.
fr: Sigima a été créé à partir de l'externalisation du moteur de calcul de `DataLab <https://datalab-platform.com/>`_ et constitue maintenant un élément essentiel de l'écosystème DataLab, mais est conçu pour être indépendant de toute interface graphique (et indépendant de DataLab lui-même) et peut être utilisé dans une variété de contextes de calcul scientifique.

source: Why Sigima?
fr: Pourquoi Sigima ?

source: Scientific data processing often requires more than just raw numerical arrays. Real-world applications demand:
fr: Le traitement de données scientifiques nécessite souvent plus que de simples tableaux numériques. Les applications réelles requièrent :

source: **Context-aware data**: physical units, coordinate systems, and measurement uncertainties
fr: **Données contextualisées** : unités physiques, systèmes de coordonnées et incertitudes de mesure

source: **Reproducible workflows**: clear separation between data and processing logic
fr: **Flux de travail reproductibles** : séparation claire entre les données et la logique de traitement

source: **Testable components**: modular functions that can be validated independently
fr: **Composants testables** : fonctions modulaires qui peuvent être validées indépendamment

source: **Flexible integration**: ability to work both with high-level objects and low-level arrays
fr: **Intégration flexible** : capacité de travailler à la fois avec des objets de haut niveau et des tableaux de bas niveau

source: Sigima addresses these needs by providing a structured framework that bridges the gap between raw numerical operations and scientific data analysis. It is designed to be the processing backend for scientific applications, particularly those requiring headless execution or remote processing capabilities.
fr: Sigima répond à ces besoins en fournissant un cadre structuré qui comble le fossé entre les opérations numériques brutes et l'analyse de données scientifiques. Il est conçu pour être le moteur de traitement des applications scientifiques, en particulier celles nécessitant une exécution sans interface graphique ou des capacités de traitement à distance.

source: Signals in Sigima
fr: Signaux dans Sigima

source: What are Signals?
fr: Qu'est-ce qu'un signal ?

source: In Sigima, a **signal** is a 1D data object represented by the :py:class:`~sigima.objects.signal.object.SignalObj` class. Unlike a simple NumPy array, a signal carries complete information about your measurement or calculation.
fr: Dans Sigima, un **signal** est un objet de données 1D représenté par la classe :py:class:`~sigima.objects.signal.object.SignalObj`. Contrairement à un simple tableau NumPy, un signal contient l'ensemble des informations concernant votre mesure ou calcul.

source: Core Components
fr: Composants principaux

source: A signal consists of:
fr: Un signal se compose de :

source: **X and Y Data**
fr: **Données X et Y**

source: The fundamental coordinate-value pairs that define your signal. The x-axis typically represents the independent variable (time, frequency, position, etc.) while the y-axis contains the measured or calculated values.
fr: Les paires fondamentales coordonnée-valeur qui définissent votre signal. L'axe des x représente généralement la variable indépendante (temps, fréquence, position, etc.) tandis que l'axe des y contient les valeurs mesurées ou calculées.

source: **Error Bars (dx, dy)**
fr: **Barres d'erreur (dx, dy)**

source: Sigima natively supports uncertainty quantification through optional error bars:
fr: Sigima prend en charge nativement la quantification de l'incertitude via des barres d'erreur optionnelles :

source: ``dx``: uncertainties in the x-coordinate (e.g., timing jitter, position uncertainty)
fr: ``dx`` : incertitudes sur la coordonnée x (par exemple, gigue temporelle, incertitude de position)

source: ``dy``: uncertainties in the y-values (e.g., measurement noise, statistical errors)
fr: ``dy`` : incertitudes sur les valeurs y (par exemple, bruit de mesure, erreurs statistiques)

source: These error bars propagate through many processing operations, allowing you to track how uncertainties evolve in your analysis pipeline.
fr: Ces barres d'erreur se propagent à travers de nombreuses opérations de traitement, vous permettant de suivre l'évolution des incertitudes dans votre pipeline d'analyse.

source: **Metadata**
fr: **Métadonnées**

source: A flexible dictionary for storing any additional information about your signal: acquisition parameters, processing history, physical constants, or any custom data your application needs.
fr: Un dictionnaire flexible pour stocker toute information supplémentaire concernant votre signal : paramètres d'acquisition, historique de traitement, constantes physiques ou toute donnée personnalisée dont votre application a besoin.

source: **Units and Labels**
fr: **Unités et étiquettes**

source: Clear labeling of physical quantities:
fr: Étiquetage clair des grandeurs physiques :

source: ``xlabel`` / ``ylabel``: descriptive names (e.g., "Time", "Temperature")
fr: ``xlabel`` / ``ylabel`` : noms descriptifs (par exemple, "Temps", "Température")

source: ``xunit`` / ``yunit``: physical units (e.g., "s", "°C")
fr: ``xunit`` / ``yunit`` : unités physiques (par exemple, "s", "°C")

source: User-defined notes or comments about specific features or regions of the signal.
fr: Notes ou commentaires définis par l'utilisateur concernant des caractéristiques ou régions spécifiques du signal.

source: Why This Matters
fr: Pourquoi c'est important

source: Consider a temperature measurement over time. With a simple NumPy array, you just have numbers. With a Sigima signal, you have:
fr: Considérez une mesure de température au cours du temps. Avec un simple tableau NumPy, vous n'avez que des nombres. Avec un signal Sigima, vous avez :

source: This signal object can now be processed, analyzed, saved, and loaded while preserving all its context. When you apply operations like filtering, peak detection, or statistics, the units, labels, and error bars remain attached to your data.
fr: Cet objet signal peut maintenant être traité, analysé, sauvegardé et chargé tout en préservant son contexte. Lorsque vous appliquez des opérations comme le filtrage, la détection de pics ou les statistiques, les unités, étiquettes et barres d'erreur restent attachées à vos données.

source: Specialized Features
fr: Fonctionnalités spécialisées

source: Sigima signals support advanced use cases:
fr: Les signaux Sigima prennent en charge des cas d'usage avancés :

source: **Datetime Coordinates**
fr: **Coordonnées temporelles**

source: For time-series data, x-coordinates can represent actual datetime values, with automatic handling of time units and formatting.
fr: Pour les données de séries temporelles, les coordonnées x peuvent représenter des valeurs de date/heure réelles, avec gestion automatique des unités de temps et du formatage.

source: **ROI Operations**
fr: **Opérations ROI**

source: Define regions of interest (ROIs) to process or analyze specific portions of your signal independently.
fr: Définissez des régions d'intérêt (ROI) pour traiter ou analyser des portions spécifiques de votre signal de manière indépendante.

source: **Scale Management**
fr: **Gestion des échelles**

source: Control visualization aspects like logarithmic scales and axis bounds.
fr: Contrôlez les aspects de visualisation comme les échelles logarithmiques et les limites d'axes.

source: Images in Sigima
fr: Images dans Sigima

source: What are Images?
fr: Qu'est-ce qu'une image ?

source: An **image** in Sigima is a 2D data object represented by the :py:class:`~sigima.objects.image.object.ImageObj` class. Like signals, images extend beyond simple 2D NumPy arrays by providing comprehensive metadata and coordinate system support.
fr: Une **image** dans Sigima est un objet de données 2D représenté par la classe :py:class:`~sigima.objects.image.object.ImageObj`. Comme les signaux, les images vont au-delà des simples tableaux NumPy 2D en fournissant des métadonnées complètes et un support de système de coordonnées.

source: An image consists of:
fr: Une image se compose de :

source: **2D Data Array**
fr: **Tableau de données 2D**

source: The pixel values forming your image. Sigima supports various data types including unsigned integers (uint8, uint16), signed integers (int16, int32), floating-point (float32, float64), and complex numbers (complex128).
fr: Les valeurs de pixels formant votre image. Sigima prend en charge divers types de données incluant les entiers non signés (uint8, uint16), les entiers signés (int16, int32), les nombres à virgule flottante (float32, float64) et les nombres complexes (complex128).

source: **Coordinate Systems**
fr: **Systèmes de coordonnées**

source: Two types of coordinate systems are supported:
fr: Deux types de systèmes de coordonnées sont pris en charge :

source: **Uniform coordinates**: regular pixel spacing, common for most imaging systems
fr: **Coordonnées uniformes** : espacement de pixels régulier, courant pour la plupart des systèmes d'imagerie

source: ``dx``, ``dy``: pixel spacing in physical units
fr: ``dx``, ``dy`` : espacement des pixels en unités physiques

source: ``x0``, ``y0``: origin coordinates
fr: ``x0``, ``y0`` : coordonnées d'origine

source: **Non-uniform coordinates**: variable pixel spacing for adaptive sampling or irregular grids
fr: **Coordonnées non uniformes** : espacement de pixels variable pour l'échantillonnage adaptatif ou les grilles irrégulières

source: ``xcoords``, ``ycoords``: explicit coordinate arrays
fr: ``xcoords``, ``ycoords`` : tableaux de coordonnées explicites

source: Rich metadata support including:
fr: Support riche de métadonnées incluant :

source: DICOM template integration for medical imaging
fr: Intégration de modèles DICOM pour l'imagerie médicale

source: Custom key-value pairs for any application-specific data
fr: Paires clé-valeur personnalisées pour toute donnée spécifique à l'application

source: Automatic extraction from common file formats
fr: Extraction automatique depuis les formats de fichiers courants

source: Physical quantities for all three dimensions:
fr: Grandeurs physiques pour les trois dimensions :

source: ``xlabel``, ``ylabel``, ``zlabel``: axis descriptions
fr: ``xlabel``, ``ylabel``, ``zlabel`` : descriptions d'axes

source: ``xunit``, ``yunit``, ``zunit``: physical units
fr: ``xunit``, ``yunit``, ``zunit`` : unités physiques

source: The z-axis typically represents the pixel values (intensity, height, temperature, etc.)
fr: L'axe z représente généralement les valeurs de pixels (intensité, hauteur, température, etc.)

source: Structured annotations for documenting features, regions, or processing steps.
fr: Annotations structurées pour documenter les caractéristiques, régions ou étapes de traitement.

source: **Data Type Flexibility**
fr: **Flexibilité des types de données**

source: Unlike signals (which are typically float64), images support multiple data types optimized for different use cases:
fr: Contrairement aux signaux (qui sont généralement en float64), les images prennent en charge plusieurs types de données optimisés pour différents cas d'usage :

source: ``uint8``, ``uint16``: efficient storage for camera data, medical images
fr: ``uint8``, ``uint16`` : stockage efficace pour les données de caméras, images médicales

source: ``int16``, ``int32``: signed data, difference images
fr: ``int16``, ``int32`` : données signées, images de différence

source: ``float32``, ``float64``: scientific measurements, calculated results
fr: ``float32``, ``float64`` : mesures scientifiques, résultats calculés

source: ``complex128``: Fourier transforms, wave simulations
fr: ``complex128`` : transformées de Fourier, simulations d'ondes

source: Consider microscopy data. A raw 2D array gives you pixel values, but an ``ImageObj`` provides the complete picture:
fr: Considérez des données de microscopie. Un tableau 2D brut vous donne des valeurs de pixels, mais un ``ImageObj`` fournit l'image complète :

source: Processing operations automatically work in physical units. Measurements return results in micrometers, not pixels. The metadata travels with your data through the entire analysis pipeline.
fr: Les opérations de traitement fonctionnent automatiquement en unités physiques. Les mesures retournent des résultats en micromètres, pas en pixels. Les métadonnées accompagnent vos données tout au long du pipeline d'analyse.

source: **Native Support for Multiple Image Formats**
fr: **Support natif de multiples formats d'image**

source: Sigima can directly read and write images from various scientific and common file formats, making it easy to integrate into existing workflows:
fr: Sigima peut lire et écrire directement des images depuis divers formats de fichiers scientifiques et courants, facilitant l'intégration dans les flux de travail existants :

source: **Common formats**: BMP, JPEG, PNG, TIFF, JPEG 2000
fr: **Formats courants** : BMP, JPEG, PNG, TIFF, JPEG 2000

source: **Scientific formats**: DICOM (medical imaging), Andor SIF (spectroscopy cameras)
fr: **Formats scientifiques** : DICOM (imagerie médicale), Andor SIF (caméras de spectroscopie)

source: **Data exchange**: NumPy (.npy), MATLAB (.mat), HDF5 (.h5img)
fr: **Échange de données** : NumPy (.npy), MATLAB (.mat), HDF5 (.h5img)

source: **Text-based**: CSV, TXT, ASC (with coordinate metadata support)
fr: **Basés sur du texte** : CSV, TXT, ASC (avec support des métadonnées de coordonnées)

source: **Specialized**: Spiricon (.scor-data), Dürr NDT (.xyz), FT-Lab (.ima)
fr: **Spécialisés** : Spiricon (.scor-data), Dürr NDT (.xyz), FT-Lab (.ima)

source: Each format preserves relevant metadata when available, such as DICOM medical imaging headers or acquisition parameters from scientific instruments.
fr: Chaque format préserve les métadonnées pertinentes lorsqu'elles sont disponibles, comme les en-têtes d'imagerie médicale DICOM ou les paramètres d'acquisition d'instruments scientifiques.

source: Define rectangular, circular, or polygonal regions of interest for localized analysis or processing.
fr: Définissez des régions d'intérêt rectangulaires, circulaires ou polygonales pour une analyse ou un traitement localisé.

source: **Masked Arrays**
fr: **Tableaux masqués**

source: Support for NumPy masked arrays to handle invalid pixels, saturated regions, or excluded areas.
fr: Support des tableaux masqués NumPy pour gérer les pixels invalides, les régions saturées ou les zones exclues.

source: **Coordinate Conversion**
fr: **Conversion de coordonnées**

source: Seamless conversion between pixel indices and physical coordinates, essential for multi-scale or multi-modal imaging.
fr: Conversion transparente entre les indices de pixels et les coordonnées physiques, essentielle pour l'imagerie multi-échelle ou multi-modale.

source: Key Differences from Raw Arrays
fr: Différences clés par rapport aux tableaux bruts

source: Here's why Sigima objects are more powerful than plain NumPy arrays in physical data processing:
fr: Voici pourquoi les objets Sigima sont plus puissants que les simples tableaux NumPy pour le traitement de données physiques :

source: Feature
fr: Fonctionnalité

source: NumPy Array
fr: Tableau NumPy

source: Sigima Object
fr: Objet Sigima

source: Data storage
fr: Stockage de données

source: Numbers only
fr: Nombres uniquement

source: Numbers + context
fr: Nombres + contexte

source: Units
fr: Unités

source: Implicit/external
fr: Implicites/externes

source: Explicit and tracked
fr: Explicites et suivies

source: Error propagation
fr: Propagation d'erreur

source: Manual
fr: Manuelle

source: Automatic (where supported)
fr: Automatique (lorsque pris en charge)

source: Metadata
fr: Métadonnées

source: Separate variables
fr: Variables séparées

source: Integrated dictionary
fr: Dictionnaire intégré

source: Coordinate systems
fr: Systèmes de coordonnées

source: Index-based only
fr: Uniquement basé sur les indices

source: Physical coordinates
fr: Coordonnées physiques

source: Serialization
fr: Sérialisation

source: Just data
fr: Données seules

source: Complete context
fr: Contexte complet

source: Processing history
fr: Historique de traitement

source: Lost
fr: Perdu

source: Can be tracked
fr: Peut être suivi

source: Common Use Cases
fr: Cas d'usage courants

source: Sigima excels in scenarios requiring:
fr: Sigima excelle dans les scénarios nécessitant :

source: **Scientific Instrumentation**
fr: **Instrumentation scientifique**

source: Process data from sensors, cameras, spectrometers, or any measurement device while preserving calibration, units, and acquisition parameters.
fr: Traitez les données de capteurs, caméras, spectromètres ou tout dispositif de mesure en préservant l'étalonnage, les unités et les paramètres d'acquisition.

source: **Automated Analysis Pipelines**
fr: **Pipelines d'analyse automatisés**

source: Build reproducible workflows that maintain data provenance and context through multiple processing steps.
fr: Construisez des flux de travail reproductibles qui maintiennent la provenance et le contexte des données à travers plusieurs étapes de traitement.

source: **Remote Processing**
fr: **Traitement à distance**

source: Execute signal and image processing on remote servers or in cloud environments without GUI dependencies.
fr: Exécutez le traitement de signaux et d'images sur des serveurs distants ou dans des environnements cloud sans dépendances d'interface graphique.

source: **Application Backends**
fr: **Moteurs d'application**

source: Provide the computation engine for scientific software, keeping processing logic independent from user interface concerns.
fr: Fournissez le moteur de calcul pour des logiciels scientifiques, en gardant la logique de traitement indépendante des préoccupations d'interface utilisateur.

source: **Research and Development**
fr: **Recherche et développement**

source: Develop and validate new processing algorithms in a testable, modular framework.
fr: Développez et validez de nouveaux algorithmes de traitement dans un cadre testable et modulaire.

source: GUI Connection
fr: Connexion avec l'interface graphique

source: As the core computing engine externalized from `DataLab <https://datalab-platform.com/>`_, Sigima seamlessly integrates with it as an essential building block of the DataLab stack. You can leverage Sigima's powerful processing features within DataLab's graphical interface, using for example Sigima to handle your signal and image acquisition and sending the results back to DataLab for visualization and further interactive analysis.
fr: En tant que moteur de calcul principal externalisé de `DataLab <https://datalab-platform.com/>`_, Sigima s'intègre parfaitement avec lui comme élément essentiel de la pile DataLab. Vous pouvez exploiter les puissantes fonctionnalités de traitement de Sigima au sein de l'interface graphique de DataLab, en utilisant par exemple Sigima pour gérer votre acquisition de signaux et d'images et en renvoyant les résultats vers DataLab pour la visualisation et l'analyse interactive approfondie.

source: Getting Started
fr: Premiers pas

source: To start using Sigima, check out:
fr: Pour commencer à utiliser Sigima, consultez :

source: :doc:`installation` - Set up Sigima in your environment
fr: :doc:`installation` - Installez Sigima dans votre environnement

source: :doc:`features` - Explore Sigima's key features and capabilities
fr: :doc:`features` - Explorez les principales fonctionnalités et capacités de Sigima

source: :doc:`../auto_examples/index` - Practical examples showing signals and images in action
fr: :doc:`../auto_examples/index` - Exemples pratiques montrant les signaux et images en action

source: :doc:`../api/index` - Complete API reference
fr: :doc:`../api/index` - Référence API complète

source: Sigima is designed to be **GUI-independent**. If you need interactive visualization and analysis tools, check out `DataLab <https://datalab-platform.com/>`_, which uses Sigima as its processing backend and adds a complete graphical interface.
fr: Sigima est conçu pour être **indépendant de toute interface graphique**. Si vous avez besoin d'outils de visualisation et d'analyse interactifs, consultez `DataLab <https://datalab-platform.com/>`_, qui utilise Sigima comme moteur de traitement et ajoute une interface graphique complète.
