Repository: pypi-data/pypi-mirror-404
Catalog: packages/finanzonline-uid/finanzonline_uid-2.5.6.tar.gz/finanzonline_uid-2.5.6/src/finanzonline_uid/locales/*/LC_MESSAGES/messages.po
Languages: es, fr

source: UID is valid
es: UID es válido
fr: L'UID est valide

source: UID is invalid
es: UID no es válido
fr: L'UID n'est pas valide

source: Session invalid or expired
es: Sesión inválida o expirada
fr: Session invalide ou expirée

source: System maintenance
es: Mantenimiento del sistema
fr: Maintenance du système

source: Technical error
es: Error técnico
fr: Erreur technique

source: The access codes are not valid
es: Los códigos de acceso no son válidos
fr: Les codes d'accès ne sont pas valides

source: User locked due to incorrect login attempts
es: Usuario bloqueado por intentos de inicio de sesión incorrectos
fr: Utilisateur bloqué en raison de tentatives de connexion incorrectes

source: User is locked
es: Usuario está bloqueado
fr: L'utilisateur est bloqué

source: User is not a web service user
es: El usuario no es un usuario del servicio web
fr: L'utilisateur n'est pas un utilisateur du service web

source: Participant locked or not authorized for web service
es: Participante bloqueado o no autorizado para el servicio web
fr: Participant bloqué ou non autorisé pour le service web

source: Wrong UID format
es: Formato de UID incorrecto
fr: Format d'UID incorrect

source: Invalid requester UID
es: UID del solicitante inválido
fr: UID du demandeur invalide

source: Member state forbids query
es: El estado miembro prohíbe la consulta
fr: L'État membre interdit la requête

source: Not authorized for requester UID
es: No autorizado para el UID del solicitante
fr: Non autorisé pour l'UID du demandeur

source: UID not yet queryable
es: UID aún no consultable
fr: UID pas encore interrogeable

source: UID doesn't start with ATU
es: UID no comienza con ATU
fr: L'UID ne commence pas par ATU

source: VAT group (CZ) - special handling required
es: Grupo de IVA (CZ) - se requiere tratamiento especial
fr: Groupe TVA (CZ) - traitement spécial requis

source: VAT group (SK) - special handling required
es: Grupo de IVA (SK) - se requiere tratamiento especial
fr: Groupe TVA (SK) - traitement spécial requis

source: Must query via FinanzOnline portal directly
es: Debe consultar directamente a través del portal FinanzOnline
fr: Doit interroger directement via le portail FinanzOnline

source: Service unavailable
es: Servicio no disponible
fr: Service indisponible

source: Too many queries (server load)
es: Demasiadas consultas (carga del servidor)
fr: Trop de requêtes (charge du serveur)

source: Rate limit: 2 queries per UID per day exceeded
es: Límite de velocidad: 2 consultas por UID por día excedido
fr: Limite de débit : 2 requêtes par UID par jour dépassée

source: Rate limit: requester limit exceeded
es: Límite de velocidad: límite del solicitante excedido
fr: Limite de débit : limite du demandeur dépassée

source: Unknown return code
es: Código de retorno desconocido
fr: Code de retour inconnu

source: VALID
es: VÁLIDO
fr: VALIDE

source: INVALID
es: INVÁLIDO
fr: INVALIDE

source: UNAVAILABLE
es: NO DISPONIBLE
fr: INDISPONIBLE

source: RATE LIMITED
es: LÍMITE DE CONSULTAS
fr: LIMITE DE DÉBIT

source: ERROR
fr: ERREUR

source: Valid
es: Válido
fr: Valide

source: Invalid
es: Inválido
fr: Invalide

source: Service Unavailable
es: Servicio no disponible
fr: Service indisponible

source: Rate Limited
es: Límite de consultas alcanzado
fr: Limite de débit atteinte

source: UID Check Result
es: Resultado de verificación de UID
fr: Résultat de vérification d'UID

source: Company Information
es: Información de la empresa
fr: Informations sur l'entreprise

source: Name:
es: Nombre:
fr: Nom :

source: Address:
es: Dirección:
fr: Adresse :

source: Status:
es: Estado:
fr: Statut :

source: Return Code:
es: Código de retorno:
fr: Code de retour :

source: Severity:
es: Gravedad:
fr: Gravité :

source: Retryable:
es: Reintentable:
fr: Réessayable :

source: Timestamp:
es: Marca de tiempo:
fr: Horodatage :

source: Yes
es: Sí
fr: Oui

source: No
fr: Non

source: This is an automated message from finanzonline-uid.
es: Este es un mensaje automático de finanzonline-uid.
fr: Ceci est un message automatique de finanzonline-uid.

source: UID Verification Result (Stufe 2)
es: Resultado de verificación de UID (Nivel 2)
fr: Résultat de vérification d'UID (Niveau 2)

source: Query Level: Stufe 2 (with name/address verification)
es: Nivel de consulta: Nivel 2 (con verificación de nombre/dirección)
fr: Niveau de requête : Niveau 2 (avec vérification nom/adresse)

source: Stufe 2 (with name/address verification)
es: Nivel 2 (con verificación de nombre/dirección)
fr: Niveau 2 (avec vérification nom/adresse)

source: Query Level:
es: Nivel de consulta:
fr: Niveau de requête :

source: Cached Result
es: Resultado en caché
fr: Résultat en cache

source: This result was retrieved from cache.
es: Este resultado fue recuperado del caché.
fr: Ce résultat a été récupéré du cache.

source: Originally queried:
es: Consultado originalmente:
fr: Interrogé à l'origine :

source: NOTE: This is a CACHED result
es: NOTA: Este es un resultado EN CACHÉ
fr: NOTE : Ceci est un résultat EN CACHE

source: UID Check ERROR Notification
es: Notificación de ERROR de verificación de UID
fr: Notification d'ERREUR de vérification d'UID

source: Error Type:
es: Tipo de error:
fr: Type d'erreur :

source: Meaning:
es: Significado:
fr: Signification :

source: Diagnostic Information
es: Información de diagnóstico
fr: Informations de diagnostic

source: This is an automated error notification from finanzonline-uid.
es: Esta es una notificación de error automática de finanzonline-uid.
fr: Ceci est une notification d'erreur automatique de finanzonline-uid.

source: UID Check Error
es: Error de verificación de UID
fr: Erreur de vérification d'UID

source: UID Check ERROR
es: ERROR de verificación de UID
fr: ERREUR de vérification d'UID

source: Yes - try again later
es: Sí - intente de nuevo más tarde
fr: Oui - réessayer plus tard

source: UID Check Austria - Rate Limit Warning
es: UID Check Austria - Advertencia de límite de velocidad
fr: UID Check Austria - Avertissement de limite de débit

source: WARNING: Your query rate has exceeded the configured limit.
es: ADVERTENCIA: Su tasa de consultas ha excedido el límite configurado.
fr: AVERTISSEMENT : Votre taux de requêtes a dépassé la limite configurée.

source: Current Status
es: Estado actual
fr: Statut actuel

source: Queries in window:
es: Consultas en ventana:
fr: Requêtes dans la fenêtre :

source: Maximum allowed:
es: Máximo permitido:
fr: Maximum autorisé :

source: Window duration:
es: Duración de ventana:
fr: Durée de la fenêtre :

source: hours
es: horas
fr: heures

source: Fair Use Policy Notice
es: Aviso de política de uso justo
fr: Avis de politique d'utilisation équitable

source: "UID verifications should only be requested at the time when intra-Community tax-exempt supplies or other services are provided to customers in other EU member states - not in advance or in bulk."
es: "Las verificaciones de UID solo deben solicitarse en el momento en que se proporcionan suministros exentos de impuestos intracomunitarios u otros servicios a clientes en otros estados miembros de la UE, no por adelantado ni en masa."
fr: "Les vérifications d'UID ne doivent être demandées qu'au moment où des livraisons intracommunautaires exonérées d'impôt ou d'autres services sont fournis à des clients dans d'autres États membres de l'UE - pas à l'avance ni en masse."

source: You are probably not using this program in the right way.
es: Probablemente no está usando este programa de la manera correcta.
fr: Vous n'utilisez probablement pas ce programme de la bonne manière.

source: UID queries should be made at the time of transaction, not:
es: Las consultas de UID deben realizarse en el momento de la transacción, no:
fr: Les requêtes UID doivent être effectuées au moment de la transaction, pas :

source: In advance for potential future transactions
es: Por adelantado para posibles transacciones futuras
fr: À l'avance pour d'éventuelles transactions futures

source: In bulk for database validation
es: En masa para validación de base de datos
fr: En masse pour la validation de base de données

source: For speculative or exploratory purposes
es: Para propósitos especulativos o exploratorios
fr: À des fins spéculatives ou exploratoires

source: This warning is logged locally. The actual BMF service may enforce its own rate limits independently.
es: Esta advertencia se registra localmente. El servicio BMF real puede aplicar sus propios límites de velocidad de forma independiente.
fr: Cet avertissement est enregistré localement. Le service BMF réel peut appliquer ses propres limites de débit indépendamment.

source: This is an automated warning from finanzonline-uid.
es: Esta es una advertencia automática de finanzonline-uid.
fr: Ceci est un avertissement automatique de finanzonline-uid.

source: Rate Limit Exceeded
es: Límite de velocidad excedido
fr: Limite de débit dépassée

source: Your query rate has exceeded the configured limit.
es: Su tasa de consultas ha excedido el límite configurado.
fr: Votre taux de requêtes a dépassé la limite configurée.

source: UID Check Rate Limit Warning
es: Advertencia de límite de velocidad de UID Check
fr: Avertissement de limite de débit UID Check

source: Rate Limit Warning
es: Advertencia de límite de velocidad
fr: Avertissement de limite de débit

source: Show full Python traceback on errors
es: Mostrar rastreo completo de Python en errores
fr: Afficher la trace complète Python en cas d'erreurs

source: Load configuration from a named profile (e.g., 'production', 'test')
es: Cargar configuración desde un perfil nombrado (ej., 'production', 'test')
fr: Charger la configuration depuis un profil nommé (ex., 'production', 'test')

source: Output format (human-readable or JSON)
es: Formato de salida (legible o JSON)
fr: Format de sortie (lisible ou JSON)

source: Show only a specific configuration section (e.g., 'lib_log_rich')
es: Mostrar solo una sección de configuración específica (ej., 'lib_log_rich')
fr: Afficher uniquement une section de configuration spécifique (ex., 'lib_log_rich')

source: Override profile from root command (e.g., 'production', 'test')
es: Sobrescribir perfil del comando raíz (ej., 'production', 'test')
fr: Remplacer le profil de la commande racine (ex., 'production', 'test')

source: Target configuration layer(s) to deploy to (can specify multiple)
es: Capa(s) de configuración de destino para desplegar (puede especificar múltiples)
fr: Couche(s) de configuration cible pour le déploiement (peut en spécifier plusieurs)

source: Overwrite existing configuration files
es: Sobrescribir archivos de configuración existentes
fr: Écraser les fichiers de configuration existants

source: Interactive mode: prompt for UID to check
es: Modo interactivo: solicitar UID para verificar
fr: Mode interactif : demander l'UID à vérifier

source: Disable email notification (default: email enabled)
es: Deshabilitar notificación por correo (predeterminado: habilitado)
fr: Désactiver la notification par e-mail (par défaut : activée)

source: Output format (default: human)
es: Formato de salida (predeterminado: legible)
fr: Format de sortie (par défaut : lisible)

source: Email recipient (can specify multiple, uses config default if not specified)
es: Destinatario de correo (puede especificar múltiples, usa predeterminado si no se especifica)
fr: Destinataire d'e-mail (peut en spécifier plusieurs, utilise la valeur par défaut si non spécifié)

source: profile
es: perfil
fr: profil

source: Configuration deployed successfully
es: Configuración desplegada exitosamente
fr: Configuration déployée avec succès

source: No files were created (all target files already exist).
es: No se crearon archivos (todos los archivos de destino ya existen).
fr: Aucun fichier n'a été créé (tous les fichiers cibles existent déjà).

source: All configuration files are already up to date (content unchanged).
es: Todos los archivos de configuración ya están actualizados (contenido sin cambios).
fr: Tous les fichiers de configuration sont déjà à jour (contenu inchangé).

source: Use --force to overwrite existing configuration files.
es: Use --force para sobrescribir archivos de configuración existentes.
fr: Utilisez --force pour écraser les fichiers de configuration existants.

source: Error
fr: Erreur

source: Permission denied.
es: Permiso denegado.
fr: Permission refusée.

source: Hint: System-wide deployment (--target app/host) may require sudo.
es: Sugerencia: El despliegue a nivel de sistema (--target app/host) puede requerir sudo.
fr: Conseil : Le déploiement système (--target app/host) peut nécessiter sudo.

source: Failed to deploy configuration:
es: Error al desplegar configuración:
fr: Échec du déploiement de la configuration :

source: Enter EU VAT ID to verify
es: Ingrese ID de IVA de la UE para verificar
fr: Entrez l'ID TVA UE à vérifier

source: Error: UID argument is required (or use --interactive)
es: Error: El argumento UID es requerido (o use --interactive)
fr: Erreur : L'argument UID est requis (ou utilisez --interactive)

source: Return code:
es: Código de retorno:
fr: Code de retour :

source: This error may be temporary. Try again later.
es: Este error puede ser temporal. Intente de nuevo más tarde.
fr: Cette erreur peut être temporaire. Réessayez plus tard.

source: Configure FinanzOnline credentials in your config file or via environment variables:
es: Configure las credenciales de FinanzOnline en su archivo de configuración o mediante variables de entorno:
fr: Configurez les identifiants FinanzOnline dans votre fichier de configuration ou via les variables d'environnement :

source: 8-12 alphanumeric
es: 8-12 alfanumérico
fr: 8-12 alphanumérique

source: 5-12 chars
es: 5-12 caracteres
fr: 5-12 caractères

source: 5-128 chars
es: 5-128 caracteres
fr: 5-128 caractères

source: 10-24 alphanumeric
es: 10-24 alfanumérico
fr: 10-24 alphanumérique

source: Retry interval in minutes until check succeeds or canceled (interactive mode only)
es: Intervalo de reintento en minutos hasta que la verificación tenga éxito o se cancele (solo modo interactivo)
fr: Intervalle de réessai en minutes jusqu'à ce que la vérification réussisse ou soit annulée (mode interactif uniquement)

source: Error: --retryminutes requires --interactive mode
es: Error: --retryminutes requiere modo --interactive
fr: Erreur : --retryminutes nécessite le mode --interactive

source: Checking
es: Verificando
fr: Vérification

source: Next attempt in
es: Próximo intento en
fr: Prochaine tentative dans

source: Attempts so far
es: Intentos hasta ahora
fr: Tentatives jusqu'à présent

source: Retry Mode
es: Modo de reintento
fr: Mode réessai

source: Attempt
es: Intento
fr: Tentative

source: Cancelled by user after
es: Cancelado por el usuario después de
fr: Annulé par l'utilisateur après

source: attempt(s)
es: intento(s)
fr: tentative(s)

source: Check cancelled by user
es: Verificación cancelada por el usuario
fr: Vérification annulée par l'utilisateur

source: Warning: Email notification failed: {error}
es: Advertencia: Error en notificación por correo: {error}
fr: Avertissement : Échec de la notification par e-mail : {error}

source: Warning: Error notification failed: {error}
es: Advertencia: Error en notificación de errores: {error}
fr: Avertissement : Échec de la notification d'erreur : {error}

source: Directory to save valid UID results as files (overrides config)
es: Directorio para guardar resultados UID válidos como archivos (anula configuración)
fr: Répertoire pour enregistrer les résultats UID valides en fichiers (remplace la configuration)

source: Output file format: json, txt, or html (default: html)
es: Formato de archivo de salida: json, txt o html (predeterminado: html)
fr: Format de fichier de sortie : json, txt ou html (par défaut : html)

source: Result saved to: {filepath}
es: Resultado guardado en: {filepath}
fr: Résultat enregistré dans : {filepath}

source: Warning: Could not save result to {filepath}: {error}
es: Advertencia: No se pudo guardar el resultado en {filepath}: {error}
fr: Avertissement : Impossible d'enregistrer le résultat dans {filepath} : {error}

source: Message:
es: Mensaje:

source: Important
es: Importante
