Repository: pypi-data/pypi-mirror-404
Catalog: packages/sigima/sigima-1.0.6.tar.gz/sigima-1.0.6/doc/locale/*/LC_MESSAGES/auto_examples/features/convolution.po
Languages: fr

source: :ref:`Go to the end <sphx_glr_download_auto_examples_features_convolution.py>` to download the full example code.
fr: :ref:`Aller à la fin <sphx_glr_download_auto_examples_features_convolution.py>` pour télécharger le code complet de l'exemple.

source: Convolution and Deconvolution
fr: Convolution et déconvolution

source: This example focuses on image blurring and sharpening using convolution and deconvolution techniques provided by Sigima. Using various kernels, we'll explore how these operations affect images and how to implement them using Sigima's processing functions.
fr: Cet exemple se concentre sur le floutage et l'accentuation de contours d'images en utilisant les techniques de convolution et de déconvolution fournies par Sigima. En utilisant divers noyaux, nous explorerons comment ces opérations affectent les images et comment les implémenter en utilisant les fonctions de traitement de Sigima.

source: The example shows:
fr: L'exemple montre :

source: Creating test images and kernels
fr: Création d'images de test et de noyaux

source: Basic convolution with Gaussian kernel
fr: Convolution de base avec noyau gaussien

source: Identity convolution (preserving original image)
fr: Convolution d'identité (préservation de l'image d'origine)

source: Deconvolution operations
fr: Opérations de déconvolution

source: Effects of different kernel parameters
fr: Effets des différents paramètres de noyau

source: Custom edge detection and sharpening kernels
fr: Kernels personnalisés de détection de contours et d'accentuation

source: This tutorial uses PlotPy for visualization, providing interactive plots that allow you to explore the convolution results in detail.
fr: Ce tutoriel utilise PlotPy pour la visualisation, fournissant des graphiques interactifs qui vous permettent d'explorer les résultats de convolution en détail.

source: Importing necessary modules
fr: Importation des modules nécessaires

source: We'll start by importing all the required modules for image processing and visualization.
fr: Nous commencerons par importer tous les modules nécessaires au traitement d'image et à la visualisation.

source: We start by creating a test image and various convolution kernels.
fr: Nous commençons par créer une image de test et divers noyaux de convolution.

source: Now we'll perform convolution with the Gaussian kernel and compare the result with scipy's implementation to verify correctness.
fr: Nous allons maintenant effectuer une convolution avec le noyau gaussien et comparer le résultat avec l'implémentation de scipy pour vérifier la justesse.

source: Identity convolution
fr: Convolution d'identité

source: Identity convolution should preserve the original image exactly. This demonstrates that our convolution implementation is working correctly.
fr: La convolution d'identité devrait préserver exactement l'image d'origine. Cela démontre que notre implémentation de convolution fonctionne correctement.

source: Deconvolution with identity kernel
fr: Déconvolution avec noyau d'identité

source: Deconvolution is the inverse operation of convolution. We'll start with a simple case using the identity kernel.
fr: La déconvolution est l'opération inverse de la convolution. Nous commencerons par un cas simple utilisant le noyau d'identité.

source: Advanced deconvolution with Gaussian kernel
fr: Déconvolution avancée avec noyau gaussien

source: Now we'll try deconvolution with a Gaussian kernel, which is more challenging and demonstrates the limitations of deconvolution.
fr: Nous allons maintenant essayer la déconvolution avec un noyau gaussien, qui est plus difficile et démontre les limites de la déconvolution.

source: Exploring different kernel parameters
fr: Exploration des différents paramètres de noyau

source: Different sigma values in Gaussian kernels produce different blurring effects. Let's compare several sigma values side by side.
fr: Différentes valeurs de sigma dans les noyaux gaussiens produisent différents effets de flou. Comparons plusieurs valeurs de sigma côte à côte.

source: Custom convolution kernels
fr: Kernels de convolution personnalisés

source: Besides Gaussian kernels, we can create custom kernels for specific image processing tasks like edge detection and sharpening.
fr: En plus des noyaux gaussiens, nous pouvons créer des noyaux personnalisés pour des tâches spécifiques de traitement d'image telles que la détection de contours et l'accentuation.

source: Summary and conclusions
fr: Résumé et conclusions

source: This tutorial demonstrated the key concepts of convolution and deconvolution in image processing using Sigima.
fr: Ce tutoriel a démontré les concepts clés de la convolution et de la déconvolution dans le traitement d'image en utilisant Sigima.

source: :download:`Download Jupyter notebook: convolution.ipynb <convolution.ipynb>`
fr: :download:`Télécharger le notebook Jupyter : convolution.ipynb <convolution.ipynb>`

source: :download:`Download Python source code: convolution.py <convolution.py>`
fr: :download:`Télécharger le code source Python : convolution.py <convolution.py>`

source: :download:`Download zipped: convolution.zip <convolution.zip>`
fr: :download:`Télécharger le fichier compressé : convolution.zip <convolution.zip>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
fr: `Galerie générée par Sphinx-Gallery <https://sphinx-gallery.github.io>`_
