Repository: pypi-data/pypi-mirror-404
Catalog: packages/sigima/sigima-1.0.6.tar.gz/sigima-1.0.6/doc/locale/*/LC_MESSAGES/auto_examples/features/coordinate_systems.po
Languages: fr

source: :ref:`Go to the end <sphx_glr_download_auto_examples_features_coordinate_systems.py>` to download the full example code.
fr: :ref:`Aller à la fin <sphx_glr_download_auto_examples_features_coordinate_systems.py>` pour télécharger le code complet de l'exemple.

source: Uniform and Non-Uniform Coordinate Systems
fr: Systèmes de coordonnées uniformes et non uniformes

source: This example demonstrates the use of uniform and non-uniform coordinate systems with images in Sigima. It shows how to create, visualize, and work with both types of coordinate systems, highlighting their differences and appropriate use cases.
fr: Cet exemple démontre l'utilisation de systèmes de coordonnées uniformes et non uniformes avec des images dans Sigima. Il montre comment créer, visualiser et travailler avec les deux types de systèmes de coordonnées, en mettant en évidence leurs différences et leurs cas d'utilisation appropriés.

source: The example shows:
fr: L'exemple montre :

source: Creating images with uniform coordinate systems
fr: Création d'images avec des systèmes de coordonnées uniformes

source: Creating images with non-uniform coordinate systems
fr: Création d'images avec des systèmes de coordonnées non uniformes

source: Visualizing the coordinate grids
fr: Visualisation des grilles de coordonnées

source: Comparing pixel spacing and coordinate mapping
fr: Comparaison de l'espacement des pixels et du mappage des coordonnées

source: Working with real-world units and coordinates
fr: Travail avec des unités et des coordonnées du monde réel

source: Understanding when to use each coordinate system type
fr: Quand et comment utiliser chaque type de système de coordonnées

source: This tutorial uses PlotPy for visualization, providing interactive plots that allow you to explore the coordinate system effects in detail.
fr: Ce tutoriel utilise PlotPy pour la visualisation, fournissant des graphiques interactifs qui vous permettent d'explorer en détail les effets du système de coordonnées.

source: Importing necessary modules
fr: Importation des modules nécessaires

source: We'll start by importing all the required modules for image processing and visualization.
fr: Nous commencerons par importer tous les modules nécessaires au traitement d'images et à la visualisation.

source: Creating test images with uniform coordinates
fr: Création d'images de test avec des coordonnées uniformes

source: Uniform coordinates have constant spacing between pixels in both directions. This is the most common case for regular imaging systems.
fr: Les coordonnées uniformes ont un espacement constant entre les pixels dans les deux directions. C'est le cas le plus courant pour les systèmes d'imagerie réguliers.

source: Creating test images with non-uniform coordinates
fr: Création d'images de test avec des coordonnées non uniformes

source: Non-uniform coordinates allow for variable spacing between pixels, useful for adaptive sampling, curved coordinates, or irregular grids.
fr: Les coordonnées non uniformes permettent un espacement variable entre les pixels, utile pour l'échantillonnage adaptatif, les coordonnées courbes ou les grilles irrégulières.

source: Visualizing coordinate system differences
fr: Visualisation des différences entre les systèmes de coordonnées

source: Let's create coordinate grid visualizations to highlight the differences between uniform and non-uniform coordinate systems.
fr: Créons des visualisations de grilles de coordonnées pour mettre en évidence les différences entre les systèmes de coordonnées uniformes et non uniformes.

source: Creating specialized non-uniform coordinate examples
fr: Création d'exemples spécialisés de coordonnées non uniformes

source: Let's create some more realistic examples of non-uniform coordinates that might be encountered in real applications:
fr: Créons des exemples plus réalistes de coordonnées non uniformes qui pourraient être rencontrées dans des applications réelles :

source: Time-resolved spectroscopy with logarithmic wavelength scale
fr: Spectroscopie résolue en temps avec une échelle de longueur d'onde logarithmique

source: Polar to Cartesian mapping
fr: Conversion polaire en cartésien

source: Summary and best practices
fr: Résumé et meilleures pratiques

source: Let's summarize when to use each coordinate system type.
fr: Résumons quand utiliser chaque type de système de coordonnées.
