Repository: pypi-data/pypi-mirror-404
Catalog: packages/sigima/sigima-1.0.6.tar.gz/sigima-1.0.6/doc/locale/*/LC_MESSAGES/auto_examples/features/datetime_signals.po
Languages: fr

source: :ref:`Go to the end <sphx_glr_download_auto_examples_features_datetime_signals.py>` to download the full example code.
fr: :ref:`Aller à la fin <sphx_glr_download_auto_examples_features_datetime_signals.py>` pour télécharger le code complet de l'exemple.

source: DateTime Signal Processing
fr: Traitement des signaux DateTime

source: This example demonstrates how to work with signals that have datetime X-axis data in Sigima. DateTime support is essential for time-series analysis where you need to preserve human-readable timestamps while performing signal processing.
fr: Cet exemple démontre comment travailler avec des signaux ayant des données d'axe X de type datetime dans Sigima. Le support de DateTime est essentiel pour l'analyse des séries temporelles où vous devez préserver des horodatages lisibles par l'homme tout en effectuant un traitement de signal.

source: The example shows:
fr: L'exemple montre :

source: Creating signals from datetime objects and strings
fr: Création de signaux à partir d'objets datetime et de chaînes

source: Using different time units (hours, minutes, seconds, milliseconds, etc.)
fr: Utilisation de différentes unités de temps (heures, minutes, secondes, millisecondes, etc.)

source: Visualizing datetime signals with proper time formatting
fr: Visualisation des signaux datetime avec un formatage temporel approprié

source: CSV I/O with datetime preservation
fr: Entrée/Sortie CSV avec préservation des datetimes

source: Roundtrip testing across all supported time units
fr: Tests de roundtrip sur toutes les unités de temps prises en charge

source: This tutorial uses PlotPy for visualization, providing interactive plots with properly formatted datetime axes.
fr: Ce tutoriel utilise PlotPy pour la visualisation, fournissant des graphiques interactifs avec des axes datetime correctement formatés.

source: Importing necessary modules
fr: Importation des modules nécessaires

source: We'll start by importing all the required modules for datetime signal processing and visualization.
fr: Nous commencerons par importer tous les modules nécessaires au traitement des signaux datetime et à la visualisation.

source: Creating datetime signals from datetime objects
fr: Création de signaux datetime à partir d'objets datetime

source: The most common way to create datetime signals is from Python datetime objects. This is useful when you have timestamps from sensors, logs, or other time-series data.
fr: La façon la plus courante de créer des signaux datetime est à partir d'objets datetime Python. Cela est utile lorsque vous avez des horodatages provenant de capteurs, de journaux ou d'autres données de séries temporelles.

source: Creating datetime signals from string timestamps
fr: Création de signaux datetime à partir d'horodatages sous forme de chaînes

source: Often, datetime data comes as strings (e.g., from CSV files or logs). Sigima can automatically parse common datetime string formats.
fr: Souvent, les données datetime se présentent sous forme de chaînes (par exemple, à partir de fichiers CSV ou de journaux). Sigima peut automatiquement analyser les formats de chaînes datetime courants.

source: Using different time units
fr: Utilisation de différentes unités de temps

source: Sigima supports various time units to match your data's natural resolution: nanoseconds (ns), microseconds (us), milliseconds (ms), seconds (s), minutes (min), and hours (h).
fr: Sigima prend en charge diverses unités de temps pour correspondre à la résolution naturelle de vos données : nanosecondes (ns), microsecondes (us), millisecondes (ms), secondes (s), minutes (min) et heures (h).

source: Comparing multiple datetime signals
fr: Comparaison de plusieurs signaux datetime

source: You can visualize multiple datetime signals together to compare trends.
fr: Vous pouvez visualiser plusieurs signaux datetime ensemble pour comparer les tendances.

source: Sigima automatically preserves datetime information when writing to CSV, storing timestamps as human-readable strings instead of opaque float values.
fr: Sigima préserve automatiquement les informations datetime lors de l'écriture dans un fichier CSV, stockant les horodatages sous forme de chaînes lisibles par l'homme plutôt que de valeurs flottantes opaques.

source: Summary
fr: Résumé

source: This example demonstrated the complete datetime signal workflow in Sigima:
fr: Cet exemple a démontré le flux de travail complet des signaux datetime dans Sigima :

source: **Creating datetime signals** from objects and strings
fr: **Création de signaux datetime** à partir d'objets et de chaînes

source: **Multiple time units** (ns, us, ms, s, min, h) stored in `xunit` attribute
fr: **Plusieurs unités de temps** (ns, us, ms, s, min, h) stockées dans l'attribut `xunit`

source: **Visualization** with properly formatted datetime axes
fr: **Visualisation** avec des axes datetime correctement formatés

source: **CSV I/O** with automatic datetime preservation
fr: **CSV I/O** avec préservation automatique des datetime

source: The time unit is stored in the signal's `xunit` attribute, making it easy to access and consistent with other signal metadata. DateTime support makes Sigima ideal for time-series analysis, sensor data processing, and any application requiring human-readable temporal information.
fr: L'unité de temps est stockée dans l'attribut `xunit` du signal, ce qui facilite l'accès et assure la cohérence avec les autres métadonnées du signal. La prise en charge des datetime fait de Sigima un outil idéal pour l'analyse des séries temporelles, le traitement des données de capteurs et toute application nécessitant des informations temporelles lisibles par l'homme.
