Repository: pypi-data/pypi-mirror-404
Catalog: packages/sigima/sigima-1.0.6.tar.gz/sigima-1.0.6/doc/locale/*/LC_MESSAGES/auto_examples/features/roi_grid.po
Languages: fr

source: :ref:`Go to the end <sphx_glr_download_auto_examples_features_roi_grid.py>` to download the full example code.
fr: :ref:`Aller à la fin <sphx_glr_download_auto_examples_features_roi_grid.py>` pour télécharger le code complet de l'exemple.

source: ROI Grid Generation
fr: Génération de grille de ROI

source: This example focuses on generating grids of rectangular ROIs for systematic analysis of regular patterns in images using Sigima's ROI grid feature. Using a real laser spot array image, we'll explore how to create, configure, and apply ROI grids for extracting individual spots.
fr: Cet exemple se concentre sur la génération de grilles de ROI rectangulaires pour l'analyse systématique de motifs réguliers dans les images à l'aide de la fonctionnalité de grille de ROI de Sigima. En utilisant une image réelle de matrice de spots laser, nous explorerons comment créer, configurer et appliquer des grilles de ROI pour extraire des spots individuels.

source: The example shows:
fr: Cet exemple montre :

source: Loading a real-world laser spot array image
fr: Le chargement d'une image réelle de matrice de spots laser

source: Extracting a sub-region for clearer visualization
fr: L'extraction d'une sous-région pour une visualisation plus claire

source: Generating a grid of rectangular ROIs
fr: La génération d'une grille de ROI rectangulaires

source: Configuring grid parameters (size, translation, step spacing)
fr: La configuration des paramètres de la grille (taille, translation, espacement)

source: Understanding direction labels (row/column ordering)
fr: La compréhension des labels de direction (ordre des lignes/colonnes)

source: Extracting individual spots using the generated ROIs
fr: L'extraction de spots individuels à l'aide des ROI générées

source: Visualizing the ROIs on the image
fr: La visualisation des ROI sur l'image

source: This tutorial uses PlotPy for visualization, providing interactive plots that allow you to explore the ROI grid placement in detail.
fr: Ce tutoriel utilise PlotPy pour la visualisation, fournissant des graphiques interactifs qui permettent d'explorer en détail le placement de la grille de ROI.

source: Importing necessary modules
fr: Importation des modules nécessaires

source: We'll start by importing all the required modules for image processing and visualization.
fr: Nous commencerons par importer tous les modules nécessaires au traitement d'images et à la visualisation.

source: Loading a real laser spot array image
fr: Chargement d'une image réelle de matrice de spots laser

source: We'll use a laser spot array image with a 6×6 grid of spots. This is a realistic example where we need to analyze each spot individually.
fr: Nous utiliserons une image de matrice de spots laser avec une grille 6×6 de spots. C'est un exemple réaliste où nous devons analyser chaque spot individuellement.

source: Extracting a 2×2 sub-region
fr: Extraction d'une sous-région 2×2

source: For clearer visualization of the ROI grid feature, we'll extract a 2×2 sub-region from the center of the full 6×6 spot array.
fr: Pour une visualisation plus claire de la fonctionnalité de grille de ROI, nous extrairons une sous-région 2×2 du centre de la matrice complète 6×6 de spots.

source: Creating a basic grid of ROIs
fr: Création d'une grille de base de ROI

source: Now we'll generate a 2×2 grid of ROIs to match the extracted spot array. Each ROI will be centered on a spot for individual analysis.
fr: Nous allons maintenant générer une grille 2×2 de ROI correspondant à la matrice de spots extraite. Chaque ROI sera centrée sur un spot pour une analyse individuelle.

source: Extracting individual spots
fr: Extraction de spots individuels

source: Once the ROI grid is defined, we can extract individual spots as separate images for further analysis.
fr: Une fois la grille de ROI définie, nous pouvons extraire les spots individuels sous forme d'images séparées pour une analyse plus approfondie.

source: Adjusting ROI size and position
fr: Ajustement de la taille et de la position des ROI

source: The ROI size and translation parameters control how the ROIs are placed within each grid cell. Let's explore different configurations.
fr: Les paramètres de taille et de translation des ROI contrôlent comment les ROI sont placées dans chaque cellule de la grille. Explorons différentes configurations.

source: Understanding direction labels
fr: Compréhension des labels de direction

source: The xdirection and ydirection parameters control how rows and columns are numbered. This affects the ROI titles but not the geometry.
fr: Les paramètres xdirection et ydirection contrôlent comment les lignes et les colonnes sont numérotées. Cela affecte les titres des ROI mais pas la géométrie.

source: Summary and conclusions
fr: Résumé et conclusions

source: This tutorial demonstrated the key concepts of ROI grid generation for systematic analysis of regular patterns in images using Sigima.
fr: Ce tutoriel a présenté les concepts clés de la génération de grille de ROI pour l'analyse systématique de motifs réguliers dans les images à l'aide de Sigima.

source: :download:`Download Jupyter notebook: roi_grid.ipynb <roi_grid.ipynb>`
fr: :download:`Télécharger le notebook Jupyter : roi_grid.ipynb <roi_grid.ipynb>`

source: :download:`Download Python source code: roi_grid.py <roi_grid.py>`
fr: :download:`Télécharger le code source Python : roi_grid.py <roi_grid.py>`

source: :download:`Download zipped: roi_grid.zip <roi_grid.zip>`
fr: :download:`Télécharger l'archive : roi_grid.zip <roi_grid.zip>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
fr: `Galerie générée par Sphinx-Gallery <https://sphinx-gallery.github.io>`_
