Repository: pypi-data/pypi-mirror-404
Catalog: packages/sigima/sigima-1.0.6.tar.gz/sigima-1.0.6/doc/locale/*/LC_MESSAGES/auto_examples/features/zero_padding.po
Languages: fr

source: Zero Padding for FFT Enhancement
fr: Remplissage par zéro pour l'amélioration de la FFT

source: This example demonstrates how to apply zero-padding to signals, a common technique used to improve FFT frequency resolution. It shows the proper usage of :class:`sigima.params.ZeroPadding1DParam`, including the important ``update_from_obj()`` call.
fr: Cet exemple montre comment appliquer un remplissage par zéro aux signaux, une technique courante utilisée pour améliorer la résolution en fréquence de la FFT. Il montre l'utilisation correcte de :class:`sigima.params.ZeroPadding1DParam`, y compris l'appel important à ``update_from_obj()``.

source: Zero-padding adds zeros to a signal, effectively interpolating the frequency domain representation. This is particularly useful for:
fr: Le remplissage par zéro ajoute des zéros à un signal, interpolant ainsi la représentation dans le domaine fréquentiel. Cela est particulièrement utile pour :

source: Improving frequency resolution in FFT analysis
fr: Amélioration de la résolution en fréquence dans l'analyse FFT

source: Preparing signals for convolution operations
fr: Préparation des signaux pour les opérations de convolution

source: Matching signal lengths for spectral comparisons
fr: Correspondance des longueurs de signal pour les comparaisons spectrales

source: Importing the required modules
fr: Importation des modules requis

source: Create a test signal
fr: Créer un signal de test

source: We create a simple cosine signal with a specific frequency.
fr: Nous créons un simple signal cosinus avec une fréquence spécifique.

source: Zero-padding with "next_pow2" strategy
fr: Remplissage par zéro avec la stratégie "next_pow2"

source: The "next_pow2" strategy pads the signal to the next power of 2, which is optimal for FFT computations.
fr: La stratégie "next_pow2" remplit le signal jusqu'à la prochaine puissance de 2, ce qui est optimal pour les calculs FFT.

source: When using strategies other than "custom", you **must call** ``update_from_obj()`` to compute the number of padding points based on the actual signal size.
fr: Lors de l'utilisation de stratégies autres que "custom", vous **devez appeler** ``update_from_obj()`` pour calculer le nombre de points de remplissage en fonction de la taille réelle du signal.

source: Compare original and padded signals
fr: Comparer les signaux originaux et remplis

source: The padded signal has zeros appended at the end.
fr: Le signal rempli a des zéros ajoutés à la fin.

source: FFT comparison: improved frequency resolution
fr: Comparaison FFT : résolution en fréquence améliorée

source: Zero-padding improves the apparent frequency resolution of the FFT by interpolating between frequency bins.
fr: Le remplissage par zéro améliore la résolution en fréquence apparente de la FFT en interpolant entre les bins de fréquence.

source: Using different strategies
fr: Utilisation de différentes stratégies

source: The available strategies are:
fr: Les stratégies disponibles sont :

source: ``"next_pow2"``: Pad to the next power of 2 (optimal for FFT)
fr: ``"next_pow2"`` : Remplir jusqu'à la prochaine puissance de 2 (optimal pour la FFT)

source: ``"double"``: Double the signal length
fr: ``"double"`` : Doubler la longueur du signal

source: ``"triple"``: Triple the signal length
fr: ``"triple"`` : Tripler la longueur du signal

source: ``"custom"``: Specify the exact number of points to add
fr: ``"custom"`` : Spécifier le nombre exact de points à ajouter

source: Using "custom" strategy
fr: Utilisation de la stratégie "custom"

source: With the "custom" strategy, you specify the exact number of points. In this case, ``update_from_obj()`` is not strictly necessary (but harmless).
fr: Avec la stratégie "custom", vous spécifiez le nombre exact de points. Dans ce cas, ``update_from_obj()`` n'est pas strictement nécessaire (mais sans danger).

source: Choosing padding location
fr: Choix de l'emplacement du remplissage

source: Zero-padding can be applied at different locations:
fr: Le remplissage par zéro peut être appliqué à différents emplacements :

source: ``"append"``: Add zeros at the end (default)
fr: ``"append"`` : Ajouter des zéros à la fin (par défaut)

source: ``"prepend"``: Add zeros at the beginning
fr: ``"prepend"`` : Ajouter des zéros au début

source: ``"both"``: Split zeros between beginning and end
fr: ``"both"`` : Répartir les zéros entre le début et la fin

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
fr: `Galerie générée par Sphinx-Gallery <https://sphinx-gallery.github.io>`_
