Repository: pypi-data/pypi-mirror-404
Catalog: packages/invenio-drafts-resources/invenio_drafts_resources-8.0.0-py2.py3-none-any.whl/invenio_drafts_resources/translations/*/LC_MESSAGES/messages.po
Languages: tr

source: Redirecting...
tr: Yönlendiriliyor...

source: Best match
tr: En iyi eşleşme

source: Newest
tr: Yeniden eskiye

source: Oldest
tr: Eskiden yeniye

source: Version
tr: Sürüm

source: Recently updated
tr: En son güncellenene göre

source: Least recently updated
tr: İlk güncellenene göre

source: Records should be updated via their draft.
tr: Kayıtlar, taslakları üzerinden güncellenmelidir.

source: Failed to fetch the record versions.
tr: Kayıt sürümlerini getirme başarısız oldu.

source: Files support is not enabled.
tr: Dosya desteği etkin değildir.

source: You don't have permissions to manage files options.
tr: Dosya seçeneklerini yönetme izniniz yok.

source: Missing uploaded files. To disable files for this record please mark it as metadata-only.
tr: Yüklenen dosyalar eksik. Bu kayıt için olan dosyaları devre dışı bırakmak için lütfen kaydı "Sadece Üst Veri" olarak işaretleyin.

source: Missing uploaded files.
tr: Karşıya yüklenen dosyalar bulunamadı.

source: One or more files have not completed their transfer, please wait.
tr: Bir veya daha fazla dosyanın aktarımı tamamlanmadı, lütfen bekleyin.

source: Files support must be enabled.
tr: Dosya desteği etkinleştirilmelidir.

source: Please remove all files first.
tr: Lütfen önce tüm dosyaları kaldırın.

source: The record has no files.
tr: Bu kayıt hiç dosya içermemekte.
